remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/**
 * \file
 *
 * \brief Component description for LPMCU_MISC_REGS
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_LPMCU_MISC_REGS_COMPONENT_
#define _SAMB11_LPMCU_MISC_REGS_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR LPMCU_MISC_REGS */
/* ========================================================================== */
/** \addtogroup SAMB11_LPMCU_MISC_REGS LPMCU Misc Registers 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define LPMCU_MISC_REGS_LMR1234
#define REV_LPMCU_MISC_REGS              0x100

/* -------- LPMCU_MISC_REGS_LPMCU_CHIP_ID : (LPMCU_MISC_REGS Offset: 0x00) (R/ 32) The hard-coded ID for the chip. -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t REV_ID:24;                 /**< bit:  0..23  Chip ID                                  */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_LPMCU_CHIP_ID_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_LPMCU_CHIP_ID_OFFSET 0x00                                          /**<  (LPMCU_MISC_REGS_LPMCU_CHIP_ID) The hard-coded ID for the chip.  Offset */
#define LPMCU_MISC_REGS_LPMCU_CHIP_ID_RESETVALUE 0x2000B0u                                     /**<  (LPMCU_MISC_REGS_LPMCU_CHIP_ID) The hard-coded ID for the chip.  Reset Value */

#define LPMCU_MISC_REGS_LPMCU_CHIP_ID_REV_ID_Pos 0                                              /**< (LPMCU_MISC_REGS_LPMCU_CHIP_ID) Chip ID Position */
#define LPMCU_MISC_REGS_LPMCU_CHIP_ID_REV_ID_Msk (0xFFFFFFu << LPMCU_MISC_REGS_LPMCU_CHIP_ID_REV_ID_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CHIP_ID) Chip ID Mask */
#define LPMCU_MISC_REGS_LPMCU_CHIP_ID_REV_ID(value) (LPMCU_MISC_REGS_LPMCU_CHIP_ID_REV_ID_Msk & ((value) << LPMCU_MISC_REGS_LPMCU_CHIP_ID_REV_ID_Pos))
#define LPMCU_MISC_REGS_LPMCU_CHIP_ID_MASK  0xFFFFFFu                                      /**< \deprecated (LPMCU_MISC_REGS_LPMCU_CHIP_ID) Register MASK  (Use LPMCU_MISC_REGS_LPMCU_CHIP_ID_Msk instead)  */
#define LPMCU_MISC_REGS_LPMCU_CHIP_ID_Msk   0xFFFFFFu                                      /**< (LPMCU_MISC_REGS_LPMCU_CHIP_ID) Register Mask  */

/* -------- LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0 : (LPMCU_MISC_REGS Offset: 0x04) (R/W 32) Active Low Global Reset -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t GLOBAL_RSTN:1;             /**< bit:      0  LPMCU Global Reset (self setting)        */
    uint32_t CPU_RSTN:1;                /**< bit:      1  LPMCU CPU Reset                          */
    uint32_t SPI_FLASH0_SYS_RSTN:1;     /**< bit:      2  SPI_FLASH0 Sys Reset                     */
    uint32_t SPI_FLASH0_RSTN:1;         /**< bit:      3  SPI_FLASH0 Interface Reset               */
    uint32_t SPI0_CORE_RSTN:1;          /**< bit:      4  SPI0 Core Reset                          */
    uint32_t SPI0_IF_RSTN:1;            /**< bit:      5  SPI0 Interface Reset                     */
    uint32_t SPI1_CORE_RESETN:1;        /**< bit:      6  SPI1 Core Reset                          */
    uint32_t SPI1_IF_RSTN:1;            /**< bit:      7  SPI1 Interface Reset                     */
    uint32_t I2C0_CORE_RSTN:1;          /**< bit:      8  I2C0 Core Reset                          */
    uint32_t I2C0_IF_RSTN:1;            /**< bit:      9  I2C0 Interface Reset                     */
    uint32_t GPIO_RSTN:1;               /**< bit:     10  GPIO Controller Reset                    */
    uint32_t TIMER0_RSTN:1;             /**< bit:     11  TIMER0 Reset                             */
    uint32_t UART0_CORE_RSTN:1;         /**< bit:     12  UART0 Core Reset                         */
    uint32_t UART0_IF_RSTN:1;           /**< bit:     13  UART0 Interface Reset                    */
    uint32_t UART1_CORE_RSTN:1;         /**< bit:     14  UART1 Core Reset                         */
    uint32_t UART1_IF_RSTN:1;           /**< bit:     15  UART1 Interface Reset                    */
    uint32_t WDT0_RSTN:1;               /**< bit:     16  WDT0 Reset                               */
    uint32_t WDT1_RSTN:1;               /**< bit:     17  WDT1 Reset                               */
    uint32_t IRQ_CTRLR_CORE_RSTN:1;     /**< bit:     18  NVIC Reset                               */
    uint32_t MBIST_RSTN:1;              /**< bit:     19  MBIST Logic Reset                        */
    uint32_t CALIB_RSTN:1;              /**< bit:     20  Low Power Clock Calibration Core Reset   */
    uint32_t CALIB_XBAR_IF_RSTN:1;      /**< bit:     21  Low Power Clock Calibration APB Reset    */
    uint32_t DBUG_RSTN:1;               /**< bit:     22  LPMCU Debug Reset                        */
    uint32_t ARM_FREE_CLK_RSTN:1;       /**< bit:     23  Free Running ARM Clock Reset             */
    uint32_t ARM_PRESETN_RSTN:1;        /**< bit:     24  ARM APB Reset                            */
    uint32_t QUAD_DEC0_RSTN:1;          /**< bit:     25  QUAD_DEC0 Reset                          */
    uint32_t QUAD_DEC1_RSTN:1;          /**< bit:     26  QUAD_DEC1 Reset                          */
    uint32_t QUAD_DEC2_RSTN:1;          /**< bit:     27  QUAD_DEC2 Reset                          */
    uint32_t PWM0_RSTN:1;               /**< bit:     28  PWM0 Reset                               */
    uint32_t PWM1_RSTN:1;               /**< bit:     29  PWM1 Reset                               */
    uint32_t PWM2_RSTN:1;               /**< bit:     30  PWM2 Reset                               */
    uint32_t PWM3_RSTN:1;               /**< bit:     31  PWM3 Reset                               */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_OFFSET 0x04                                          /**<  (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) Active Low Global Reset  Offset */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_RESETVALUE 0xFFFFFFFDu                                   /**<  (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) Active Low Global Reset  Reset Value */

