remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GLOBAL_RSTN_Pos 0                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) LPMCU Global Reset (self setting) Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GLOBAL_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GLOBAL_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) LPMCU Global Reset (self setting) Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GLOBAL_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GLOBAL_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GLOBAL_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CPU_RSTN_Pos 1                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) LPMCU CPU Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CPU_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CPU_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) LPMCU CPU Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CPU_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CPU_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CPU_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_SYS_RSTN_Pos 2                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI_FLASH0 Sys Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_SYS_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_SYS_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI_FLASH0 Sys Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_SYS_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_SYS_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_SYS_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_RSTN_Pos 3                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI_FLASH0 Interface Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI_FLASH0 Interface Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI_FLASH0_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_CORE_RSTN_Pos 4                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI0 Core Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_CORE_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_CORE_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI0 Core Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_CORE_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_CORE_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_CORE_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_IF_RSTN_Pos 5                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI0 Interface Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_IF_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_IF_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI0 Interface Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_IF_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_IF_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI0_IF_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_CORE_RESETN_Pos 6                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI1 Core Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_CORE_RESETN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_CORE_RESETN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI1 Core Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_CORE_RESETN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_CORE_RESETN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_CORE_RESETN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_IF_RSTN_Pos 7                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI1 Interface Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_IF_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_IF_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) SPI1 Interface Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_IF_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_IF_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_SPI1_IF_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_CORE_RSTN_Pos 8                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) I2C0 Core Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_CORE_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_CORE_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) I2C0 Core Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_CORE_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_CORE_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_CORE_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_IF_RSTN_Pos 9                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) I2C0 Interface Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_IF_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_IF_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) I2C0 Interface Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_IF_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_IF_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_I2C0_IF_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GPIO_RSTN_Pos 10                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) GPIO Controller Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GPIO_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GPIO_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) GPIO Controller Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GPIO_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GPIO_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_GPIO_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_TIMER0_RSTN_Pos 11                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) TIMER0 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_TIMER0_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_TIMER0_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) TIMER0 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_TIMER0_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_TIMER0_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_TIMER0_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_CORE_RSTN_Pos 12                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) UART0 Core Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_CORE_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_CORE_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) UART0 Core Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_CORE_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_CORE_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_CORE_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_IF_RSTN_Pos 13                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) UART0 Interface Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_IF_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_IF_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) UART0 Interface Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_IF_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_IF_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART0_IF_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_CORE_RSTN_Pos 14                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) UART1 Core Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_CORE_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_CORE_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) UART1 Core Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_CORE_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_CORE_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_CORE_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_IF_RSTN_Pos 15                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) UART1 Interface Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_IF_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_IF_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) UART1 Interface Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_IF_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_IF_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_UART1_IF_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT0_RSTN_Pos 16                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) WDT0 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT0_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT0_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) WDT0 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT0_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT0_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT0_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT1_RSTN_Pos 17                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) WDT1 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT1_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT1_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) WDT1 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT1_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT1_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_WDT1_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_IRQ_CTRLR_CORE_RSTN_Pos 18                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) NVIC Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_IRQ_CTRLR_CORE_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_IRQ_CTRLR_CORE_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) NVIC Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_IRQ_CTRLR_CORE_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_IRQ_CTRLR_CORE_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_IRQ_CTRLR_CORE_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_MBIST_RSTN_Pos 19                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) MBIST Logic Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_MBIST_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_MBIST_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) MBIST Logic Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_MBIST_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_MBIST_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_MBIST_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_RSTN_Pos 20                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) Low Power Clock Calibration Core Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) Low Power Clock Calibration Core Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_XBAR_IF_RSTN_Pos 21                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) Low Power Clock Calibration APB Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_XBAR_IF_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_XBAR_IF_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) Low Power Clock Calibration APB Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_XBAR_IF_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_XBAR_IF_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_CALIB_XBAR_IF_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_DBUG_RSTN_Pos 22                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) LPMCU Debug Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_DBUG_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_DBUG_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) LPMCU Debug Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_DBUG_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_DBUG_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_DBUG_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_FREE_CLK_RSTN_Pos 23                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) Free Running ARM Clock Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_FREE_CLK_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_FREE_CLK_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) Free Running ARM Clock Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_FREE_CLK_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_FREE_CLK_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_FREE_CLK_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_PRESETN_RSTN_Pos 24                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) ARM APB Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_PRESETN_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_PRESETN_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) ARM APB Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_PRESETN_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_PRESETN_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_ARM_PRESETN_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC0_RSTN_Pos 25                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) QUAD_DEC0 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC0_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC0_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) QUAD_DEC0 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC0_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC0_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC0_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC1_RSTN_Pos 26                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) QUAD_DEC1 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC1_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC1_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) QUAD_DEC1 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC1_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC1_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC1_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC2_RSTN_Pos 27                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) QUAD_DEC2 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC2_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC2_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) QUAD_DEC2 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC2_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC2_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_QUAD_DEC2_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM0_RSTN_Pos 28                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) PWM0 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM0_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM0_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) PWM0 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM0_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM0_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM0_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM1_RSTN_Pos 29                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) PWM1 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM1_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM1_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) PWM1 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM1_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM1_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM1_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM2_RSTN_Pos 30                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) PWM2 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM2_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM2_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) PWM2 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM2_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM2_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM2_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM3_RSTN_Pos 31                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) PWM3 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM3_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM3_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) PWM3 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM3_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM3_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_PWM3_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) Register MASK  (Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_Msk instead)  */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0) Register Mask  */

