remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1 : (LPMCU_MISC_REGS Offset: 0x08) (R/W 16) Active Low Global Reset -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t DUALTIMER0_RSTN:1;         /**< bit:      0  DUALTIMER0 Reset                         */
    uint16_t I2C1_CORE_RSTN:1;          /**< bit:      1  I2C1 Core Reset                          */
    uint16_t I2C1_IF_RSTN:1;            /**< bit:      2  I2C1 Interface Reset                     */
    uint16_t SECURITY_SHA_CORE_RSTN:1;  /**< bit:      3  Security SHA Core Reset                  */
    uint16_t SECURITY_SHA_AHB_RSTN:1;   /**< bit:      4  Security SHA AHB Interface Reset         */
    uint16_t SECURITY_AES_CORE_RSTN:1;  /**< bit:      5  Security AES Core Reset                  */
    uint16_t SECURITY_AES_AHB_RSTN:1;   /**< bit:      6  Security AES AHB Interface Reset         */
    uint16_t SPI0_SCK_CLK_RSTN:1;       /**< bit:      7  SPI0 SCK Clock Reset                     */
    uint16_t SPI1_SCK_CLK_RSTN:1;       /**< bit:      8  SPI1 SCK Clock Reset                     */
    uint16_t SPI0_SCK_PHASE_INT_CLK_RSTN:1;  /**< bit:      9  SPI0 SCK Phase Clock Reset               */
    uint16_t SPI1_SCK_PHASE_INT_CLK_RSTN:1;  /**< bit:     10  SPI1 SCK Phase Clock Reset               */
    uint16_t PROV_DMA_CTRL0_RSTN:1;     /**< bit:     11  PROV_DMA_CTRL0 Reset                     */
    uint16_t :4;                        /**< bit: 12..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_OFFSET 0x08                                          /**<  (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Active Low Global Reset  Offset */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_RESETVALUE 0xFFFu                                        /**<  (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Active Low Global Reset  Reset Value */

#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_DUALTIMER0_RSTN_Pos 0                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) DUALTIMER0 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_DUALTIMER0_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_DUALTIMER0_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) DUALTIMER0 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_DUALTIMER0_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_DUALTIMER0_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_DUALTIMER0_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_CORE_RSTN_Pos 1                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) I2C1 Core Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_CORE_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_CORE_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) I2C1 Core Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_CORE_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_CORE_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_CORE_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_IF_RSTN_Pos 2                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) I2C1 Interface Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_IF_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_IF_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) I2C1 Interface Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_IF_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_IF_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_I2C1_IF_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_CORE_RSTN_Pos 3                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Security SHA Core Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_CORE_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_CORE_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Security SHA Core Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_CORE_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_CORE_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_CORE_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_AHB_RSTN_Pos 4                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Security SHA AHB Interface Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_AHB_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_AHB_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Security SHA AHB Interface Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_AHB_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_AHB_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_SHA_AHB_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_CORE_RSTN_Pos 5                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Security AES Core Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_CORE_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_CORE_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Security AES Core Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_CORE_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_CORE_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_CORE_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_AHB_RSTN_Pos 6                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Security AES AHB Interface Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_AHB_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_AHB_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Security AES AHB Interface Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_AHB_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_AHB_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SECURITY_AES_AHB_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_CLK_RSTN_Pos 7                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) SPI0 SCK Clock Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_CLK_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_CLK_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) SPI0 SCK Clock Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_CLK_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_CLK_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_CLK_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_CLK_RSTN_Pos 8                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) SPI1 SCK Clock Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_CLK_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_CLK_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) SPI1 SCK Clock Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_CLK_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_CLK_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_CLK_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_PHASE_INT_CLK_RSTN_Pos 9                                              /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) SPI0 SCK Phase Clock Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_PHASE_INT_CLK_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_PHASE_INT_CLK_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) SPI0 SCK Phase Clock Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_PHASE_INT_CLK_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_PHASE_INT_CLK_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI0_SCK_PHASE_INT_CLK_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_PHASE_INT_CLK_RSTN_Pos 10                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) SPI1 SCK Phase Clock Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_PHASE_INT_CLK_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_PHASE_INT_CLK_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) SPI1 SCK Phase Clock Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_PHASE_INT_CLK_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_PHASE_INT_CLK_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_SPI1_SCK_PHASE_INT_CLK_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_PROV_DMA_CTRL0_RSTN_Pos 11                                             /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) PROV_DMA_CTRL0 Reset Position */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_PROV_DMA_CTRL0_RSTN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_PROV_DMA_CTRL0_RSTN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) PROV_DMA_CTRL0 Reset Mask */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_PROV_DMA_CTRL0_RSTN LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_PROV_DMA_CTRL0_RSTN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_PROV_DMA_CTRL0_RSTN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_MASK 0xFFFu                                         /**< \deprecated (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Register MASK  (Use LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_Msk instead)  */
#define LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_Msk 0xFFFu                                         /**< (LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1) Register Mask  */

/* -------- LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0 : (LPMCU_MISC_REGS Offset: 0x0c) (R/W 32) LPMCU Clock Enables -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t SPI_FLASH0_CLK_EN:1;       /**< bit:      1  SPI_FLASH0 Clock Enable                  */
    uint32_t SPI0_CORE_CLK_EN:1;        /**< bit:      2  SPI0 Core Clock Enable                   */
    uint32_t SPI1_CORE_CLK_EN:1;        /**< bit:      3  SPI1 Core Clock Enable                   */
    uint32_t I2C0_CORE_CLK_EN:1;        /**< bit:      4  I2C0 Core Clock Enable                   */
    uint32_t DUALTIMER0_CLK_EN:1;       /**< bit:      5  DUALTIMER0 Clock Enable                  */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t GPIO_CLK_EN:1;             /**< bit:      7  GPIO Controller Clock Enable             */
    uint32_t TIMER0_CLK_EN:1;           /**< bit:      8  TIMER0 Clock Enable                      */
    uint32_t :2;                        /**< bit:  9..10  Reserved */
    uint32_t WDT0_CLK_EN:1;             /**< bit:     11  WDT0 Clock Enable                        */
    uint32_t WDT1_CLK_EN:1;             /**< bit:     12  WDT1 Clock Enable                        */
    uint32_t UART0_CORE_CLK_EN:1;       /**< bit:     13  UART0 Core Clock Enable                  */
    uint32_t UART0_IF_CLK_EN:1;         /**< bit:     14  UART0 Interface Clock Enable             */
    uint32_t UART1_CORE_CLK_EN:1;       /**< bit:     15  UART1 Core Clock Enable                  */
    uint32_t UART1_IF_CLK_EN:1;         /**< bit:     16  UART1 Interface Clock Enable             */
    uint32_t IRQ_CTRLR_CORE_CLK_EN:1;   /**< bit:     17  NVIC Clock Enable                        */
    uint32_t IDRAM_1_GL_MEM_CLK_EN:1;   /**< bit:     18  IDRAM1 Glue Logic Clock Enable           */
    uint32_t IDRAM_2_GL_MEM_CLK_EN:1;   /**< bit:     19  IDRAM2 Glue Logic Clock Enable           */
    uint32_t ROM_MEM_CLK_EN:1;          /**< bit:     20  ROM Clock Enable                         */
    uint32_t CALIB_XBAR_IF_CLK_EN:1;    /**< bit:     21  Low Power Clock Calibration Interface Clock Enable */
    uint32_t AON_WRAPPER_CLK_EN:1;      /**< bit:     22  AON Wrapper Clock Enable                 */
    uint32_t ARM_PCLK_EN:1;             /**< bit:     23  ARM PCLK Clock Enable (override)         */
    uint32_t ARM_PCLKG_EN:1;            /**< bit:     24  ARM Gated PCLK Clock Enable (override)   */
    uint32_t BLE_MEM_CLK_EN:1;          /**< bit:     25  ARM BLE 8K Retention Memory Clock Enable */
    uint32_t QUAD_DEC0_CLK_EN:1;        /**< bit:     26  QUAD_DEC0 Clock Enable                   */
    uint32_t QUAD_DEC1_CLK_EN:1;        /**< bit:     27  QUAD_DEC1 Clock Enable                   */
    uint32_t QUAD_DEC2_CLK_EN:1;        /**< bit:     28  QUAD_DEC2 Clock Enable                   */
    uint32_t I2C1_CORE_CLK_EN:1;        /**< bit:     29  I2C1 Core Clock Enable                   */
    uint32_t CALIB_CLK_EN:1;            /**< bit:     30  Low Power Clock Calibration Core Clock Enable */
    uint32_t :1;                        /**< bit:     31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

