remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_OFFSET 0x0C                                          /**<  (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) LPMCU Clock Enables  Offset */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_RESETVALUE 0x627FF9BEu                                   /**<  (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) LPMCU Clock Enables  Reset Value */

#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI_FLASH0_CLK_EN_Pos 1                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) SPI_FLASH0 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI_FLASH0_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI_FLASH0_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) SPI_FLASH0 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI_FLASH0_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI_FLASH0_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI_FLASH0_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI0_CORE_CLK_EN_Pos 2                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) SPI0 Core Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI0_CORE_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI0_CORE_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) SPI0 Core Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI0_CORE_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI0_CORE_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI0_CORE_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI1_CORE_CLK_EN_Pos 3                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) SPI1 Core Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI1_CORE_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI1_CORE_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) SPI1 Core Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI1_CORE_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI1_CORE_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_SPI1_CORE_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C0_CORE_CLK_EN_Pos 4                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) I2C0 Core Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C0_CORE_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C0_CORE_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) I2C0 Core Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C0_CORE_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C0_CORE_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C0_CORE_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_DUALTIMER0_CLK_EN_Pos 5                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) DUALTIMER0 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_DUALTIMER0_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_DUALTIMER0_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) DUALTIMER0 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_DUALTIMER0_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_DUALTIMER0_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_DUALTIMER0_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_GPIO_CLK_EN_Pos 7                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) GPIO Controller Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_GPIO_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_GPIO_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) GPIO Controller Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_GPIO_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_GPIO_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_GPIO_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_TIMER0_CLK_EN_Pos 8                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) TIMER0 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_TIMER0_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_TIMER0_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) TIMER0 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_TIMER0_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_TIMER0_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_TIMER0_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT0_CLK_EN_Pos 11                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) WDT0 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT0_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT0_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) WDT0 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT0_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT0_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT0_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT1_CLK_EN_Pos 12                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) WDT1 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT1_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT1_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) WDT1 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT1_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT1_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_WDT1_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_CORE_CLK_EN_Pos 13                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) UART0 Core Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_CORE_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_CORE_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) UART0 Core Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_CORE_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_CORE_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_CORE_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_IF_CLK_EN_Pos 14                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) UART0 Interface Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_IF_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_IF_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) UART0 Interface Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_IF_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_IF_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART0_IF_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_CORE_CLK_EN_Pos 15                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) UART1 Core Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_CORE_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_CORE_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) UART1 Core Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_CORE_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_CORE_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_CORE_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_IF_CLK_EN_Pos 16                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) UART1 Interface Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_IF_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_IF_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) UART1 Interface Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_IF_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_IF_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_UART1_IF_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IRQ_CTRLR_CORE_CLK_EN_Pos 17                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) NVIC Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IRQ_CTRLR_CORE_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IRQ_CTRLR_CORE_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) NVIC Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IRQ_CTRLR_CORE_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IRQ_CTRLR_CORE_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IRQ_CTRLR_CORE_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_1_GL_MEM_CLK_EN_Pos 18                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) IDRAM1 Glue Logic Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_1_GL_MEM_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_1_GL_MEM_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) IDRAM1 Glue Logic Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_1_GL_MEM_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_1_GL_MEM_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_1_GL_MEM_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_2_GL_MEM_CLK_EN_Pos 19                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) IDRAM2 Glue Logic Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_2_GL_MEM_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_2_GL_MEM_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) IDRAM2 Glue Logic Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_2_GL_MEM_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_2_GL_MEM_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_IDRAM_2_GL_MEM_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ROM_MEM_CLK_EN_Pos 20                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) ROM Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ROM_MEM_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ROM_MEM_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) ROM Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ROM_MEM_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ROM_MEM_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ROM_MEM_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_XBAR_IF_CLK_EN_Pos 21                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) Low Power Clock Calibration Interface Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_XBAR_IF_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_XBAR_IF_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) Low Power Clock Calibration Interface Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_XBAR_IF_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_XBAR_IF_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_XBAR_IF_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_AON_WRAPPER_CLK_EN_Pos 22                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) AON Wrapper Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_AON_WRAPPER_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_AON_WRAPPER_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) AON Wrapper Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_AON_WRAPPER_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_AON_WRAPPER_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_AON_WRAPPER_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLK_EN_Pos 23                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) ARM PCLK Clock Enable (override) Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) ARM PCLK Clock Enable (override) Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLKG_EN_Pos 24                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) ARM Gated PCLK Clock Enable (override) Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLKG_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLKG_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) ARM Gated PCLK Clock Enable (override) Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLKG_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLKG_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_ARM_PCLKG_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_BLE_MEM_CLK_EN_Pos 25                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) ARM BLE 8K Retention Memory Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_BLE_MEM_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_BLE_MEM_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) ARM BLE 8K Retention Memory Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_BLE_MEM_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_BLE_MEM_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_BLE_MEM_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC0_CLK_EN_Pos 26                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) QUAD_DEC0 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC0_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC0_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) QUAD_DEC0 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC0_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC0_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC0_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC1_CLK_EN_Pos 27                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) QUAD_DEC1 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC1_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC1_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) QUAD_DEC1 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC1_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC1_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC1_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC2_CLK_EN_Pos 28                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) QUAD_DEC2 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC2_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC2_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) QUAD_DEC2 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC2_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC2_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_QUAD_DEC2_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C1_CORE_CLK_EN_Pos 29                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) I2C1 Core Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C1_CORE_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C1_CORE_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) I2C1 Core Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C1_CORE_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C1_CORE_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_I2C1_CORE_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_CLK_EN_Pos 30                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) Low Power Clock Calibration Core Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) Low Power Clock Calibration Core Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_CALIB_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_MASK 0x7FFFF9BEu                                    /**< \deprecated (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) Register MASK  (Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_Msk instead)  */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_Msk 0x7FFFF9BEu                                    /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0) Register Mask  */

