remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1 : (LPMCU_MISC_REGS Offset: 0x10) (R/W 32) LPMCU Clock Enables -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EFUSE0_CLK_EN:1;           /**< bit:      0  EFUSE0 Clock Enable                      */
    uint32_t EFUSE1_CLK_EN:1;           /**< bit:      1  EFUSE1 Clock Enable                      */
    uint32_t EFUSE2_CLK_EN:1;           /**< bit:      2  EFUSE2 Clock Enable                      */
    uint32_t EFUSE3_CLK_EN:1;           /**< bit:      3  EFUSE3 Clock Enable                      */
    uint32_t EFUSE4_CLK_EN:1;           /**< bit:      4  EFUSE4 Clock Enable                      */
    uint32_t EFUSE5_CLK_EN:1;           /**< bit:      5  EFUSE5 Clock Enable                      */
    uint32_t PWM0_CLK_EN:1;             /**< bit:      6  PWM0 Clock Enable                        */
    uint32_t PWM1_CLK_EN:1;             /**< bit:      7  PWM1 Clock Enable                        */
    uint32_t PWM2_CLK_EN:1;             /**< bit:      8  PWM2 Clock Enable                        */
    uint32_t PWM3_CLK_EN:1;             /**< bit:      9  PWM3 Clock Enable                        */
    uint32_t SENS_ADC_CLK_EN:1;         /**< bit:     10  PMU Sensor ADC Clock Enable              */
    uint32_t SPI0_SCK_PHASE_INT_CLK_EN:1;  /**< bit:     11  SPI0 SCK Phase Internal Clock Enable     */
    uint32_t SPI1_SCK_PHASE_INT_CLK_EN:1;  /**< bit:     12  SPI1 SCK Phase Internal Clock Enable     */
    uint32_t GPIO_GCLK_EN:1;            /**< bit:     13  GPIO Controller Clock Enable             */
    uint32_t TIMER0_PGCLK_EN:1;         /**< bit:     14  TIMER0 Gated APB Clock                   */
    uint32_t SHA_CORE_CLK_EN:1;         /**< bit:     15  SHA Core Clock Enable                    */
    uint32_t SHA_AHB_CLK_EN:1;          /**< bit:     16  SHA AHB Clock Enable                     */
    uint32_t AES_CORE_CLK_EN:1;         /**< bit:     17  AES Core Clock Enable                    */
    uint32_t AES_AHB_CLK_EN:1;          /**< bit:     18  AES AHB Clock Enable                     */
    uint32_t IDRAM_1_0_MEM_CLK_EN:1;    /**< bit:     19  IDRAM1_0 Memory Clock Enable             */
    uint32_t IDRAM_1_1_MEM_CLK_EN:1;    /**< bit:     20  IDRAM1_1 Memory Clock Enable             */
    uint32_t IDRAM_1_2_MEM_CLK_EN:1;    /**< bit:     21  IDRAM1_2 Memory Clock Enable             */
    uint32_t IDRAM_2_0_MEM_CLK_EN:1;    /**< bit:     22  IDRAM2_0 Memory Clock Enable             */
    uint32_t IDRAM_2_1_MEM_CLK_EN:1;    /**< bit:     23  IDRAM2_1 Memory Clock Enable             */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_OFFSET 0x10                                          /**<  (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) LPMCU Clock Enables  Offset */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_RESETVALUE 0xF8783Fu                                     /**<  (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) LPMCU Clock Enables  Reset Value */

#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE0_CLK_EN_Pos 0                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE0 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE0_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE0_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE0 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE0_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE0_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE0_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE1_CLK_EN_Pos 1                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE1 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE1_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE1_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE1 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE1_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE1_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE1_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE2_CLK_EN_Pos 2                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE2 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE2_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE2_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE2 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE2_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE2_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE2_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE3_CLK_EN_Pos 3                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE3 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE3_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE3_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE3 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE3_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE3_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE3_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE4_CLK_EN_Pos 4                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE4 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE4_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE4_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE4 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE4_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE4_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE4_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE5_CLK_EN_Pos 5                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE5 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE5_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE5_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) EFUSE5 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE5_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE5_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_EFUSE5_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM0_CLK_EN_Pos 6                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) PWM0 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM0_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM0_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) PWM0 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM0_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM0_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM0_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM1_CLK_EN_Pos 7                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) PWM1 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM1_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM1_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) PWM1 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM1_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM1_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM1_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM2_CLK_EN_Pos 8                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) PWM2 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM2_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM2_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) PWM2 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM2_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM2_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM2_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM3_CLK_EN_Pos 9                                              /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) PWM3 Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM3_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM3_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) PWM3 Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM3_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM3_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_PWM3_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SENS_ADC_CLK_EN_Pos 10                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) PMU Sensor ADC Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SENS_ADC_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SENS_ADC_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) PMU Sensor ADC Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SENS_ADC_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SENS_ADC_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SENS_ADC_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI0_SCK_PHASE_INT_CLK_EN_Pos 11                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) SPI0 SCK Phase Internal Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI0_SCK_PHASE_INT_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI0_SCK_PHASE_INT_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) SPI0 SCK Phase Internal Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI0_SCK_PHASE_INT_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI0_SCK_PHASE_INT_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI0_SCK_PHASE_INT_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI1_SCK_PHASE_INT_CLK_EN_Pos 12                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) SPI1 SCK Phase Internal Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI1_SCK_PHASE_INT_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI1_SCK_PHASE_INT_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) SPI1 SCK Phase Internal Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI1_SCK_PHASE_INT_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI1_SCK_PHASE_INT_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SPI1_SCK_PHASE_INT_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_GPIO_GCLK_EN_Pos 13                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) GPIO Controller Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_GPIO_GCLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_GPIO_GCLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) GPIO Controller Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_GPIO_GCLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_GPIO_GCLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_GPIO_GCLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_TIMER0_PGCLK_EN_Pos 14                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) TIMER0 Gated APB Clock Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_TIMER0_PGCLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_TIMER0_PGCLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) TIMER0 Gated APB Clock Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_TIMER0_PGCLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_TIMER0_PGCLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_TIMER0_PGCLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_CORE_CLK_EN_Pos 15                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) SHA Core Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_CORE_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_CORE_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) SHA Core Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_CORE_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_CORE_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_CORE_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_AHB_CLK_EN_Pos 16                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) SHA AHB Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_AHB_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_AHB_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) SHA AHB Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_AHB_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_AHB_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_SHA_AHB_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_CORE_CLK_EN_Pos 17                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) AES Core Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_CORE_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_CORE_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) AES Core Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_CORE_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_CORE_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_CORE_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_AHB_CLK_EN_Pos 18                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) AES AHB Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_AHB_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_AHB_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) AES AHB Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_AHB_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_AHB_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_AES_AHB_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_0_MEM_CLK_EN_Pos 19                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) IDRAM1_0 Memory Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_0_MEM_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_0_MEM_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) IDRAM1_0 Memory Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_0_MEM_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_0_MEM_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_0_MEM_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_1_MEM_CLK_EN_Pos 20                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) IDRAM1_1 Memory Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_1_MEM_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_1_MEM_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) IDRAM1_1 Memory Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_1_MEM_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_1_MEM_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_1_MEM_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_2_MEM_CLK_EN_Pos 21                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) IDRAM1_2 Memory Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_2_MEM_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_2_MEM_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) IDRAM1_2 Memory Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_2_MEM_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_2_MEM_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_1_2_MEM_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_0_MEM_CLK_EN_Pos 22                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) IDRAM2_0 Memory Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_0_MEM_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_0_MEM_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) IDRAM2_0 Memory Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_0_MEM_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_0_MEM_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_0_MEM_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_1_MEM_CLK_EN_Pos 23                                             /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) IDRAM2_1 Memory Clock Enable Position */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_1_MEM_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_1_MEM_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) IDRAM2_1 Memory Clock Enable Mask */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_1_MEM_CLK_EN LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_1_MEM_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_IDRAM_2_1_MEM_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_MASK 0xFFFFFFu                                      /**< \deprecated (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) Register MASK  (Use LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_Msk instead)  */
#define LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_Msk 0xFFFFFFu                                      /**< (LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1) Register Mask  */

