remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_BTMCU_CTRL : (LPMCU_MISC_REGS Offset: 0x14) (R/W 8) Miscellaneous BLE control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  RXTX_SEQ_CLK_EN:1;         /**< bit:      0  BLE RXTX Sequencer Clock Enable          */
    uint8_t  AHB_CLK_EN:1;              /**< bit:      1  BLE HAB Clock Enable                     */
    uint8_t  PERIPH_REGS_CLK_EN:1;      /**< bit:      2  BLE Periph Regs Clock Enable             */
    uint8_t  :5;                        /**< bit:   3..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_BTMCU_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_BTMCU_CTRL_OFFSET   0x14                                          /**<  (LPMCU_MISC_REGS_BTMCU_CTRL) Miscellaneous BLE control  Offset */
#define LPMCU_MISC_REGS_BTMCU_CTRL_RESETVALUE 0x07u                                         /**<  (LPMCU_MISC_REGS_BTMCU_CTRL) Miscellaneous BLE control  Reset Value */

#define LPMCU_MISC_REGS_BTMCU_CTRL_RXTX_SEQ_CLK_EN_Pos 0                                              /**< (LPMCU_MISC_REGS_BTMCU_CTRL) BLE RXTX Sequencer Clock Enable Position */
#define LPMCU_MISC_REGS_BTMCU_CTRL_RXTX_SEQ_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_BTMCU_CTRL_RXTX_SEQ_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_BTMCU_CTRL) BLE RXTX Sequencer Clock Enable Mask */
#define LPMCU_MISC_REGS_BTMCU_CTRL_RXTX_SEQ_CLK_EN LPMCU_MISC_REGS_BTMCU_CTRL_RXTX_SEQ_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_BTMCU_CTRL_RXTX_SEQ_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_BTMCU_CTRL_AHB_CLK_EN_Pos 1                                              /**< (LPMCU_MISC_REGS_BTMCU_CTRL) BLE HAB Clock Enable Position */
#define LPMCU_MISC_REGS_BTMCU_CTRL_AHB_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_BTMCU_CTRL_AHB_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_BTMCU_CTRL) BLE HAB Clock Enable Mask */
#define LPMCU_MISC_REGS_BTMCU_CTRL_AHB_CLK_EN LPMCU_MISC_REGS_BTMCU_CTRL_AHB_CLK_EN_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_BTMCU_CTRL_AHB_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_BTMCU_CTRL_PERIPH_REGS_CLK_EN_Pos 2                                              /**< (LPMCU_MISC_REGS_BTMCU_CTRL) BLE Periph Regs Clock Enable Position */
#define LPMCU_MISC_REGS_BTMCU_CTRL_PERIPH_REGS_CLK_EN_Msk (0x1u << LPMCU_MISC_REGS_BTMCU_CTRL_PERIPH_REGS_CLK_EN_Pos)  /**< (LPMCU_MISC_REGS_BTMCU_CTRL) BLE Periph Regs Clock Enable Mask */
#define LPMCU_MISC_REGS_BTMCU_CTRL_PERIPH_REGS_CLK_EN LPMCU_MISC_REGS_BTMCU_CTRL_PERIPH_REGS_CLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_BTMCU_CTRL_PERIPH_REGS_CLK_EN_Msk instead */
#define LPMCU_MISC_REGS_BTMCU_CTRL_MASK     0x07u                                          /**< \deprecated (LPMCU_MISC_REGS_BTMCU_CTRL) Register MASK  (Use LPMCU_MISC_REGS_BTMCU_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_BTMCU_CTRL_Msk      0x07u                                          /**< (LPMCU_MISC_REGS_BTMCU_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_LPMCU_CTRL : (LPMCU_MISC_REGS Offset: 0x18) (R/W 32) Miscellaneous LPMCU control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LPMCU_CLK_SEL:2;           /**< bit:   0..1  LPMCU Clock Frequency Selection          */
    uint32_t USE_BT26M_CLK:1;           /**< bit:      2  Use XO as ARM clock (must also set use_arm_lp_clk) */
    uint32_t USE_ARM_LP_CLK:1;          /**< bit:      3  Use either LP 2MHz clock or XO as ARM clock */
    uint32_t DUALTIMER0_CLK_SEL:2;      /**< bit:   4..5  DUALTIMER0 Clock Frequency Select        */
    uint32_t :2;                        /**< bit:   6..7  Reserved */
    uint32_t BYPASS_WIC:1;              /**< bit:      8  Bypass Wakeup Interrupt Controller       */
    uint32_t USE_XO_FOR_LP_CAL_CLK:1;   /**< bit:      9  Use the XO for Low Power Clock Calibration */
    uint32_t :2;                        /**< bit: 10..11  Reserved */
    uint32_t SPI_FLASH0_CLKSEL:2;       /**< bit: 12..13  SPI_FLASH0 Clock Frequency Select        */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t SPI_FLASH0_DIV_CLK_SEL:1;  /**< bit:     16  Use Generated Divided Clock for SPI_FLASH0 */
    uint32_t :2;                        /**< bit: 17..18  Reserved */
    uint32_t IDRAM_1_MEM_IQ_BYP_EN:1;   /**< bit:     19  Mux Control to select between FECE and standard IDRAM memory. Default to IDRAM ARM Memory */
    uint32_t SPI_FLASH0_CLOCK_DIV_VALUE:8;  /**< bit: 20..27  Integer divider value. 26mhz clock will be divided by this register value  */
    uint32_t INVERT_UART0_IF_CLK:1;     /**< bit:     28  Inverts UART0 interface clock            */
    uint32_t INVERT_UART1_IF_CLK:1;     /**< bit:     29  Inverts UART1 interface clock            */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_LPMCU_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_LPMCU_CTRL_OFFSET   0x18                                          /**<  (LPMCU_MISC_REGS_LPMCU_CTRL) Miscellaneous LPMCU control  Offset */
#define LPMCU_MISC_REGS_LPMCU_CTRL_RESETVALUE 0x303100u                                     /**<  (LPMCU_MISC_REGS_LPMCU_CTRL) Miscellaneous LPMCU control  Reset Value */

#define LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_Pos 0                                              /**< (LPMCU_MISC_REGS_LPMCU_CTRL) LPMCU Clock Frequency Selection Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_Msk (0x3u << LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) LPMCU Clock Frequency Selection Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL(value) (LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_Msk & ((value) << LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_Pos))
#define   LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 26MHz  */
#define   LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 13MHz  */
#define   LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 6.5MHz  */
#define   LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 3.25MHz  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_0 (LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_0_Val << LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 26MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_1 (LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_1_Val << LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 13MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_2 (LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_2_Val << LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 6.5MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_3 (LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_3_Val << LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 3.25MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_USE_BT26M_CLK_Pos 2                                              /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Use XO as ARM clock (must also set use_arm_lp_clk) Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_USE_BT26M_CLK_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CTRL_USE_BT26M_CLK_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Use XO as ARM clock (must also set use_arm_lp_clk) Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_USE_BT26M_CLK LPMCU_MISC_REGS_LPMCU_CTRL_USE_BT26M_CLK_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CTRL_USE_BT26M_CLK_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CTRL_USE_ARM_LP_CLK_Pos 3                                              /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Use either LP 2MHz clock or XO as ARM clock Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_USE_ARM_LP_CLK_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CTRL_USE_ARM_LP_CLK_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Use either LP 2MHz clock or XO as ARM clock Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_USE_ARM_LP_CLK LPMCU_MISC_REGS_LPMCU_CTRL_USE_ARM_LP_CLK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CTRL_USE_ARM_LP_CLK_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_Pos 4                                              /**< (LPMCU_MISC_REGS_LPMCU_CTRL) DUALTIMER0 Clock Frequency Select Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_Msk (0x3u << LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) DUALTIMER0 Clock Frequency Select Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL(value) (LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_Msk & ((value) << LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_Pos))
#define   LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 26MHz  */
#define   LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 13MHz  */
#define   LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 6.5MHz  */
#define   LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 3.25MHz  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_0 (LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_0_Val << LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 26MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_1 (LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_1_Val << LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 13MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_2 (LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_2_Val << LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 6.5MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_3 (LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_3_Val << LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 3.25MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_BYPASS_WIC_Pos 8                                              /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Bypass Wakeup Interrupt Controller Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_BYPASS_WIC_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CTRL_BYPASS_WIC_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Bypass Wakeup Interrupt Controller Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_BYPASS_WIC LPMCU_MISC_REGS_LPMCU_CTRL_BYPASS_WIC_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CTRL_BYPASS_WIC_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CTRL_USE_XO_FOR_LP_CAL_CLK_Pos 9                                              /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Use the XO for Low Power Clock Calibration Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_USE_XO_FOR_LP_CAL_CLK_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CTRL_USE_XO_FOR_LP_CAL_CLK_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Use the XO for Low Power Clock Calibration Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_USE_XO_FOR_LP_CAL_CLK LPMCU_MISC_REGS_LPMCU_CTRL_USE_XO_FOR_LP_CAL_CLK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CTRL_USE_XO_FOR_LP_CAL_CLK_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_Pos 12                                             /**< (LPMCU_MISC_REGS_LPMCU_CTRL) SPI_FLASH0 Clock Frequency Select Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_Msk (0x3u << LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) SPI_FLASH0 Clock Frequency Select Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL(value) (LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_Msk & ((value) << LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_Pos))
#define   LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 3.25MHz  */
#define   LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 6.5MHz  */
#define   LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 13MHz  */
#define   LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 26MHz  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_0 (LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_0_Val << LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 3.25MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_1 (LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_1_Val << LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 6.5MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_2 (LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_2_Val << LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 13MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_3 (LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_3_Val << LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) 26MHz Position  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_DIV_CLK_SEL_Pos 16                                             /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Use Generated Divided Clock for SPI_FLASH0 Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_DIV_CLK_SEL_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_DIV_CLK_SEL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Use Generated Divided Clock for SPI_FLASH0 Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_DIV_CLK_SEL LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_DIV_CLK_SEL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_DIV_CLK_SEL_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CTRL_IDRAM_1_MEM_IQ_BYP_EN_Pos 19                                             /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Mux Control to select between FECE and standard IDRAM memory. Default to IDRAM ARM Memory Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_IDRAM_1_MEM_IQ_BYP_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CTRL_IDRAM_1_MEM_IQ_BYP_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Mux Control to select between FECE and standard IDRAM memory. Default to IDRAM ARM Memory Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_IDRAM_1_MEM_IQ_BYP_EN LPMCU_MISC_REGS_LPMCU_CTRL_IDRAM_1_MEM_IQ_BYP_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CTRL_IDRAM_1_MEM_IQ_BYP_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLOCK_DIV_VALUE_Pos 20                                             /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Integer divider value. 26mhz clock will be divided by this register value  Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLOCK_DIV_VALUE_Msk (0xFFu << LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLOCK_DIV_VALUE_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Integer divider value. 26mhz clock will be divided by this register value  Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLOCK_DIV_VALUE(value) (LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLOCK_DIV_VALUE_Msk & ((value) << LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLOCK_DIV_VALUE_Pos))
#define LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART0_IF_CLK_Pos 28                                             /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Inverts UART0 interface clock   Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART0_IF_CLK_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART0_IF_CLK_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Inverts UART0 interface clock   Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART0_IF_CLK LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART0_IF_CLK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART0_IF_CLK_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART1_IF_CLK_Pos 29                                             /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Inverts UART1 interface clock   Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART1_IF_CLK_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART1_IF_CLK_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Inverts UART1 interface clock   Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART1_IF_CLK LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART1_IF_CLK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_CTRL_INVERT_UART1_IF_CLK_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_CTRL_MASK     0x3FF9333Fu                                    /**< \deprecated (LPMCU_MISC_REGS_LPMCU_CTRL) Register MASK  (Use LPMCU_MISC_REGS_LPMCU_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_Msk      0x3FF9333Fu                                    /**< (LPMCU_MISC_REGS_LPMCU_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_LPMCU_MBIST : (LPMCU_MISC_REGS Offset: 0x1c) (R/W 8) MBIST designation -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  MBIST_MODE:1;              /**< bit:      0  Puts the chip in MBIST mode              */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_LPMCU_MBIST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_LPMCU_MBIST_OFFSET  0x1C                                          /**<  (LPMCU_MISC_REGS_LPMCU_MBIST) MBIST designation  Offset */
#define LPMCU_MISC_REGS_LPMCU_MBIST_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_LPMCU_MBIST) MBIST designation  Reset Value */

#define LPMCU_MISC_REGS_LPMCU_MBIST_MBIST_MODE_Pos 0                                              /**< (LPMCU_MISC_REGS_LPMCU_MBIST) Puts the chip in MBIST mode Position */
#define LPMCU_MISC_REGS_LPMCU_MBIST_MBIST_MODE_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_MBIST_MBIST_MODE_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_MBIST) Puts the chip in MBIST mode Mask */
#define LPMCU_MISC_REGS_LPMCU_MBIST_MBIST_MODE LPMCU_MISC_REGS_LPMCU_MBIST_MBIST_MODE_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_MBIST_MBIST_MODE_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_MBIST_MASK    0x01u                                          /**< \deprecated (LPMCU_MISC_REGS_LPMCU_MBIST) Register MASK  (Use LPMCU_MISC_REGS_LPMCU_MBIST_Msk instead)  */
#define LPMCU_MISC_REGS_LPMCU_MBIST_Msk     0x01u                                          /**< (LPMCU_MISC_REGS_LPMCU_MBIST) Register Mask  */

/* -------- LPMCU_MISC_REGS_BLE_CTRL : (LPMCU_MISC_REGS Offset: 0x20) (R/W 8) BLE Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  BLE_WAKEUP_REQ:1;          /**< bit:      0  BLE Wakeup Request (to BLE Sleep Timer)  */
    uint8_t  BLE_WAKEUP_REQ_CORE:1;     /**< bit:      1  BLE Wakeup Request (to BLE Core)         */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_BLE_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_BLE_CTRL_OFFSET     0x20                                          /**<  (LPMCU_MISC_REGS_BLE_CTRL) BLE Control  Offset */
#define LPMCU_MISC_REGS_BLE_CTRL_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_BLE_CTRL) BLE Control  Reset Value */

#define LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ_Pos 0                                              /**< (LPMCU_MISC_REGS_BLE_CTRL) BLE Wakeup Request (to BLE Sleep Timer) Position */
#define LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ_Msk (0x1u << LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ_Pos)  /**< (LPMCU_MISC_REGS_BLE_CTRL) BLE Wakeup Request (to BLE Sleep Timer) Mask */
#define LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ_Msk instead */
#define LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ_CORE_Pos 1                                              /**< (LPMCU_MISC_REGS_BLE_CTRL) BLE Wakeup Request (to BLE Core) Position */
#define LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ_CORE_Msk (0x1u << LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ_CORE_Pos)  /**< (LPMCU_MISC_REGS_BLE_CTRL) BLE Wakeup Request (to BLE Core) Mask */
#define LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ_CORE LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ_CORE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_BLE_CTRL_BLE_WAKEUP_REQ_CORE_Msk instead */
#define LPMCU_MISC_REGS_BLE_CTRL_MASK       0x03u                                          /**< \deprecated (LPMCU_MISC_REGS_BLE_CTRL) Register MASK  (Use LPMCU_MISC_REGS_BLE_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_BLE_CTRL_Msk        0x03u                                          /**< (LPMCU_MISC_REGS_BLE_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_MBIST_CTRL : (LPMCU_MISC_REGS Offset: 0x24) (R/W 32) MBIST Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MBIST_CONTROL:19;          /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_MBIST_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_MBIST_CTRL_OFFSET   0x24                                          /**<  (LPMCU_MISC_REGS_MBIST_CTRL) MBIST Control Register  Offset */
#define LPMCU_MISC_REGS_MBIST_CTRL_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_MBIST_CTRL) MBIST Control Register  Reset Value */

