remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_MBIST_CTRL_MBIST_CONTROL_Pos 0                                              /**< (LPMCU_MISC_REGS_MBIST_CTRL)  Position */
#define LPMCU_MISC_REGS_MBIST_CTRL_MBIST_CONTROL_Msk (0x7FFFFu << LPMCU_MISC_REGS_MBIST_CTRL_MBIST_CONTROL_Pos)  /**< (LPMCU_MISC_REGS_MBIST_CTRL)  Mask */
#define LPMCU_MISC_REGS_MBIST_CTRL_MBIST_CONTROL(value) (LPMCU_MISC_REGS_MBIST_CTRL_MBIST_CONTROL_Msk & ((value) << LPMCU_MISC_REGS_MBIST_CTRL_MBIST_CONTROL_Pos))
#define LPMCU_MISC_REGS_MBIST_CTRL_MASK     0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_MBIST_CTRL) Register MASK  (Use LPMCU_MISC_REGS_MBIST_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_MBIST_CTRL_Msk      0x7FFFFu                                       /**< (LPMCU_MISC_REGS_MBIST_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_MBIST_STATUS : (LPMCU_MISC_REGS Offset: 0x28) (R/ 32) MBIST Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MBIST_BUS:21;              /**< bit:  0..20  Observation of MBIST results             */
    uint32_t MBIST_BLOCK_SEL:5;         /**< bit: 21..25  Observation of block field of MBIST control */
    uint32_t MBIST_WRAPPER_SEL:5;       /**< bit: 26..30  Observation of wrapper field of MBIST control */
    uint32_t MBIST_MODE:1;              /**< bit:     31  Observation of mbist_mode signal         */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_MBIST_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_MBIST_STATUS_OFFSET 0x28                                          /**<  (LPMCU_MISC_REGS_MBIST_STATUS) MBIST Status Register  Offset */
#define LPMCU_MISC_REGS_MBIST_STATUS_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_MBIST_STATUS) MBIST Status Register  Reset Value */

#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BUS_Pos 0                                              /**< (LPMCU_MISC_REGS_MBIST_STATUS) Observation of MBIST results Position */
#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BUS_Msk (0x1FFFFFu << LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BUS_Pos)  /**< (LPMCU_MISC_REGS_MBIST_STATUS) Observation of MBIST results Mask */
#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BUS(value) (LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BUS_Msk & ((value) << LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BUS_Pos))
#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BLOCK_SEL_Pos 21                                             /**< (LPMCU_MISC_REGS_MBIST_STATUS) Observation of block field of MBIST control Position */
#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BLOCK_SEL_Msk (0x1Fu << LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_MBIST_STATUS) Observation of block field of MBIST control Mask */
#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BLOCK_SEL(value) (LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BLOCK_SEL_Msk & ((value) << LPMCU_MISC_REGS_MBIST_STATUS_MBIST_BLOCK_SEL_Pos))
#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_WRAPPER_SEL_Pos 26                                             /**< (LPMCU_MISC_REGS_MBIST_STATUS) Observation of wrapper field of MBIST control Position */
#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_WRAPPER_SEL_Msk (0x1Fu << LPMCU_MISC_REGS_MBIST_STATUS_MBIST_WRAPPER_SEL_Pos)  /**< (LPMCU_MISC_REGS_MBIST_STATUS) Observation of wrapper field of MBIST control Mask */
#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_WRAPPER_SEL(value) (LPMCU_MISC_REGS_MBIST_STATUS_MBIST_WRAPPER_SEL_Msk & ((value) << LPMCU_MISC_REGS_MBIST_STATUS_MBIST_WRAPPER_SEL_Pos))
#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_MODE_Pos 31                                             /**< (LPMCU_MISC_REGS_MBIST_STATUS) Observation of mbist_mode signal Position */
#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_MODE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_STATUS_MBIST_MODE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_STATUS) Observation of mbist_mode signal Mask */
#define LPMCU_MISC_REGS_MBIST_STATUS_MBIST_MODE LPMCU_MISC_REGS_MBIST_STATUS_MBIST_MODE_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_STATUS_MBIST_MODE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_STATUS_MASK   0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_MBIST_STATUS) Register MASK  (Use LPMCU_MISC_REGS_MBIST_STATUS_Msk instead)  */
#define LPMCU_MISC_REGS_MBIST_STATUS_Msk    0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_MBIST_STATUS) Register Mask  */

/* -------- LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL : (LPMCU_MISC_REGS Offset: 0x2c) (R/W 16) Enables MBIST algorithms -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t MARCH2_ENABLE:1;           /**< bit:      0  Enables the march2 algorithm             */
    uint16_t UNIQUE_ENABLE:1;           /**< bit:      1  Enables the unique address algorithm     */
    uint16_t CHECKERBOARD_ENABLE:1;     /**< bit:      2  Enables the checkerboard algorithm       */
    uint16_t DIAGONAL_ENABLE:1;         /**< bit:      3  Enables the diagonal algorithm           */
    uint16_t ADDRDEC0_ENABLE:1;         /**< bit:      4  Enables the address decoder bg0 algorithm */
    uint16_t ADDRDEC1_ENABLE:1;         /**< bit:      5  Enables the address decoder bg1 algorithm */
    uint16_t COLMARCH1_ENABLE:1;        /**< bit:      6  Enables the col_march1 algorithm         */
    uint16_t FILLWITH0_ENABLE:1;        /**< bit:      7  Enables the fillwith0 algorithm          */
    uint16_t RET_READ_ZEROS_ENABLE:1;   /**< bit:      8  Enables the ret read zeros algorithm     */
    uint16_t RET_WRITE_ZEROS_ENABLE:1;  /**< bit:      9  Enables the ret write zeros algorithm    */
    uint16_t RET_READ_ONES_ENABLE:1;    /**< bit:     10  Enables the ret read ones algorithm      */
    uint16_t RET_WRITE_ONES_ENABLE:1;   /**< bit:     11  Enables the ret write ones algorithm     */
    uint16_t RET_READ_CB_ENABLE:1;      /**< bit:     12  Enables the ret read checkerboard algorithm */
    uint16_t RET_WRITE_CB_ENABLE:1;     /**< bit:     13  Enables the ret write checkerboard algorithm */
    uint16_t RET_READ_INVCB_ENABLE:1;   /**< bit:     14  Enables the ret read inv checkerboard algorithm */
    uint16_t RET_WRITE_INVCB_ENABLE:1;  /**< bit:     15  Enables the ret write inv checkerboard algorithm */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_OFFSET 0x2C                                          /**<  (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables MBIST algorithms  Offset */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RESETVALUE 0x4Fu                                         /**<  (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables MBIST algorithms  Reset Value */

