remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_MARCH2_ENABLE_Pos 0                                              /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the march2 algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_MARCH2_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_MARCH2_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the march2 algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_MARCH2_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_MARCH2_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_MARCH2_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_UNIQUE_ENABLE_Pos 1                                              /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the unique address algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_UNIQUE_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_UNIQUE_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the unique address algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_UNIQUE_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_UNIQUE_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_UNIQUE_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_CHECKERBOARD_ENABLE_Pos 2                                              /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the checkerboard algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_CHECKERBOARD_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_CHECKERBOARD_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the checkerboard algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_CHECKERBOARD_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_CHECKERBOARD_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_CHECKERBOARD_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_DIAGONAL_ENABLE_Pos 3                                              /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the diagonal algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_DIAGONAL_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_DIAGONAL_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the diagonal algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_DIAGONAL_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_DIAGONAL_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_DIAGONAL_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC0_ENABLE_Pos 4                                              /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the address decoder bg0 algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC0_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC0_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the address decoder bg0 algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC0_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC0_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC0_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC1_ENABLE_Pos 5                                              /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the address decoder bg1 algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC1_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC1_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the address decoder bg1 algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC1_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC1_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_ADDRDEC1_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_COLMARCH1_ENABLE_Pos 6                                              /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the col_march1 algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_COLMARCH1_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_COLMARCH1_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the col_march1 algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_COLMARCH1_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_COLMARCH1_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_COLMARCH1_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_FILLWITH0_ENABLE_Pos 7                                              /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the fillwith0 algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_FILLWITH0_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_FILLWITH0_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the fillwith0 algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_FILLWITH0_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_FILLWITH0_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_FILLWITH0_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ZEROS_ENABLE_Pos 8                                              /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret read zeros algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ZEROS_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ZEROS_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret read zeros algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ZEROS_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ZEROS_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ZEROS_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ZEROS_ENABLE_Pos 9                                              /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret write zeros algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ZEROS_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ZEROS_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret write zeros algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ZEROS_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ZEROS_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ZEROS_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ONES_ENABLE_Pos 10                                             /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret read ones algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ONES_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ONES_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret read ones algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ONES_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ONES_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_ONES_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ONES_ENABLE_Pos 11                                             /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret write ones algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ONES_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ONES_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret write ones algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ONES_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ONES_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_ONES_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_CB_ENABLE_Pos 12                                             /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret read checkerboard algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_CB_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_CB_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret read checkerboard algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_CB_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_CB_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_CB_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_CB_ENABLE_Pos 13                                             /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret write checkerboard algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_CB_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_CB_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret write checkerboard algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_CB_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_CB_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_CB_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_INVCB_ENABLE_Pos 14                                             /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret read inv checkerboard algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_INVCB_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_INVCB_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret read inv checkerboard algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_INVCB_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_INVCB_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_READ_INVCB_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_INVCB_ENABLE_Pos 15                                             /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret write inv checkerboard algorithm Position */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_INVCB_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_INVCB_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Enables the ret write inv checkerboard algorithm Mask */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_INVCB_ENABLE LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_INVCB_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_RET_WRITE_INVCB_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_MASK 0xFFFFu                                        /**< \deprecated (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Register MASK  (Use LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_Msk instead)  */
#define LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_Msk 0xFFFFu                                        /**< (LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL) Register Mask  */

/* -------- LPMCU_MISC_REGS_MBIST_BG : (LPMCU_MISC_REGS Offset: 0x30) (R/W 32) MBIST Background for MARCH2 algorithm (bits 31:0) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MBIST_BG:32;               /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_MBIST_BG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_MBIST_BG_OFFSET     0x30                                          /**<  (LPMCU_MISC_REGS_MBIST_BG) MBIST Background for MARCH2 algorithm (bits 31:0)  Offset */
#define LPMCU_MISC_REGS_MBIST_BG_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_MBIST_BG) MBIST Background for MARCH2 algorithm (bits 31:0)  Reset Value */

#define LPMCU_MISC_REGS_MBIST_BG_MBIST_BG_Pos 0                                              /**< (LPMCU_MISC_REGS_MBIST_BG)  Position */
#define LPMCU_MISC_REGS_MBIST_BG_MBIST_BG_Msk (0xFFFFFFFFu << LPMCU_MISC_REGS_MBIST_BG_MBIST_BG_Pos)  /**< (LPMCU_MISC_REGS_MBIST_BG)  Mask */
#define LPMCU_MISC_REGS_MBIST_BG_MBIST_BG(value) (LPMCU_MISC_REGS_MBIST_BG_MBIST_BG_Msk & ((value) << LPMCU_MISC_REGS_MBIST_BG_MBIST_BG_Pos))
#define LPMCU_MISC_REGS_MBIST_BG_MASK       0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_MBIST_BG) Register MASK  (Use LPMCU_MISC_REGS_MBIST_BG_Msk instead)  */
#define LPMCU_MISC_REGS_MBIST_BG_Msk        0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_MBIST_BG) Register Mask  */

/* -------- LPMCU_MISC_REGS_TEST_BUS_CTRL : (LPMCU_MISC_REGS Offset: 0x38) (R/W 8) Controls all of the test bus functionality -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TEST_ENABLE_ARM:1;         /**< bit:      0  Selects periph test bus                  */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_TEST_BUS_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_TEST_BUS_CTRL_OFFSET 0x38                                          /**<  (LPMCU_MISC_REGS_TEST_BUS_CTRL) Controls all of the test bus functionality  Offset */
#define LPMCU_MISC_REGS_TEST_BUS_CTRL_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_TEST_BUS_CTRL) Controls all of the test bus functionality  Reset Value */

#define LPMCU_MISC_REGS_TEST_BUS_CTRL_TEST_ENABLE_ARM_Pos 0                                              /**< (LPMCU_MISC_REGS_TEST_BUS_CTRL) Selects periph test bus Position */
#define LPMCU_MISC_REGS_TEST_BUS_CTRL_TEST_ENABLE_ARM_Msk (0x1u << LPMCU_MISC_REGS_TEST_BUS_CTRL_TEST_ENABLE_ARM_Pos)  /**< (LPMCU_MISC_REGS_TEST_BUS_CTRL) Selects periph test bus Mask */
#define LPMCU_MISC_REGS_TEST_BUS_CTRL_TEST_ENABLE_ARM LPMCU_MISC_REGS_TEST_BUS_CTRL_TEST_ENABLE_ARM_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_TEST_BUS_CTRL_TEST_ENABLE_ARM_Msk instead */
#define LPMCU_MISC_REGS_TEST_BUS_CTRL_MASK  0x01u                                          /**< \deprecated (LPMCU_MISC_REGS_TEST_BUS_CTRL) Register MASK  (Use LPMCU_MISC_REGS_TEST_BUS_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_TEST_BUS_CTRL_Msk   0x01u                                          /**< (LPMCU_MISC_REGS_TEST_BUS_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_WP3_MISR_DATAOUT : (LPMCU_MISC_REGS Offset: 0x3c) (R/ 32) ROM MBIST Signature -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WP3_MISR_DATAOUT:32;       /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_WP3_MISR_DATAOUT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

