remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_LP_GPIO_(value) (LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_LP_GPIO__Msk & ((value) << LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_LP_GPIO__Pos))  
#define LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_LP_SIP__Pos 27                                             /**< (LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL Position) Invert the output for lp_sip_4 */
#define LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_LP_SIP__Msk (0x1Fu << LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_LP_SIP__Pos)  /**< (LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL Mask) LP_SIP_ */
#define LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_LP_SIP_(value) (LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_LP_SIP__Msk & ((value) << LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_LP_SIP__Pos))  
#define LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_MASK 0xF8FFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL) Register MASK  (Use LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_Msk 0xF8FFFFFFu                                    /**< (LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_PINMUX_SEL_0 : (LPMCU_MISC_REGS Offset: 0x44) (R/W 32) Pinmux select for LP_GPIO_0, LP_GPIO_1, LP_GPIO_2, LP_GPIO_3, LP_GPIO_4, LP_GPIO_5, LP_GPIO_6, LP_GPIO_7 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LP_GPIO_0_SEL:3;           /**< bit:   0..2  Pinmux select for LP_GPIO_0              */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t LP_GPIO_1_SEL:3;           /**< bit:   4..6  Pinmux select for LP_GPIO_1              */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t LP_GPIO_2_SEL:3;           /**< bit:  8..10  Pinmux select for LP_GPIO_2              */
    uint32_t :1;                        /**< bit:     11  Reserved */
    uint32_t LP_GPIO_3_SEL:3;           /**< bit: 12..14  Pinmux select for LP_GPIO_3              */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t LP_GPIO_4_SEL:3;           /**< bit: 16..18  Pinmux select for LP_GPIO_4              */
    uint32_t :1;                        /**< bit:     19  Reserved */
    uint32_t LP_GPIO_5_SEL:3;           /**< bit: 20..22  Pinmux select for LP_GPIO_5              */
    uint32_t :1;                        /**< bit:     23  Reserved */
    uint32_t LP_GPIO_6_SEL:3;           /**< bit: 24..26  Pinmux select for LP_GPIO_6              */
    uint32_t :1;                        /**< bit:     27  Reserved */
    uint32_t LP_GPIO_7_SEL:3;           /**< bit: 28..30  Pinmux select for LP_GPIO_7              */
    uint32_t :1;                        /**< bit:     31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_PINMUX_SEL_0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_PINMUX_SEL_0_OFFSET 0x44                                          /**<  (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_0, LP_GPIO_1, LP_GPIO_2, LP_GPIO_3, LP_GPIO_4, LP_GPIO_5, LP_GPIO_6, LP_GPIO_7  Offset */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_RESETVALUE 0x22u                                         /**<  (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_0, LP_GPIO_1, LP_GPIO_2, LP_GPIO_3, LP_GPIO_4, LP_GPIO_5, LP_GPIO_6, LP_GPIO_7  Reset Value */

#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_Pos 0                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_0 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_0 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_SWD_CLK_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_TEST_OUT_0_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_SWD_CLK (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_SWD_CLK_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_TEST_OUT_0 (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_TEST_OUT_0_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_Pos 4                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_1 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_1 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_SWD_IO_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_TEST_OUT_1_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_SWD_IO (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_SWD_IO_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_TEST_OUT_1 (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_TEST_OUT_1_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Pos 8                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_2 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_2 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_UART0_RXD_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_SPI1_SCK_Val 0x4u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 4  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_SPI0_SCK_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_SPI_FLASH0_SCK_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_TEST_OUT_2_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_UART0_RXD (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_UART0_RXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_SPI1_SCK (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_SPI1_SCK_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 4 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_SPI0_SCK (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_SPI0_SCK_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_SPI_FLASH0_SCK (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_SPI_FLASH0_SCK_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_TEST_OUT_2 (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_TEST_OUT_2_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Pos 12                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_3 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_3 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_UART0_TXD_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_SPI1_MOSI_Val 0x4u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 4  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_SPI0_MOSI_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_SPI_FLASH0_TXD_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_TEST_OUT_3_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_UART0_TXD (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_UART0_TXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_SPI1_MOSI (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_SPI1_MOSI_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 4 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_SPI0_MOSI (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_SPI0_MOSI_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_SPI_FLASH0_TXD (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_SPI_FLASH0_TXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_TEST_OUT_3 (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_TEST_OUT_3_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Pos 16                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_4 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_4 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_UART0_CTS_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_SPI1_SSN_Val 0x4u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 4  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_SPI0_SSN_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_SPI_FLASH0_SSN_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_TEST_OUT_4_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_UART0_CTS (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_UART0_CTS_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_SPI1_SSN (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_SPI1_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 4 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_SPI0_SSN (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_SPI0_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_SPI_FLASH0_SSN (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_SPI_FLASH0_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_TEST_OUT_4 (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_TEST_OUT_4_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Pos 20                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_5 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_5 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_UART0_RTS_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_SPI1_MISO_Val 0x4u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 4  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_SPI0_MISO_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_SPI_FLASH0_RXD_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_TEST_OUT_5_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_UART0_RTS (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_UART0_RTS_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_SPI1_MISO (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_SPI1_MISO_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 4 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_SPI0_MISO (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_SPI0_MISO_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_SPI_FLASH0_RXD (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_SPI_FLASH0_RXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_TEST_OUT_5 (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_TEST_OUT_5_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_Pos 24                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_6 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_6 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_UART1_RXD_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_SPI0_SCK_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_SPI_FLASH0_SCK_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_TEST_OUT_6_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_UART1_RXD (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_UART1_RXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_SPI0_SCK (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_SPI0_SCK_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_SPI_FLASH0_SCK (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_SPI_FLASH0_SCK_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6 Position  */
