remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_TEST_OUT_6 (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_TEST_OUT_6_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_Pos 28                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_7 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Pinmux select for LP_GPIO_7 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_UART1_TXD_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_SPI0_MOSI_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_SPI_FLASH0_TXD_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_TEST_OUT_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_UART1_TXD (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_UART1_TXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_SPI0_MOSI (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_SPI0_MOSI_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_SPI_FLASH0_TXD (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_SPI_FLASH0_TXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_TEST_OUT_7 (LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_TEST_OUT_7_Val << LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_MASK   0x77777777u                                    /**< \deprecated (LPMCU_MISC_REGS_PINMUX_SEL_0) Register MASK  (Use LPMCU_MISC_REGS_PINMUX_SEL_0_Msk instead)  */
#define LPMCU_MISC_REGS_PINMUX_SEL_0_Msk    0x77777777u                                    /**< (LPMCU_MISC_REGS_PINMUX_SEL_0) Register Mask  */

/* -------- LPMCU_MISC_REGS_PINMUX_SEL_1 : (LPMCU_MISC_REGS Offset: 0x48) (R/W 32) Pinmux select for LP_GPIO_8, LP_GPIO_9, LP_GPIO_10, LP_GPIO_11, LP_GPIO_12, LP_GPIO_13, LP_GPIO_14, LP_GPIO_15 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LP_GPIO_8_SEL:3;           /**< bit:   0..2  Pinmux select for LP_GPIO_8              */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t LP_GPIO_9_SEL:3;           /**< bit:   4..6  Pinmux select for LP_GPIO_9              */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t LP_GPIO_10_SEL:3;          /**< bit:  8..10  Pinmux select for LP_GPIO_10             */
    uint32_t :1;                        /**< bit:     11  Reserved */
    uint32_t LP_GPIO_11_SEL:3;          /**< bit: 12..14  Pinmux select for LP_GPIO_11             */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t LP_GPIO_12_SEL:3;          /**< bit: 16..18  Pinmux select for LP_GPIO_12             */
    uint32_t :1;                        /**< bit:     19  Reserved */
    uint32_t LP_GPIO_13_SEL:3;          /**< bit: 20..22  Pinmux select for LP_GPIO_13             */
    uint32_t :1;                        /**< bit:     23  Reserved */
    uint32_t LP_GPIO_14_SEL:3;          /**< bit: 24..26  Pinmux select for LP_GPIO_14             */
    uint32_t :1;                        /**< bit:     27  Reserved */
    uint32_t LP_GPIO_15_SEL:3;          /**< bit: 28..30  Pinmux select for LP_GPIO_15             */
    uint32_t :1;                        /**< bit:     31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_PINMUX_SEL_1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_PINMUX_SEL_1_OFFSET 0x48                                          /**<  (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_8, LP_GPIO_9, LP_GPIO_10, LP_GPIO_11, LP_GPIO_12, LP_GPIO_13, LP_GPIO_14, LP_GPIO_15  Offset */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_RESETVALUE 0x33u                                         /**<  (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_8, LP_GPIO_9, LP_GPIO_10, LP_GPIO_11, LP_GPIO_12, LP_GPIO_13, LP_GPIO_14, LP_GPIO_15  Reset Value */

#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_Pos 0                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_8 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_8 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_I2C0_SDA_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_SPI0_SSN_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_SPI_FLASH0_SSN_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_TEST_OUT_8_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_I2C0_SDA (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_I2C0_SDA_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_SPI0_SSN (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_SPI0_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_SPI_FLASH0_SSN (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_SPI_FLASH0_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_TEST_OUT_8 (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_TEST_OUT_8_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_Pos 4                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_9 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_9 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_I2C0_SCL_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_SPI0_MISO_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_SPI_FLASH0_RXD_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_TEST_OUT_9_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_I2C0_SCL (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_I2C0_SCL_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_SPI0_MISO (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_SPI0_MISO_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_SPI_FLASH0_RXD (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_SPI_FLASH0_RXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_TEST_OUT_9 (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_TEST_OUT_9_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_Pos 8                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_10 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_10 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_SPI0_SCK_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_SPI_FLASH0_SCK_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_TEST_OUT_10_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_SPI0_SCK (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_SPI0_SCK_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_SPI_FLASH0_SCK (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_SPI_FLASH0_SCK_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_TEST_OUT_10 (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_TEST_OUT_10_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_Pos 12                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_11 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_11 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_SPI0_MOSI_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_SPI_FLASH0_TXD_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_TEST_OUT_11_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_SPI0_MOSI (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_SPI0_MOSI_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_SPI_FLASH0_TXD (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_SPI_FLASH0_TXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_TEST_OUT_11 (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_TEST_OUT_11_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_Pos 16                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_12 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_12 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_SPI0_SSN_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_SPI_FLASH0_SSN_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_TEST_OUT_12_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_SPI0_SSN (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_SPI0_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_SPI_FLASH0_SSN (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_SPI_FLASH0_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_TEST_OUT_12 (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_TEST_OUT_12_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_Pos 20                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_13 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_13 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_SPI0_MISO_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_SPI_FLASH0_RXD_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_TEST_OUT_13_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_SPI0_MISO (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_SPI0_MISO_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_SPI_FLASH0_RXD (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_SPI_FLASH0_RXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_TEST_OUT_13 (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_TEST_OUT_13_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_Pos 24                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_14 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_14 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_UART1_CTS_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_I2C1_SDA_Val 0x4u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 4  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_TEST_OUT_14_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0 Position  */
