remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_UART1_CTS (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_UART1_CTS_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_I2C1_SDA (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_I2C1_SDA_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 4 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_TEST_OUT_14 (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_TEST_OUT_14_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_Pos 28                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_15 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Pinmux select for LP_GPIO_15 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_UART1_RTS_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_I2C1_SCL_Val 0x4u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 4  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_TEST_OUT_15_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_UART1_RTS (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_UART1_RTS_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_I2C1_SCL (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_I2C1_SCL_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 4 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_TEST_OUT_15 (LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_TEST_OUT_15_Val << LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_MASK   0x77777777u                                    /**< \deprecated (LPMCU_MISC_REGS_PINMUX_SEL_1) Register MASK  (Use LPMCU_MISC_REGS_PINMUX_SEL_1_Msk instead)  */
#define LPMCU_MISC_REGS_PINMUX_SEL_1_Msk    0x77777777u                                    /**< (LPMCU_MISC_REGS_PINMUX_SEL_1) Register Mask  */

/* -------- LPMCU_MISC_REGS_PINMUX_SEL_2 : (LPMCU_MISC_REGS Offset: 0x4c) (R/W 32) Pinmux select for LP_GPIO_16, LP_GPIO_17, LP_GPIO_18, LP_GPIO_19, LP_GPIO_20, LP_GPIO_21, LP_GPIO_22, LP_GPIO_23 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LP_GPIO_16_SEL:3;          /**< bit:   0..2  Pinmux select for LP_GPIO_16             */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t LP_GPIO_17_SEL:3;          /**< bit:   4..6  Pinmux select for LP_GPIO_17             */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t LP_GPIO_18_SEL:3;          /**< bit:  8..10  Pinmux select for LP_GPIO_18             */
    uint32_t :1;                        /**< bit:     11  Reserved */
    uint32_t LP_GPIO_19_SEL:3;          /**< bit: 12..14  Pinmux select for LP_GPIO_19             */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t LP_GPIO_20_SEL:3;          /**< bit: 16..18  Pinmux select for LP_GPIO_20             */
    uint32_t :1;                        /**< bit:     19  Reserved */
    uint32_t LP_GPIO_21_SEL:3;          /**< bit: 20..22  Pinmux select for LP_GPIO_21             */
    uint32_t :1;                        /**< bit:     23  Reserved */
    uint32_t LP_GPIO_22_SEL:3;          /**< bit: 24..26  Pinmux select for LP_GPIO_22             */
    uint32_t :1;                        /**< bit:     27  Reserved */
    uint32_t LP_GPIO_23_SEL:3;          /**< bit: 28..30  Pinmux select for LP_GPIO_23             */
    uint32_t :1;                        /**< bit:     31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_PINMUX_SEL_2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_PINMUX_SEL_2_OFFSET 0x4C                                          /**<  (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_16, LP_GPIO_17, LP_GPIO_18, LP_GPIO_19, LP_GPIO_20, LP_GPIO_21, LP_GPIO_22, LP_GPIO_23  Offset */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_16, LP_GPIO_17, LP_GPIO_18, LP_GPIO_19, LP_GPIO_20, LP_GPIO_21, LP_GPIO_22, LP_GPIO_23  Reset Value */

