remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Pos 0                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_16 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_16 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI_FLASH0_SCK_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI1_SSN_Val 0x4u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 4  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI0_SCK_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI_FLASH0_SSN_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_TEST_OUT_16_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI_FLASH0_SCK (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI_FLASH0_SCK_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI1_SSN (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI1_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 4 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI0_SCK (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI0_SCK_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI_FLASH0_SSN (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_SPI_FLASH0_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_TEST_OUT_16 (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_TEST_OUT_16_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_Pos 4                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_17 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_17 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_SPI_FLASH0_TXD_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_SPI1_SCK_Val 0x4u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 4  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_SPI0_MOSI_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_TEST_OUT_17_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_SPI_FLASH0_TXD (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_SPI_FLASH0_TXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_SPI1_SCK (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_SPI1_SCK_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 4 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_SPI0_MOSI (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_SPI0_MOSI_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_TEST_OUT_17 (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_TEST_OUT_17_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Pos 8                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_18 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_18 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI_FLASH0_SSN_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI1_MISO_Val 0x4u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 4  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI0_SSN_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI_FLASH0_RXD_Val 0x6u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 6  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_TEST_OUT_18_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI_FLASH0_SSN (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI_FLASH0_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI1_MISO (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI1_MISO_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 4 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI0_SSN (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI0_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI_FLASH0_RXD (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_SPI_FLASH0_RXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 6 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_TEST_OUT_18 (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_TEST_OUT_18_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_Pos 12                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_19 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_19 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_SPI_FLASH0_RXD_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 2  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_SPI1_MOSI_Val 0x4u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 4  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_SPI0_MISO_Val 0x5u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 5  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_TEST_OUT_19_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_SPI_FLASH0_RXD (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_SPI_FLASH0_RXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_SPI1_MOSI (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_SPI1_MOSI_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 4 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_SPI0_MISO (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_SPI0_MISO_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 5 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_TEST_OUT_19 (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_TEST_OUT_19_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_Pos 16                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_20 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_20 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_TEST_OUT_20_Val 0x7u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 7  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_TEST_OUT_20 (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_TEST_OUT_20_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 7 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_Pos 20                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_21 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_21 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_Pos 24                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_22 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_22 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_Pos 28                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_23 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Pinmux select for LP_GPIO_23 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_GPIO_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0  */
#define   LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_MEGAMUX_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_GPIO (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_GPIO_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_MEGAMUX (LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_MEGAMUX_Val << LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_MASK   0x77777777u                                    /**< \deprecated (LPMCU_MISC_REGS_PINMUX_SEL_2) Register MASK  (Use LPMCU_MISC_REGS_PINMUX_SEL_2_Msk instead)  */
#define LPMCU_MISC_REGS_PINMUX_SEL_2_Msk    0x77777777u                                    /**< (LPMCU_MISC_REGS_PINMUX_SEL_2) Register Mask  */

