remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_RTYPE_PAD_0 : (LPMCU_MISC_REGS Offset: 0x54) (R/W 32) Controls the RTYPE (Pull Level) pad value for LPMCU Pads (0 = Pull Up) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LP_GPIO_0:1;               /**< bit:      0  Controls RTYPE (Pull Level) value for LP_GPIO_0 */
    uint32_t LP_GPIO_1:1;               /**< bit:      1  Controls RTYPE (Pull Level) value LP_GPIO_1 */
    uint32_t LP_GPIO_2:1;               /**< bit:      2  Controls RTYPE (Pull Level) value LP_GPIO_2 */
    uint32_t LP_GPIO_3:1;               /**< bit:      3  Controls RTYPE (Pull Level) value LP_GPIO_3 */
    uint32_t LP_GPIO_4:1;               /**< bit:      4  Controls RTYPE (Pull Level) value LP_GPIO_4 */
    uint32_t LP_GPIO_5:1;               /**< bit:      5  Controls RTYPE (Pull Level) value LP_GPIO_5 */
    uint32_t LP_GPIO_6:1;               /**< bit:      6  Controls RTYPE (Pull Level) value LP_GPIO_6 */
    uint32_t LP_GPIO_7:1;               /**< bit:      7  Controls RTYPE (Pull Level) value LP_GPIO_7 */
    uint32_t LP_GPIO_8:1;               /**< bit:      8  Controls RTYPE (Pull Level) value for LP_GPIO_8 */
    uint32_t LP_GPIO_9:1;               /**< bit:      9  Controls RTYPE (Pull Level) value LP_GPIO_9 */
    uint32_t LP_GPIO_10:1;              /**< bit:     10  Controls RTYPE (Pull Level) value LP_GPIO_10 */
    uint32_t LP_GPIO_11:1;              /**< bit:     11  Controls RTYPE (Pull Level) value LP_GPIO_11 */
    uint32_t LP_GPIO_12:1;              /**< bit:     12  Controls RTYPE (Pull Level) value LP_GPIO_12 */
    uint32_t LP_GPIO_13:1;              /**< bit:     13  Controls RTYPE (Pull Level) value LP_GPIO_13 */
    uint32_t LP_GPIO_14:1;              /**< bit:     14  Controls RTYPE (Pull Level) value LP_GPIO_14 */
    uint32_t LP_GPIO_15:1;              /**< bit:     15  Controls RTYPE (Pull Level) value LP_GPIO_15 */
    uint32_t LP_GPIO_16:1;              /**< bit:     16  Controls RTYPE (Pull Level) value LP_GPIO_16 */
    uint32_t LP_GPIO_17:1;              /**< bit:     17  Controls RTYPE (Pull Level) value LP_GPIO_17 */
    uint32_t LP_GPIO_18:1;              /**< bit:     18  Controls RTYPE (Pull Level) value LP_GPIO_18 */
    uint32_t LP_GPIO_19:1;              /**< bit:     19  Controls RTYPE (Pull Level) value LP_GPIO_19 */
    uint32_t LP_GPIO_20:1;              /**< bit:     20  Controls RTYPE (Pull Level) value LP_GPIO_20 */
    uint32_t LP_GPIO_21:1;              /**< bit:     21  Controls RTYPE (Pull Level) value LP_GPIO_21 */
    uint32_t LP_GPIO_22:1;              /**< bit:     22  Controls RTYPE (Pull Level) value LP_GPIO_22 */
    uint32_t LP_GPIO_23:1;              /**< bit:     23  Controls RTYPE (Pull Level) value LP_GPIO_23 */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t LP_GPIO_:24;               /**< bit:  0..23  Controls RTYPE (Pull Level) value LP_GPIO_23 */
    uint32_t :8;                        /**< bit: 24..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_RTYPE_PAD_0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_RTYPE_PAD_0_OFFSET  0x54                                          /**<  (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls the RTYPE (Pull Level) pad value for LPMCU Pads (0 = Pull Up)  Offset */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls the RTYPE (Pull Level) pad value for LPMCU Pads (0 = Pull Up)  Reset Value */

#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_0_Pos 0                                              /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value for LP_GPIO_0 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_0_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value for LP_GPIO_0 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_0 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_0_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_0_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_1_Pos 1                                              /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_1 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_1_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_1_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_1 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_1 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_1_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_1_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_2_Pos 2                                              /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_2 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_2_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_2_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_2 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_2 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_2_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_2_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_3_Pos 3                                              /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_3 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_3_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_3_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_3 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_3 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_3_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_3_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_4_Pos 4                                              /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_4 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_4_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_4_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_4 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_4 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_4_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_4_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_5_Pos 5                                              /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_5 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_5_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_5_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_5 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_5 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_5_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_5_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_6_Pos 6                                              /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_6 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_6_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_6_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_6 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_6 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_6_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_6_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_7_Pos 7                                              /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_7 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_7_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_7 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_7 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_7_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_7_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_8_Pos 8                                              /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value for LP_GPIO_8 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_8_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_8_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value for LP_GPIO_8 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_8 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_8_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_8_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_9_Pos 9                                              /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_9 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_9_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_9_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_9 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_9 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_9_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_9_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_10_Pos 10                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_10 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_10_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_10_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_10 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_10 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_10_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_10_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_11_Pos 11                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_11 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_11_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_11_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_11 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_11 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_11_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_11_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_12_Pos 12                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_12 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_12_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_12_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_12 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_12 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_12_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_12_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_13_Pos 13                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_13 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_13_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_13_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_13 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_13 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_13_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_13_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_14_Pos 14                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_14 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_14_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_14_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_14 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_14 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_14_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_14_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_15_Pos 15                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_15 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_15_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_15_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_15 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_15 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_15_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_15_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_16_Pos 16                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_16 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_16_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_16_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_16 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_16 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_16_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_16_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_17_Pos 17                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_17 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_17_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_17_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_17 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_17 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_17_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_17_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_18_Pos 18                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_18 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_18_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_18_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_18 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_18 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_18_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_18_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_19_Pos 19                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_19 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_19_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_19_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_19 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_19 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_19_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_19_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_20_Pos 20                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_20 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_20_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_20_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_20 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_20 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_20_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_20_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_21_Pos 21                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_21 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_21_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_21_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_21 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_21 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_21_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_21_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_22_Pos 22                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_22 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_22_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_22_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_22 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_22 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_22_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_22_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_23_Pos 23                                             /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_23 Position */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_23_Msk (0x1u << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_23_Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Controls RTYPE (Pull Level) value LP_GPIO_23 Mask */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_23 LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_23_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_23_Msk instead */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO__Pos 0                                              /**< (LPMCU_MISC_REGS_RTYPE_PAD_0 Position) Controls RTYPE (Pull Level) value LP_GPIO_23 */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO__Msk (0xFFFFFFu << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO__Pos)  /**< (LPMCU_MISC_REGS_RTYPE_PAD_0 Mask) LP_GPIO_ */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO_(value) (LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO__Msk & ((value) << LPMCU_MISC_REGS_RTYPE_PAD_0_LP_GPIO__Pos))  
#define LPMCU_MISC_REGS_RTYPE_PAD_0_MASK    0xFFFFFFu                                      /**< \deprecated (LPMCU_MISC_REGS_RTYPE_PAD_0) Register MASK  (Use LPMCU_MISC_REGS_RTYPE_PAD_0_Msk instead)  */
#define LPMCU_MISC_REGS_RTYPE_PAD_0_Msk     0xFFFFFFu                                      /**< (LPMCU_MISC_REGS_RTYPE_PAD_0) Register Mask  */

