remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_PINMUX_SEL_3 : (LPMCU_MISC_REGS Offset: 0x68) (R/W 32) Pinmux select for LP_SIP_0, LP_SIP_1, LP_SIP_2, LP_SIP_3, LP_SIP_4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LP_SIP_0_SEL:3;            /**< bit:   0..2  Pinmux select for LP_SIP_0               */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t LP_SIP_1_SEL:3;            /**< bit:   4..6  Pinmux select for LP_SIP_1               */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t LP_SIP_2_SEL:3;            /**< bit:  8..10  Pinmux select for LP_SIP_2               */
    uint32_t :1;                        /**< bit:     11  Reserved */
    uint32_t LP_SIP_3_SEL:3;            /**< bit: 12..14  Pinmux select for LP_SIP_3               */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t LP_SIP_4_SEL:3;            /**< bit: 16..18  Pinmux select for LP_SIP_4               */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_PINMUX_SEL_3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_PINMUX_SEL_3_OFFSET 0x68                                          /**<  (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_0, LP_SIP_1, LP_SIP_2, LP_SIP_3, LP_SIP_4  Offset */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_0, LP_SIP_1, LP_SIP_2, LP_SIP_3, LP_SIP_4  Reset Value */

#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_0_SEL_Pos 0                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_0 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_0_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_0_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_0 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_0_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_0_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_0_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_0_SEL_SPI_FLASH0_SCK_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) MUX function 1  */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_0_SEL_SPI_FLASH0_SCK (LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_0_SEL_SPI_FLASH0_SCK_Val << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_0_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) MUX function 1 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_1_SEL_Pos 4                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_1 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_1_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_1_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_1 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_1_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_1_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_1_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_1_SEL_SPI_FLASH0_TXD_Val 0x3u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) MUX function 3  */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_1_SEL_SPI_FLASH0_TXD (LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_1_SEL_SPI_FLASH0_TXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_1_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) MUX function 3 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_2_SEL_Pos 8                                              /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_2 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_2_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_2_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_2 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_2_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_2_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_2_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_2_SEL_SPI_FLASH0_SSN_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) MUX function 2  */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_2_SEL_SPI_FLASH0_SSN (LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_2_SEL_SPI_FLASH0_SSN_Val << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_2_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) MUX function 2 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_3_SEL_Pos 12                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_3 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_3_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_3_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_3 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_3_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_3_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_3_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_3_SEL_SPI_FLASH0_RXD_Val 0x4u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) MUX function 4  */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_3_SEL_SPI_FLASH0_RXD (LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_3_SEL_SPI_FLASH0_RXD_Val << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_3_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) MUX function 4 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_4_SEL_Pos 16                                             /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_4 Position */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_4_SEL_Msk (0x7u << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_4_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) Pinmux select for LP_SIP_4 Mask */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_4_SEL(value) (LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_4_SEL_Msk & ((value) << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_4_SEL_Pos))
#define   LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_4_SEL_SPI_FLASH0_WP_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) MUX function 0  */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_4_SEL_SPI_FLASH0_WP (LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_4_SEL_SPI_FLASH0_WP_Val << LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_4_SEL_Pos)  /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) MUX function 0 Position  */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_MASK   0x77777u                                       /**< \deprecated (LPMCU_MISC_REGS_PINMUX_SEL_3) Register MASK  (Use LPMCU_MISC_REGS_PINMUX_SEL_3_Msk instead)  */
#define LPMCU_MISC_REGS_PINMUX_SEL_3_Msk    0x77777u                                       /**< (LPMCU_MISC_REGS_PINMUX_SEL_3) Register Mask  */

