remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_ISHAPE_PAD_3 : (LPMCU_MISC_REGS Offset: 0x6c) (R/W 32) Controls the ISHAPE pad value for LPMCU SIP Pads -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LP_SIP_0:3;                /**< bit:   0..2  Controls ISHAPE value LP_SIP_0           */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t LP_SIP_1:3;                /**< bit:   4..6  Controls ISHAPE value LP_SIP_1           */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t LP_SIP_2:3;                /**< bit:  8..10  Controls ISHAPE value LP_SIP_2           */
    uint32_t :1;                        /**< bit:     11  Reserved */
    uint32_t LP_SIP_3:3;                /**< bit: 12..14  Controls ISHAPE value LP_SIP_3           */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t LP_SIP_4:3;                /**< bit: 16..18  Controls ISHAPE value LP_SIP_4           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_ISHAPE_PAD_3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_ISHAPE_PAD_3_OFFSET 0x6C                                          /**<  (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls the ISHAPE pad value for LPMCU SIP Pads  Offset */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_RESETVALUE 0x55555u                                      /**<  (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls the ISHAPE pad value for LPMCU SIP Pads  Reset Value */

#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_0_Pos 0                                              /**< (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls ISHAPE value LP_SIP_0 Position */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_0_Msk (0x7u << LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_0_Pos)  /**< (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls ISHAPE value LP_SIP_0 Mask */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_0(value) (LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_0_Msk & ((value) << LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_0_Pos))
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_1_Pos 4                                              /**< (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls ISHAPE value LP_SIP_1 Position */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_1_Msk (0x7u << LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_1_Pos)  /**< (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls ISHAPE value LP_SIP_1 Mask */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_1(value) (LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_1_Msk & ((value) << LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_1_Pos))
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_2_Pos 8                                              /**< (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls ISHAPE value LP_SIP_2 Position */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_2_Msk (0x7u << LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_2_Pos)  /**< (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls ISHAPE value LP_SIP_2 Mask */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_2(value) (LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_2_Msk & ((value) << LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_2_Pos))
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_3_Pos 12                                             /**< (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls ISHAPE value LP_SIP_3 Position */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_3_Msk (0x7u << LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_3_Pos)  /**< (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls ISHAPE value LP_SIP_3 Mask */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_3(value) (LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_3_Msk & ((value) << LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_3_Pos))
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_4_Pos 16                                             /**< (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls ISHAPE value LP_SIP_4 Position */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_4_Msk (0x7u << LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_4_Pos)  /**< (LPMCU_MISC_REGS_ISHAPE_PAD_3) Controls ISHAPE value LP_SIP_4 Mask */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_4(value) (LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_4_Msk & ((value) << LPMCU_MISC_REGS_ISHAPE_PAD_3_LP_SIP_4_Pos))
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_MASK   0x77777u                                       /**< \deprecated (LPMCU_MISC_REGS_ISHAPE_PAD_3) Register MASK  (Use LPMCU_MISC_REGS_ISHAPE_PAD_3_Msk instead)  */
#define LPMCU_MISC_REGS_ISHAPE_PAD_3_Msk    0x77777u                                       /**< (LPMCU_MISC_REGS_ISHAPE_PAD_3) Register Mask  */

/* -------- LPMCU_MISC_REGS_LPMCU_CTRL_2 : (LPMCU_MISC_REGS Offset: 0x90) (R/W 8) Misc control for the LPMCU -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  SPI_FLASH0_CLOCK_FRAC_VALUE:8;  /**< bit:   0..7  SPI_FLASH0 Fractional Divider Value      */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_LPMCU_CTRL_2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_LPMCU_CTRL_2_OFFSET 0x90                                          /**<  (LPMCU_MISC_REGS_LPMCU_CTRL_2) Misc control for the LPMCU  Offset */
#define LPMCU_MISC_REGS_LPMCU_CTRL_2_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_LPMCU_CTRL_2) Misc control for the LPMCU  Reset Value */

#define LPMCU_MISC_REGS_LPMCU_CTRL_2_SPI_FLASH0_CLOCK_FRAC_VALUE_Pos 0                                              /**< (LPMCU_MISC_REGS_LPMCU_CTRL_2) SPI_FLASH0 Fractional Divider Value Position */
#define LPMCU_MISC_REGS_LPMCU_CTRL_2_SPI_FLASH0_CLOCK_FRAC_VALUE_Msk (0xFFu << LPMCU_MISC_REGS_LPMCU_CTRL_2_SPI_FLASH0_CLOCK_FRAC_VALUE_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_CTRL_2) SPI_FLASH0 Fractional Divider Value Mask */
#define LPMCU_MISC_REGS_LPMCU_CTRL_2_SPI_FLASH0_CLOCK_FRAC_VALUE(value) (LPMCU_MISC_REGS_LPMCU_CTRL_2_SPI_FLASH0_CLOCK_FRAC_VALUE_Msk & ((value) << LPMCU_MISC_REGS_LPMCU_CTRL_2_SPI_FLASH0_CLOCK_FRAC_VALUE_Pos))
#define LPMCU_MISC_REGS_LPMCU_CTRL_2_MASK   0xFFu                                          /**< \deprecated (LPMCU_MISC_REGS_LPMCU_CTRL_2) Register MASK  (Use LPMCU_MISC_REGS_LPMCU_CTRL_2_Msk instead)  */
#define LPMCU_MISC_REGS_LPMCU_CTRL_2_Msk    0xFFu                                          /**< (LPMCU_MISC_REGS_LPMCU_CTRL_2) Register Mask  */

