remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL : (LPMCU_MISC_REGS Offset: 0xa0) (R/W 8) Control for VDDIO of SPI FLASH -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ENABLE:1;                  /**< bit:      0  Enables power for the stacked (internal) SPI FLASH */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_OFFSET 0xA0                                          /**<  (LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL) Control for VDDIO of SPI FLASH  Offset */
#define LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_RESETVALUE 0x01u                                         /**<  (LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL) Control for VDDIO of SPI FLASH  Reset Value */

#define LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_ENABLE_Pos 0                                              /**< (LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL) Enables power for the stacked (internal) SPI FLASH Position */
#define LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL) Enables power for the stacked (internal) SPI FLASH Mask */
#define LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_ENABLE LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_ENABLE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_MASK 0x01u                                          /**< \deprecated (LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL) Register MASK  (Use LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_Msk 0x01u                                          /**< (LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_SPIFLASH_BYPASS : (LPMCU_MISC_REGS Offset: 0xa4) (R/W 8) SPI FLASH Bypass -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ENABLE:1;                  /**< bit:      0  Enables Bypass of SPI Flash Controller   */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_SPIFLASH_BYPASS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_SPIFLASH_BYPASS_OFFSET 0xA4                                          /**<  (LPMCU_MISC_REGS_SPIFLASH_BYPASS) SPI FLASH Bypass  Offset */
#define LPMCU_MISC_REGS_SPIFLASH_BYPASS_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_SPIFLASH_BYPASS) SPI FLASH Bypass  Reset Value */

#define LPMCU_MISC_REGS_SPIFLASH_BYPASS_ENABLE_Pos 0                                              /**< (LPMCU_MISC_REGS_SPIFLASH_BYPASS) Enables Bypass of SPI Flash Controller Position */
#define LPMCU_MISC_REGS_SPIFLASH_BYPASS_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_SPIFLASH_BYPASS_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_SPIFLASH_BYPASS) Enables Bypass of SPI Flash Controller Mask */
#define LPMCU_MISC_REGS_SPIFLASH_BYPASS_ENABLE LPMCU_MISC_REGS_SPIFLASH_BYPASS_ENABLE_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_SPIFLASH_BYPASS_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_SPIFLASH_BYPASS_MASK 0x01u                                          /**< \deprecated (LPMCU_MISC_REGS_SPIFLASH_BYPASS) Register MASK  (Use LPMCU_MISC_REGS_SPIFLASH_BYPASS_Msk instead)  */
#define LPMCU_MISC_REGS_SPIFLASH_BYPASS_Msk 0x01u                                          /**< (LPMCU_MISC_REGS_SPIFLASH_BYPASS) Register Mask  */

/* -------- LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0 : (LPMCU_MISC_REGS Offset: 0xc0) (R/W 32) ARM Cortex IRQ Mux Selection -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MUX_0:5;                   /**< bit:   0..4  IRQ_0 Source Selection                   */
    uint32_t :3;                        /**< bit:   5..7  Reserved */
    uint32_t MUX_1:5;                   /**< bit:  8..12  IRQ_1 Source Selection                   */
    uint32_t :3;                        /**< bit: 13..15  Reserved */
    uint32_t MUX_2:5;                   /**< bit: 16..20  IRQ_2 Source Selection                   */
    uint32_t :3;                        /**< bit: 21..23  Reserved */
    uint32_t MUX_3:5;                   /**< bit: 24..28  IRQ_3 Source Selection                   */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_OFFSET 0xC0                                          /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) ARM Cortex IRQ Mux Selection  Offset */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) ARM Cortex IRQ Mux Selection  Reset Value */

#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos 0                                              /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) IRQ_0 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) IRQ_0 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos 8                                              /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) IRQ_1 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) IRQ_1 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BLE_FRONTEND Position  */
