remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos 16                                             /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) IRQ_2 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) IRQ_2 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos 24                                             /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) IRQ_3 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) IRQ_3 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MASK 0x1F1F1F1Fu                                    /**< \deprecated (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) Register MASK  (Use LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_Msk instead)  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_Msk 0x1F1F1F1Fu                                    /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0) Register Mask  */

/* -------- LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1 : (LPMCU_MISC_REGS Offset: 0xc4) (R/W 32) ARM Cortex IRQ Mux Selection -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MUX_4:5;                   /**< bit:   0..4  IRQ_4 Source Selection                   */
    uint32_t :3;                        /**< bit:   5..7  Reserved */
    uint32_t MUX_5:5;                   /**< bit:  8..12  IRQ_5 Source Selection                   */
    uint32_t :3;                        /**< bit: 13..15  Reserved */
    uint32_t MUX_6:5;                   /**< bit: 16..20  IRQ_6 Source Selection                   */
    uint32_t :3;                        /**< bit: 21..23  Reserved */
    uint32_t MUX_7:5;                   /**< bit: 24..28  IRQ_7 Source Selection                   */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

