remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_OFFSET 0xC4                                          /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) ARM Cortex IRQ Mux Selection  Offset */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) ARM Cortex IRQ Mux Selection  Reset Value */

#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos 0                                              /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) IRQ_4 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) IRQ_4 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos 8                                              /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) IRQ_5 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) IRQ_5 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos 16                                             /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) IRQ_6 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) IRQ_6 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) LP_CLK_CAL_DONE  */
