remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos 24                                             /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) IRQ_7 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) IRQ_7 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MASK 0x1F1F1F1Fu                                    /**< \deprecated (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) Register MASK  (Use LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_Msk instead)  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_Msk 0x1F1F1F1Fu                                    /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1) Register Mask  */

/* -------- LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2 : (LPMCU_MISC_REGS Offset: 0xc8) (R/W 32) ARM Cortex IRQ Mux Selection -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MUX_8:5;                   /**< bit:   0..4  IRQ_8 Source Selection                   */
    uint32_t :3;                        /**< bit:   5..7  Reserved */
    uint32_t MUX_9:5;                   /**< bit:  8..12  IRQ_9 Source Selection                   */
    uint32_t :3;                        /**< bit: 13..15  Reserved */
    uint32_t MUX_10:5;                  /**< bit: 16..20  IRQ_10 Source Selection                  */
    uint32_t :3;                        /**< bit: 21..23  Reserved */
    uint32_t MUX_11:5;                  /**< bit: 24..28  IRQ_11 Source Selection                  */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

