remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_OFFSET 0xC8                                          /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) ARM Cortex IRQ Mux Selection  Offset */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) ARM Cortex IRQ Mux Selection  Reset Value */

#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos 0                                              /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) IRQ_8 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) IRQ_8 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos 8                                              /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) IRQ_9 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) IRQ_9 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos 16                                             /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) IRQ_10 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) IRQ_10 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) LP_CLK_CAL_DONE  */
