remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos 24                                             /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) IRQ_11 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) IRQ_11 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MASK 0x1F1F1F1Fu                                    /**< \deprecated (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) Register MASK  (Use LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_Msk instead)  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_Msk 0x1F1F1F1Fu                                    /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2) Register Mask  */

/* -------- LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3 : (LPMCU_MISC_REGS Offset: 0xcc) (R/W 32) ARM Cortex IRQ Mux Selection -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MUX_12:5;                  /**< bit:   0..4  IRQ_12 Source Selection                  */
    uint32_t :3;                        /**< bit:   5..7  Reserved */
    uint32_t MUX_13:5;                  /**< bit:  8..12  IRQ_13 Source Selection                  */
    uint32_t :3;                        /**< bit: 13..15  Reserved */
    uint32_t MUX_14:5;                  /**< bit: 16..20  IRQ_14 Source Selection                  */
    uint32_t :3;                        /**< bit: 21..23  Reserved */
    uint32_t MUX_15:5;                  /**< bit: 24..28  IRQ_15 Source Selection                  */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

