remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_OFFSET 0xCC                                          /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) ARM Cortex IRQ Mux Selection  Offset */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) ARM Cortex IRQ Mux Selection  Reset Value */

#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos 0                                              /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) IRQ_12 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) IRQ_12 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos 8                                              /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) IRQ_13 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) IRQ_13 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos 16                                             /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) IRQ_14 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) IRQ_14 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROG_AHB_TRIG_TIMEOUT  */
