remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos 24                                             /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) IRQ_15 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) IRQ_15 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MASK 0x1F1F1F1Fu                                    /**< \deprecated (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) Register MASK  (Use LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_Msk instead)  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_Msk 0x1F1F1F1Fu                                    /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3) Register Mask  */

/* -------- LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4 : (LPMCU_MISC_REGS Offset: 0xd0) (R/W 32) ARM Cortex IRQ Mux Selection -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MUX_16:5;                  /**< bit:   0..4  IRQ_16 Source Selection                  */
    uint32_t :3;                        /**< bit:   5..7  Reserved */
    uint32_t MUX_17:5;                  /**< bit:  8..12  IRQ_17 Source Selection                  */
    uint32_t :3;                        /**< bit: 13..15  Reserved */
    uint32_t MUX_18:5;                  /**< bit: 16..20  IRQ_18 Source Selection                  */
    uint32_t :3;                        /**< bit: 21..23  Reserved */
    uint32_t MUX_19:5;                  /**< bit: 24..28  IRQ_19 Source Selection                  */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

