remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_OFFSET 0xD0                                          /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) ARM Cortex IRQ Mux Selection  Offset */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) ARM Cortex IRQ Mux Selection  Reset Value */

#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos 0                                              /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) IRQ_16 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) IRQ_16 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos 8                                              /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) IRQ_17 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) IRQ_17 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos 16                                             /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) IRQ_18 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) IRQ_18 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROG_AHB_TRIG_TIMEOUT  */
