remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos 24                                             /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) IRQ_19 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) IRQ_19 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MASK 0x1F1F1F1Fu                                    /**< \deprecated (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) Register MASK  (Use LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_Msk instead)  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_Msk 0x1F1F1F1Fu                                    /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4) Register Mask  */

