remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5 : (LPMCU_MISC_REGS Offset: 0xd4) (R/W 8) ARM Cortex IRQ Mux Selection -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  MUX_20:5;                  /**< bit:   0..4  IRQ_20 Source Selection                  */
    uint8_t  :3;                        /**< bit:   5..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_OFFSET 0xD4                                          /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) ARM Cortex IRQ Mux Selection  Offset */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) ARM Cortex IRQ Mux Selection  Reset Value */

#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos 0                                              /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) IRQ_20 Source Selection Position */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Msk (0x1Fu << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) IRQ_20 Source Selection Mask */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20(value) (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Msk & ((value) << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos))
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) BROWNOUT_DETECTED  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) UART0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) UART0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) UART1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_4_Val 0x4u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) UART1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_5_Val 0x5u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SPI0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_6_Val 0x6u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SPI0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_7_Val 0x7u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SPI1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_8_Val 0x8u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SPI1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_9_Val 0x9u                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) I2C0 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_10_Val 0xAu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) I2C0 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_11_Val 0xBu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) I2C1 RX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_12_Val 0xCu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) I2C1 TX  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_13_Val 0xDu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) WDT0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_14_Val 0xEu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) WDT1  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_15_Val 0xFu                                           /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) DUALTIMER0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_16_Val 0x10u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) PROV_DMA_CTRL0  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_17_Val 0x11u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SECURITY  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_18_Val 0x12u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) EFUSE_OUT_OF_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_19_Val 0x13u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) QUAD_DEC0_1_2  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_20_Val 0x14u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) BLE_FRONTEND  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_21_Val 0x15u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) PROG_AHB_TRIG_TIMEOUT  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_22_Val 0x16u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SXPLL_NEED_RESET  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_23_Val 0x17u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) LP_CLK_CAL_DONE  */
#define   LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_24_Val 0x18u                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) BROWNOUT_DETECTED  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_0 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_0_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_1 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_1_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) UART0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_2 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_2_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) UART0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_3 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_3_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) UART1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_4 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_4_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) UART1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_5 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_5_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SPI0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_6 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_6_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SPI0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_7 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_7_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SPI1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_8 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_8_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SPI1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_9 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_9_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) I2C0 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_10 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_10_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) I2C0 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_11 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_11_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) I2C1 RX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_12 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_12_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) I2C1 TX Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_13 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_13_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) WDT0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_14 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_14_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) WDT1 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_15 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_15_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) DUALTIMER0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_16 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_16_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) PROV_DMA_CTRL0 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_17 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_17_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SECURITY Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_18 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_18_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) EFUSE_OUT_OF_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_19 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_19_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) QUAD_DEC0_1_2 Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_20 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_20_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) BLE_FRONTEND Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_21 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_21_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) PROG_AHB_TRIG_TIMEOUT Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_22 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_22_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) SXPLL_NEED_RESET Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_23 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_23_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) LP_CLK_CAL_DONE Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_24 (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_24_Val << LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20_Pos)  /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) BROWNOUT_DETECTED Position  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MASK 0x1Fu                                          /**< \deprecated (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) Register MASK  (Use LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_Msk instead)  */
#define LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_Msk 0x1Fu                                          /**< (LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5) Register Mask  */

/* -------- LPMCU_MISC_REGS_PWM0_CTRL : (LPMCU_MISC_REGS Offset: 0x160) (R/W 32) PWM0 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t PWM_EN:1;                  /**< bit:      0  Active High PWM Enable                   */
    uint32_t OUTPUT_POLARITY:1;         /**< bit:      1  1 to inverse the polarity                */
    uint32_t AGCDATA_FMT:1;             /**< bit:      2  AGC data format                          */
    uint32_t SAMPLE_METHOD:1;           /**< bit:      3  Sample Method                            */
    uint32_t :1;                        /**< bit:      4  Reserved */
    uint32_t PWM_PERIOD:4;              /**< bit:   5..8  programmable PWM update period           */
    uint32_t AGCDATA_IN:10;             /**< bit:  9..18  agc value from AGC                       */
    uint32_t :2;                        /**< bit: 19..20  Reserved */
    uint32_t CLOCK_SEL:2;               /**< bit: 21..22  PWM Source Clock Frequency Select        */
    uint32_t :9;                        /**< bit: 23..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_PWM0_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_PWM0_CTRL_OFFSET    0x160                                         /**<  (LPMCU_MISC_REGS_PWM0_CTRL) PWM0 Control Register  Offset */
#define LPMCU_MISC_REGS_PWM0_CTRL_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_PWM0_CTRL) PWM0 Control Register  Reset Value */

