remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_PWM0_CTRL_PWM_EN_Pos 0                                              /**< (LPMCU_MISC_REGS_PWM0_CTRL) Active High PWM Enable Position */
#define LPMCU_MISC_REGS_PWM0_CTRL_PWM_EN_Msk (0x1u << LPMCU_MISC_REGS_PWM0_CTRL_PWM_EN_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) Active High PWM Enable Mask */
#define LPMCU_MISC_REGS_PWM0_CTRL_PWM_EN    LPMCU_MISC_REGS_PWM0_CTRL_PWM_EN_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_PWM0_CTRL_PWM_EN_Msk instead */
#define LPMCU_MISC_REGS_PWM0_CTRL_OUTPUT_POLARITY_Pos 1                                              /**< (LPMCU_MISC_REGS_PWM0_CTRL) 1 to inverse the polarity Position */
#define LPMCU_MISC_REGS_PWM0_CTRL_OUTPUT_POLARITY_Msk (0x1u << LPMCU_MISC_REGS_PWM0_CTRL_OUTPUT_POLARITY_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) 1 to inverse the polarity Mask */
#define LPMCU_MISC_REGS_PWM0_CTRL_OUTPUT_POLARITY LPMCU_MISC_REGS_PWM0_CTRL_OUTPUT_POLARITY_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_PWM0_CTRL_OUTPUT_POLARITY_Msk instead */
#define LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_FMT_Pos 2                                              /**< (LPMCU_MISC_REGS_PWM0_CTRL) AGC data format Position */
#define LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_FMT_Msk (0x1u << LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_FMT_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) AGC data format Mask */
#define LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_FMT LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_FMT_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_FMT_Msk instead */
#define LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_Pos 3                                              /**< (LPMCU_MISC_REGS_PWM0_CTRL) Sample Method Position */
#define LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_Msk (0x1u << LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) Sample Method Mask */
#define LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_Msk instead */
#define   LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PWM0_CTRL) Samples agcdata at >= 1024 cycles and does not lose precision  */
#define   LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PWM0_CTRL) Samples at PWM period but will lose LSBs if less than 1024  */
#define LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_0 (LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_0_Val << LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) Samples agcdata at >= 1024 cycles and does not lose precision Position  */
#define LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_1 (LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_1_Val << LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) Samples at PWM period but will lose LSBs if less than 1024 Position  */
#define LPMCU_MISC_REGS_PWM0_CTRL_PWM_PERIOD_Pos 5                                              /**< (LPMCU_MISC_REGS_PWM0_CTRL) programmable PWM update period Position */
#define LPMCU_MISC_REGS_PWM0_CTRL_PWM_PERIOD_Msk (0xFu << LPMCU_MISC_REGS_PWM0_CTRL_PWM_PERIOD_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) programmable PWM update period Mask */
#define LPMCU_MISC_REGS_PWM0_CTRL_PWM_PERIOD(value) (LPMCU_MISC_REGS_PWM0_CTRL_PWM_PERIOD_Msk & ((value) << LPMCU_MISC_REGS_PWM0_CTRL_PWM_PERIOD_Pos))
#define LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_IN_Pos 9                                              /**< (LPMCU_MISC_REGS_PWM0_CTRL) agc value from AGC Position */
#define LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_IN_Msk (0x3FFu << LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_IN_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) agc value from AGC Mask */
#define LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_IN(value) (LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_IN_Msk & ((value) << LPMCU_MISC_REGS_PWM0_CTRL_AGCDATA_IN_Pos))
#define LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_Pos 21                                             /**< (LPMCU_MISC_REGS_PWM0_CTRL) PWM Source Clock Frequency Select Position */
#define LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_Msk (0x3u << LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) PWM Source Clock Frequency Select Mask */
#define LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL(value) (LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_Msk & ((value) << LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_Pos))
#define   LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PWM0_CTRL) 26MHz  */
#define   LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PWM0_CTRL) 13MHz  */
#define   LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PWM0_CTRL) 6.5MHz  */
#define   LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_PWM0_CTRL) 3.25MHz  */
#define LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_0 (LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_0_Val << LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) 26MHz Position  */
#define LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_1 (LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_1_Val << LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) 13MHz Position  */
#define LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_2 (LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_2_Val << LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) 6.5MHz Position  */
#define LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_3 (LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_3_Val << LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_PWM0_CTRL) 3.25MHz Position  */
#define LPMCU_MISC_REGS_PWM0_CTRL_MASK      0x67FFEFu                                      /**< \deprecated (LPMCU_MISC_REGS_PWM0_CTRL) Register MASK  (Use LPMCU_MISC_REGS_PWM0_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_PWM0_CTRL_Msk       0x67FFEFu                                      /**< (LPMCU_MISC_REGS_PWM0_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_PWM1_CTRL : (LPMCU_MISC_REGS Offset: 0x164) (R/W 32) PWM1 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t PWM_EN:1;                  /**< bit:      0  Active High PWM Enable                   */
    uint32_t OUTPUT_POLARITY:1;         /**< bit:      1  1 to inverse the polarity                */
    uint32_t AGCDATA_FMT:1;             /**< bit:      2  AGC data format                          */
    uint32_t SAMPLE_METHOD:1;           /**< bit:      3  Sample Method                            */
    uint32_t :1;                        /**< bit:      4  Reserved */
    uint32_t PWM_PERIOD:4;              /**< bit:   5..8  programmable PWM update period           */
    uint32_t AGCDATA_IN:10;             /**< bit:  9..18  agc value from AGC                       */
    uint32_t :2;                        /**< bit: 19..20  Reserved */
    uint32_t CLOCK_SEL:2;               /**< bit: 21..22  PWM Source Clock Frequency Select        */
    uint32_t :9;                        /**< bit: 23..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_PWM1_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_PWM1_CTRL_OFFSET    0x164                                         /**<  (LPMCU_MISC_REGS_PWM1_CTRL) PWM1 Control Register  Offset */
#define LPMCU_MISC_REGS_PWM1_CTRL_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_PWM1_CTRL) PWM1 Control Register  Reset Value */

#define LPMCU_MISC_REGS_PWM1_CTRL_PWM_EN_Pos 0                                              /**< (LPMCU_MISC_REGS_PWM1_CTRL) Active High PWM Enable Position */
#define LPMCU_MISC_REGS_PWM1_CTRL_PWM_EN_Msk (0x1u << LPMCU_MISC_REGS_PWM1_CTRL_PWM_EN_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) Active High PWM Enable Mask */
#define LPMCU_MISC_REGS_PWM1_CTRL_PWM_EN    LPMCU_MISC_REGS_PWM1_CTRL_PWM_EN_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_PWM1_CTRL_PWM_EN_Msk instead */
#define LPMCU_MISC_REGS_PWM1_CTRL_OUTPUT_POLARITY_Pos 1                                              /**< (LPMCU_MISC_REGS_PWM1_CTRL) 1 to inverse the polarity Position */
#define LPMCU_MISC_REGS_PWM1_CTRL_OUTPUT_POLARITY_Msk (0x1u << LPMCU_MISC_REGS_PWM1_CTRL_OUTPUT_POLARITY_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) 1 to inverse the polarity Mask */
#define LPMCU_MISC_REGS_PWM1_CTRL_OUTPUT_POLARITY LPMCU_MISC_REGS_PWM1_CTRL_OUTPUT_POLARITY_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_PWM1_CTRL_OUTPUT_POLARITY_Msk instead */
#define LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_FMT_Pos 2                                              /**< (LPMCU_MISC_REGS_PWM1_CTRL) AGC data format Position */
#define LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_FMT_Msk (0x1u << LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_FMT_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) AGC data format Mask */
#define LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_FMT LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_FMT_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_FMT_Msk instead */
#define LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_Pos 3                                              /**< (LPMCU_MISC_REGS_PWM1_CTRL) Sample Method Position */
#define LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_Msk (0x1u << LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) Sample Method Mask */
#define LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_Msk instead */
#define   LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PWM1_CTRL) Samples agcdata at >= 1024 cycles and does not lose precision  */
#define   LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PWM1_CTRL) Samples at PWM period but will lose LSBs if less than 1024  */
#define LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_0 (LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_0_Val << LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) Samples agcdata at >= 1024 cycles and does not lose precision Position  */
#define LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_1 (LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_1_Val << LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) Samples at PWM period but will lose LSBs if less than 1024 Position  */
#define LPMCU_MISC_REGS_PWM1_CTRL_PWM_PERIOD_Pos 5                                              /**< (LPMCU_MISC_REGS_PWM1_CTRL) programmable PWM update period Position */
#define LPMCU_MISC_REGS_PWM1_CTRL_PWM_PERIOD_Msk (0xFu << LPMCU_MISC_REGS_PWM1_CTRL_PWM_PERIOD_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) programmable PWM update period Mask */
#define LPMCU_MISC_REGS_PWM1_CTRL_PWM_PERIOD(value) (LPMCU_MISC_REGS_PWM1_CTRL_PWM_PERIOD_Msk & ((value) << LPMCU_MISC_REGS_PWM1_CTRL_PWM_PERIOD_Pos))
#define LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_IN_Pos 9                                              /**< (LPMCU_MISC_REGS_PWM1_CTRL) agc value from AGC Position */
#define LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_IN_Msk (0x3FFu << LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_IN_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) agc value from AGC Mask */
#define LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_IN(value) (LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_IN_Msk & ((value) << LPMCU_MISC_REGS_PWM1_CTRL_AGCDATA_IN_Pos))
#define LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_Pos 21                                             /**< (LPMCU_MISC_REGS_PWM1_CTRL) PWM Source Clock Frequency Select Position */
#define LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_Msk (0x3u << LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) PWM Source Clock Frequency Select Mask */
#define LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL(value) (LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_Msk & ((value) << LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_Pos))
#define   LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_PWM1_CTRL) 26MHz  */
#define   LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_PWM1_CTRL) 13MHz  */
#define   LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_PWM1_CTRL) 6.5MHz  */
#define   LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_PWM1_CTRL) 3.25MHz  */
#define LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_0 (LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_0_Val << LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) 26MHz Position  */
#define LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_1 (LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_1_Val << LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) 13MHz Position  */
#define LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_2 (LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_2_Val << LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) 6.5MHz Position  */
#define LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_3 (LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_3_Val << LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_PWM1_CTRL) 3.25MHz Position  */
#define LPMCU_MISC_REGS_PWM1_CTRL_MASK      0x67FFEFu                                      /**< \deprecated (LPMCU_MISC_REGS_PWM1_CTRL) Register MASK  (Use LPMCU_MISC_REGS_PWM1_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_PWM1_CTRL_Msk       0x67FFEFu                                      /**< (LPMCU_MISC_REGS_PWM1_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_PWM2_CTRL : (LPMCU_MISC_REGS Offset: 0x168) (R/W 32) PWM2 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t PWM_EN:1;                  /**< bit:      0  Active High PWM Enable                   */
    uint32_t OUTPUT_POLARITY:1;         /**< bit:      1  1 to inverse the polarity                */
    uint32_t AGCDATA_FMT:1;             /**< bit:      2  AGC data format                          */
    uint32_t SAMPLE_METHOD:1;           /**< bit:      3  Sample Method                            */
    uint32_t :1;                        /**< bit:      4  Reserved */
    uint32_t PWM_PERIOD:4;              /**< bit:   5..8  programmable PWM update period           */
    uint32_t AGCDATA_IN:10;             /**< bit:  9..18  agc value from AGC                       */
    uint32_t :2;                        /**< bit: 19..20  Reserved */
    uint32_t CLOCK_SEL:2;               /**< bit: 21..22  PWM Source Clock Frequency Select        */
    uint32_t :9;                        /**< bit: 23..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_PWM2_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

