remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL : (LPMCU_MISC_REGS Offset: 0x190) (R/W 32) Sleep and Wakeup Control for the AON Power Sequencer -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SLEEP_1:1;                 /**< bit:      0  Sleep Request 1 from the ARM to the AON Power Sequencer */
    uint32_t :15;                       /**< bit:  1..15  Reserved */
    uint32_t WAKEUP:1;                  /**< bit:     16  Wakeup Request from the ARM to the AON Power Sequencer */
    uint32_t :7;                        /**< bit: 17..23  Reserved */
    uint32_t RXTX_WAKEUP:1;             /**< bit:     24  Wakeup Request from the ARM to the RxTx Sequencer */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_OFFSET 0x190                                         /**<  (LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL) Sleep and Wakeup Control for the AON Power Sequencer  Offset */
#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_RESETVALUE 0x1000000u                                    /**<  (LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL) Sleep and Wakeup Control for the AON Power Sequencer  Reset Value */

#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_SLEEP_1_Pos 0                                              /**< (LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL) Sleep Request 1 from the ARM to the AON Power Sequencer Position */
#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_SLEEP_1_Msk (0x1u << LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_SLEEP_1_Pos)  /**< (LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL) Sleep Request 1 from the ARM to the AON Power Sequencer Mask */
#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_SLEEP_1 LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_SLEEP_1_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_SLEEP_1_Msk instead */
#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_WAKEUP_Pos 16                                             /**< (LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL) Wakeup Request from the ARM to the AON Power Sequencer Position */
#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_WAKEUP_Msk (0x1u << LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_WAKEUP_Pos)  /**< (LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL) Wakeup Request from the ARM to the AON Power Sequencer Mask */
#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_WAKEUP LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_WAKEUP_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_WAKEUP_Msk instead */
#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_RXTX_WAKEUP_Pos 24                                             /**< (LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL) Wakeup Request from the ARM to the RxTx Sequencer Position */
#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_RXTX_WAKEUP_Msk (0x1u << LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_RXTX_WAKEUP_Pos)  /**< (LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL) Wakeup Request from the ARM to the RxTx Sequencer Mask */
#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_RXTX_WAKEUP LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_RXTX_WAKEUP_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_RXTX_WAKEUP_Msk instead */
#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_MASK 0x1010001u                                     /**< \deprecated (LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL) Register MASK  (Use LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_Msk 0x1010001u                                     /**< (LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0 : (LPMCU_MISC_REGS Offset: 0x1a0) (R/W 32) Mega Mux Selection -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LP_GPIO_0:6;               /**< bit:   0..5  LP_GPIO_0 mega mux selection             */
    uint32_t :2;                        /**< bit:   6..7  Reserved */
    uint32_t LP_GPIO_1:6;               /**< bit:  8..13  LP_GPIO_1 mega mux selection             */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t LP_GPIO_2:6;               /**< bit: 16..21  LP_GPIO_2 mega mux selection             */
    uint32_t :2;                        /**< bit: 22..23  Reserved */
    uint32_t LP_GPIO_3:6;               /**< bit: 24..29  LP_GPIO_3 mega mux selection             */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_OFFSET 0x1A0                                         /**<  (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) Mega Mux Selection  Offset */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_RESETVALUE 0x3F3F3F3Fu                                   /**<  (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) Mega Mux Selection  Reset Value */

#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos 0                                              /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) LP_GPIO_0 mega mux selection Position */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Msk (0x3Fu << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) LP_GPIO_0 mega mux selection Mask */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0(value) (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Msk & ((value) << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos))
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_RXD_Val 0x0u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_RXD  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_TXD_Val 0x1u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_TXD  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_CTS_Val 0x2u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_CTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_RTS_Val 0x3u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_RTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_RXD_Val 0x4u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_RXD  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_TXD_Val 0x5u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_TXD  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_CTS_Val 0x6u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_CTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_RTS_Val 0x7u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_RTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C0_SDA_Val 0x8u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C0_SDA  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C0_SCL_Val 0x9u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C0_SCL  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C1_SDA_Val 0xAu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C1_SDA  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C1_SCL_Val 0xBu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C1_SCL  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM0_OUT_Val 0xCu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM0_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM1_OUT_Val 0xDu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM1_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM2_OUT_Val 0xEu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM2_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM3_OUT_Val 0xFu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM3_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_32KHZ_CLK_Val 0x10u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) 32KHZ_CLK  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_WLAN_TX_Val 0x11u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_WLAN_TX  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_WLAN_RX_Val 0x12u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_WLAN_RX  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_TX_Val 0x13u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_TX  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_RX_Val 0x14u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_RX  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_IN_PROCESS_Val 0x15u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_IN_PROCESS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_MBSY_Val 0x16u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_MBSY  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_SYNC_Val 0x17u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_SYNC  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_RXNTX_Val 0x18u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_RXNTX  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_0_Val 0x19u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_PTI_0  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_1_Val 0x1Au                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_PTI_1  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_2_Val 0x1Bu                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_PTI_2  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_3_Val 0x1Cu                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_PTI_3  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC0_A_Val 0x1Du                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC0_A  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC0_B_Val 0x1Eu                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC0_B  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC1_A_Val 0x1Fu                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC1_A  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC1_B_Val 0x20u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC1_B  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC2_A_Val 0x21u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC2_A  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC2_B_Val 0x22u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC2_B  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_RXD (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_RXD_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_RXD Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_TXD (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_TXD_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_TXD Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_CTS (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_CTS_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_CTS Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_RTS (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART0_RTS_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_RTS Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_RXD (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_RXD_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_RXD Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_TXD (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_TXD_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_TXD Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_CTS (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_CTS_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_CTS Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_RTS (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_UART1_RTS_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_RTS Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C0_SDA (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C0_SDA_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C0_SDA Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C0_SCL (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C0_SCL_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C0_SCL Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C1_SDA (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C1_SDA_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C1_SDA Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C1_SCL (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_I2C1_SCL_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C1_SCL Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM0_OUT (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM0_OUT_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM0_OUT Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM1_OUT (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM1_OUT_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM1_OUT Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM2_OUT (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM2_OUT_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM2_OUT Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM3_OUT (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_PWM3_OUT_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM3_OUT Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_32KHZ_CLK (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_32KHZ_CLK_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) 32KHZ_CLK Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_WLAN_TX (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_WLAN_TX_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_WLAN_TX Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_WLAN_RX (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_WLAN_RX_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_WLAN_RX Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_TX (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_TX_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_TX Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_RX (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_RX_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_RX Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_IN_PROCESS (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_IN_PROCESS_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_IN_PROCESS Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_MBSY (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_MBSY_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_MBSY Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_SYNC (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_SYNC_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_SYNC Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_RXNTX (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_RXNTX_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_RXNTX Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_0 (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_0_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_PTI_0 Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_1 (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_1_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_PTI_1 Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_2 (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_2_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_PTI_2 Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_3 (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_COEX_BLE_PTI_3_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) COEX_BLE_PTI_3 Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC0_A (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC0_A_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC0_A Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC0_B (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC0_B_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC0_B Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC1_A (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC1_A_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC1_A Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC1_B (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC1_B_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC1_B Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC2_A (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC2_A_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC2_A Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC2_B (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_QUAD_DEC2_B_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) QUAD_DEC2_B Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_Pos 8                                              /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) LP_GPIO_1 mega mux selection Position */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_Msk (0x3Fu << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) LP_GPIO_1 mega mux selection Mask */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1(value) (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_Msk & ((value) << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_Pos))
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_UART0_RXD_Val 0x0u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_RXD  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_UART0_TXD_Val 0x1u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_TXD  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_UART0_CTS_Val 0x2u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_CTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_UART0_RTS_Val 0x3u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART0_RTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_UART1_RXD_Val 0x4u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_RXD  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_UART1_TXD_Val 0x5u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_TXD  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_UART1_CTS_Val 0x6u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_CTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_UART1_RTS_Val 0x7u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) UART1_RTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_I2C0_SDA_Val 0x8u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C0_SDA  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_I2C0_SCL_Val 0x9u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C0_SCL  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_I2C1_SDA_Val 0xAu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C1_SDA  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_I2C1_SCL_Val 0xBu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) I2C1_SCL  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_PWM0_OUT_Val 0xCu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM0_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_PWM1_OUT_Val 0xDu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM1_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_PWM2_OUT_Val 0xEu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM2_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_PWM3_OUT_Val 0xFu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) PWM3_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1_32KHZ_CLK_Val 0x10u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0) 32KHZ_CLK  */
