remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART0_TXD_Val 0x1u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART0_TXD  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART0_CTS_Val 0x2u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART0_CTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART0_RTS_Val 0x3u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART0_RTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_RXD_Val 0x4u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART1_RXD  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_TXD_Val 0x5u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART1_TXD  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_CTS_Val 0x6u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART1_CTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_RTS_Val 0x7u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART1_RTS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C0_SDA_Val 0x8u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) I2C0_SDA  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C0_SCL_Val 0x9u                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) I2C0_SCL  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C1_SDA_Val 0xAu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) I2C1_SDA  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C1_SCL_Val 0xBu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) I2C1_SCL  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM0_OUT_Val 0xCu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) PWM0_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM1_OUT_Val 0xDu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) PWM1_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM2_OUT_Val 0xEu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) PWM2_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM3_OUT_Val 0xFu                                           /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) PWM3_OUT  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_32KHZ_CLK_Val 0x10u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) 32KHZ_CLK  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_WLAN_TX_Val 0x11u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_WLAN_TX  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_WLAN_RX_Val 0x12u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_WLAN_RX  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_TX_Val 0x13u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_TX  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_RX_Val 0x14u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_RX  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_IN_PROCESS_Val 0x15u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_IN_PROCESS  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_MBSY_Val 0x16u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_MBSY  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_SYNC_Val 0x17u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_SYNC  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_RXNTX_Val 0x18u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_RXNTX  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_0_Val 0x19u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_PTI_0  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_1_Val 0x1Au                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_PTI_1  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_2_Val 0x1Bu                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_PTI_2  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_3_Val 0x1Cu                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_PTI_3  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC0_A_Val 0x1Du                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC0_A  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC0_B_Val 0x1Eu                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC0_B  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC1_A_Val 0x1Fu                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC1_A  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC1_B_Val 0x20u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC1_B  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC2_A_Val 0x21u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC2_A  */
#define   LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC2_B_Val 0x22u                                          /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC2_B  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART0_RXD (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART0_RXD_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART0_RXD Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART0_TXD (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART0_TXD_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART0_TXD Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART0_CTS (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART0_CTS_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART0_CTS Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART0_RTS (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART0_RTS_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART0_RTS Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_RXD (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_RXD_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART1_RXD Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_TXD (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_TXD_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART1_TXD Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_CTS (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_CTS_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART1_CTS Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_RTS (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_UART1_RTS_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) UART1_RTS Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C0_SDA (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C0_SDA_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) I2C0_SDA Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C0_SCL (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C0_SCL_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) I2C0_SCL Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C1_SDA (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C1_SDA_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) I2C1_SDA Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C1_SCL (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_I2C1_SCL_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) I2C1_SCL Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM0_OUT (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM0_OUT_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) PWM0_OUT Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM1_OUT (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM1_OUT_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) PWM1_OUT Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM2_OUT (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM2_OUT_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) PWM2_OUT Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM3_OUT (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_PWM3_OUT_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) PWM3_OUT Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_32KHZ_CLK (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_32KHZ_CLK_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) 32KHZ_CLK Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_WLAN_TX (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_WLAN_TX_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_WLAN_TX Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_WLAN_RX (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_WLAN_RX_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_WLAN_RX Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_TX (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_TX_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_TX Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_RX (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_RX_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_RX Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_IN_PROCESS (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_IN_PROCESS_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_IN_PROCESS Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_MBSY (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_MBSY_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_MBSY Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_SYNC (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_SYNC_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_SYNC Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_RXNTX (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_RXNTX_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_RXNTX Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_0 (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_0_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_PTI_0 Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_1 (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_1_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_PTI_1 Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_2 (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_2_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_PTI_2 Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_3 (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_COEX_BLE_PTI_3_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) COEX_BLE_PTI_3 Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC0_A (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC0_A_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC0_A Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC0_B (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC0_B_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC0_B Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC1_A (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC1_A_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC1_A Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC1_B (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC1_B_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC1_B Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC2_A (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC2_A_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC2_A Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC2_B (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_QUAD_DEC2_B_Val << LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7_Pos)  /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) QUAD_DEC2_B Position  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_MASK 0x3F3F3F3Fu                                    /**< \deprecated (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) Register MASK  (Use LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_Msk instead)  */
#define LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_Msk 0x3F3F3F3Fu                                    /**< (LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1) Register Mask  */

