remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_FRAC_PART_Pos 0                                              /**< (LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL) Fractional part for the clock divider Position */
#define LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_FRAC_PART_Msk (0xFFu << LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_FRAC_PART_Pos)  /**< (LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL) Fractional part for the clock divider Mask */
#define LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_FRAC_PART(value) (LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_FRAC_PART_Msk & ((value) << LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_FRAC_PART_Pos))
#define LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INT_PART_Pos 8                                              /**< (LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL) Integer part for the clock divider Position */
#define LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INT_PART_Msk (0xFFFu << LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INT_PART_Pos)  /**< (LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL) Integer part for the clock divider Mask */
#define LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INT_PART(value) (LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INT_PART_Msk & ((value) << LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INT_PART_Pos))
#define LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INVERT_Pos 20                                             /**< (LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL) Invert Sens ADC Clock Position */
#define LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INVERT_Msk (0x1u << LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INVERT_Pos)  /**< (LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL) Invert Sens ADC Clock Mask */
#define LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INVERT LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INVERT_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_INVERT_Msk instead */
#define LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_MASK 0x1FFFFFu                                      /**< \deprecated (LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL) Register MASK  (Use LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_Msk 0x1FFFFFu                                      /**< (LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS : (LPMCU_MISC_REGS Offset: 0x1c4) (R/ 32) Raw Status from the Sensor ADC -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ADC_OUT:11;                /**< bit:  0..10  Raw Status of the sens_adc_out port of the PMU */
    uint32_t :1;                        /**< bit:     11  Reserved */
    uint32_t ADC_CH:2;                  /**< bit: 12..13  Raw Status of the sens_adc_ch port of the PMU */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t ADC_DONE:1;                /**< bit:     16  Raw Status of the sens_adc_done port of the PMU */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_OFFSET 0x1C4                                         /**<  (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS) Raw Status from the Sensor ADC  Offset */
#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS) Raw Status from the Sensor ADC  Reset Value */

#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_OUT_Pos 0                                              /**< (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS) Raw Status of the sens_adc_out port of the PMU Position */
#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_OUT_Msk (0x7FFu << LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_OUT_Pos)  /**< (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS) Raw Status of the sens_adc_out port of the PMU Mask */
#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_OUT(value) (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_OUT_Msk & ((value) << LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_OUT_Pos))
#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_CH_Pos 12                                             /**< (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS) Raw Status of the sens_adc_ch port of the PMU Position */
#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_CH_Msk (0x3u << LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_CH_Pos)  /**< (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS) Raw Status of the sens_adc_ch port of the PMU Mask */
#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_CH(value) (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_CH_Msk & ((value) << LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_CH_Pos))
#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_DONE_Pos 16                                             /**< (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS) Raw Status of the sens_adc_done port of the PMU Position */
#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_DONE_Msk (0x1u << LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_DONE_Pos)  /**< (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS) Raw Status of the sens_adc_done port of the PMU Mask */
#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_DONE LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_DONE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_ADC_DONE_Msk instead */
#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_MASK 0x137FFu                                       /**< \deprecated (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS) Register MASK  (Use LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_Msk instead)  */
#define LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_Msk 0x137FFu                                       /**< (LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS) Register Mask  */

/* -------- LPMCU_MISC_REGS_SENS_ADC_CH0_DATA : (LPMCU_MISC_REGS Offset: 0x1c8) (R/ 16) Current data of the Sensor ADC for Channel 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t SENS_ADC_CH0_DATA:11;      /**< bit:  0..10                                           */
    uint16_t :5;                        /**< bit: 11..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_OFFSET 0x1C8                                         /**<  (LPMCU_MISC_REGS_SENS_ADC_CH0_DATA) Current data of the Sensor ADC for Channel 0  Offset */
#define LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_SENS_ADC_CH0_DATA) Current data of the Sensor ADC for Channel 0  Reset Value */

#define LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_SENS_ADC_CH0_DATA_Pos 0                                              /**< (LPMCU_MISC_REGS_SENS_ADC_CH0_DATA)  Position */
#define LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_SENS_ADC_CH0_DATA_Msk (0x7FFu << LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_SENS_ADC_CH0_DATA_Pos)  /**< (LPMCU_MISC_REGS_SENS_ADC_CH0_DATA)  Mask */
#define LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_SENS_ADC_CH0_DATA(value) (LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_SENS_ADC_CH0_DATA_Msk & ((value) << LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_SENS_ADC_CH0_DATA_Pos))
#define LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_MASK 0x7FFu                                         /**< \deprecated (LPMCU_MISC_REGS_SENS_ADC_CH0_DATA) Register MASK  (Use LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_Msk instead)  */
#define LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_Msk 0x7FFu                                         /**< (LPMCU_MISC_REGS_SENS_ADC_CH0_DATA) Register Mask  */

