remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_SENS_ADC_CH1_DATA : (LPMCU_MISC_REGS Offset: 0x1cc) (R/ 16) Current data of the Sensor ADC for Channel 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t SENS_ADC_CH1_DATA:11;      /**< bit:  0..10                                           */
    uint16_t :5;                        /**< bit: 11..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_OFFSET 0x1CC                                         /**<  (LPMCU_MISC_REGS_SENS_ADC_CH1_DATA) Current data of the Sensor ADC for Channel 1  Offset */
#define LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_SENS_ADC_CH1_DATA) Current data of the Sensor ADC for Channel 1  Reset Value */

#define LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_SENS_ADC_CH1_DATA_Pos 0                                              /**< (LPMCU_MISC_REGS_SENS_ADC_CH1_DATA)  Position */
#define LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_SENS_ADC_CH1_DATA_Msk (0x7FFu << LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_SENS_ADC_CH1_DATA_Pos)  /**< (LPMCU_MISC_REGS_SENS_ADC_CH1_DATA)  Mask */
#define LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_SENS_ADC_CH1_DATA(value) (LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_SENS_ADC_CH1_DATA_Msk & ((value) << LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_SENS_ADC_CH1_DATA_Pos))
#define LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_MASK 0x7FFu                                         /**< \deprecated (LPMCU_MISC_REGS_SENS_ADC_CH1_DATA) Register MASK  (Use LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_Msk instead)  */
#define LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_Msk 0x7FFu                                         /**< (LPMCU_MISC_REGS_SENS_ADC_CH1_DATA) Register Mask  */

/* -------- LPMCU_MISC_REGS_SENS_ADC_CH2_DATA : (LPMCU_MISC_REGS Offset: 0x1d0) (R/ 16) Current data of the Sensor ADC for Channel 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t SENS_ADC_CH2_DATA:11;      /**< bit:  0..10                                           */
    uint16_t :5;                        /**< bit: 11..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_OFFSET 0x1D0                                         /**<  (LPMCU_MISC_REGS_SENS_ADC_CH2_DATA) Current data of the Sensor ADC for Channel 2  Offset */
#define LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_SENS_ADC_CH2_DATA) Current data of the Sensor ADC for Channel 2  Reset Value */

#define LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_SENS_ADC_CH2_DATA_Pos 0                                              /**< (LPMCU_MISC_REGS_SENS_ADC_CH2_DATA)  Position */
#define LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_SENS_ADC_CH2_DATA_Msk (0x7FFu << LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_SENS_ADC_CH2_DATA_Pos)  /**< (LPMCU_MISC_REGS_SENS_ADC_CH2_DATA)  Mask */
#define LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_SENS_ADC_CH2_DATA(value) (LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_SENS_ADC_CH2_DATA_Msk & ((value) << LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_SENS_ADC_CH2_DATA_Pos))
#define LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_MASK 0x7FFu                                         /**< \deprecated (LPMCU_MISC_REGS_SENS_ADC_CH2_DATA) Register MASK  (Use LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_Msk instead)  */
#define LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_Msk 0x7FFu                                         /**< (LPMCU_MISC_REGS_SENS_ADC_CH2_DATA) Register Mask  */

/* -------- LPMCU_MISC_REGS_SENS_ADC_CH3_DATA : (LPMCU_MISC_REGS Offset: 0x1d4) (R/ 16) Current data of the Sensor ADC for Channel 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t SENS_ADC_CH3_DATA:11;      /**< bit:  0..10                                           */
    uint16_t :5;                        /**< bit: 11..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_OFFSET 0x1D4                                         /**<  (LPMCU_MISC_REGS_SENS_ADC_CH3_DATA) Current data of the Sensor ADC for Channel 3  Offset */
#define LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_SENS_ADC_CH3_DATA) Current data of the Sensor ADC for Channel 3  Reset Value */

#define LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_SENS_ADC_CH3_DATA_Pos 0                                              /**< (LPMCU_MISC_REGS_SENS_ADC_CH3_DATA)  Position */
#define LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_SENS_ADC_CH3_DATA_Msk (0x7FFu << LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_SENS_ADC_CH3_DATA_Pos)  /**< (LPMCU_MISC_REGS_SENS_ADC_CH3_DATA)  Mask */
#define LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_SENS_ADC_CH3_DATA(value) (LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_SENS_ADC_CH3_DATA_Msk & ((value) << LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_SENS_ADC_CH3_DATA_Pos))
#define LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_MASK 0x7FFu                                         /**< \deprecated (LPMCU_MISC_REGS_SENS_ADC_CH3_DATA) Register MASK  (Use LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_Msk instead)  */
#define LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_Msk 0x7FFu                                         /**< (LPMCU_MISC_REGS_SENS_ADC_CH3_DATA) Register Mask  */

/* -------- LPMCU_MISC_REGS_IRQ_CTRL : (LPMCU_MISC_REGS Offset: 0x1e8) (R/W 16) Configure the IRQ inputs to the system as either Rising Edge or Level Shift -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t BLE_LVL_OSC_EN_IRQ_EN:1;   /**< bit:      0  Enable the OSC_en signal for Level Shift and Clear Mode */
    uint16_t BLE_LVL_OSC_EN_IRQ_CLR:1;  /**< bit:      1  if ble_lvl_osc_en_irq_en is enabled, setting irq clr to 1 will clear the irq request */
    uint16_t BLE_LVL_WAKEUP_LP_IRQ_EN:1;  /**< bit:      2  Enable the wakeup_lp signal for Level Shift and Clear Mode */
    uint16_t BLE_LVL_WAKEUP_LP_IRQ_CLR:1;  /**< bit:      3  if ble_lvl_wakeup_lp_irq_en is enabled, setting irq clr to 1 will clear the irq request */
    uint16_t BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_EN:1;  /**< bit:      4  Enable the lp_out_of_reset signal for Level Shift and Clear Mode */
    uint16_t BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_CLR:1;  /**< bit:      5  if lp_out_of_reset is enabled, setting irq clr to 1 will clear the irq request */
    uint16_t BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_EN:1;  /**< bit:      6  Enable the core_out_of_reset signal for Level Shift and Clear Mode */
    uint16_t BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_CLR:1;  /**< bit:      7  if core_out_of_reset is enabled, setting irq clr to 1 will clear the irq request */
    uint16_t RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_EN:1;  /**< bit:      8  Enable the rxtx_seq_in_sleep signal for Level Shift and Clear Mode */
    uint16_t RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_CLR:1;  /**< bit:      9  if rxtx_seq_in_sleep is enabled, setting irq clr to 1 will clear the irq request */
    uint16_t :6;                        /**< bit: 10..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_IRQ_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_IRQ_CTRL_OFFSET     0x1E8                                         /**<  (LPMCU_MISC_REGS_IRQ_CTRL) Configure the IRQ inputs to the system as either Rising Edge or Level Shift  Offset */
#define LPMCU_MISC_REGS_IRQ_CTRL_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_IRQ_CTRL) Configure the IRQ inputs to the system as either Rising Edge or Level Shift  Reset Value */

