remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_EN_Pos 0                                              /**< (LPMCU_MISC_REGS_IRQ_CTRL) Enable the OSC_en signal for Level Shift and Clear Mode Position */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_EN_Msk (0x1u << LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_EN_Pos)  /**< (LPMCU_MISC_REGS_IRQ_CTRL) Enable the OSC_en signal for Level Shift and Clear Mode Mask */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_EN LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_EN_Msk instead */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_CLR_Pos 1                                              /**< (LPMCU_MISC_REGS_IRQ_CTRL) if ble_lvl_osc_en_irq_en is enabled, setting irq clr to 1 will clear the irq request Position */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_CLR_Msk (0x1u << LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_CLR_Pos)  /**< (LPMCU_MISC_REGS_IRQ_CTRL) if ble_lvl_osc_en_irq_en is enabled, setting irq clr to 1 will clear the irq request Mask */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_CLR LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_CLR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_OSC_EN_IRQ_CLR_Msk instead */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_EN_Pos 2                                              /**< (LPMCU_MISC_REGS_IRQ_CTRL) Enable the wakeup_lp signal for Level Shift and Clear Mode Position */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_EN_Msk (0x1u << LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_EN_Pos)  /**< (LPMCU_MISC_REGS_IRQ_CTRL) Enable the wakeup_lp signal for Level Shift and Clear Mode Mask */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_EN LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_EN_Msk instead */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_CLR_Pos 3                                              /**< (LPMCU_MISC_REGS_IRQ_CTRL) if ble_lvl_wakeup_lp_irq_en is enabled, setting irq clr to 1 will clear the irq request Position */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_CLR_Msk (0x1u << LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_CLR_Pos)  /**< (LPMCU_MISC_REGS_IRQ_CTRL) if ble_lvl_wakeup_lp_irq_en is enabled, setting irq clr to 1 will clear the irq request Mask */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_CLR LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_CLR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_WAKEUP_LP_IRQ_CLR_Msk instead */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_EN_Pos 4                                              /**< (LPMCU_MISC_REGS_IRQ_CTRL) Enable the lp_out_of_reset signal for Level Shift and Clear Mode Position */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_EN_Msk (0x1u << LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_EN_Pos)  /**< (LPMCU_MISC_REGS_IRQ_CTRL) Enable the lp_out_of_reset signal for Level Shift and Clear Mode Mask */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_EN LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_EN_Msk instead */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_CLR_Pos 5                                              /**< (LPMCU_MISC_REGS_IRQ_CTRL) if lp_out_of_reset is enabled, setting irq clr to 1 will clear the irq request Position */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_CLR_Msk (0x1u << LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_CLR_Pos)  /**< (LPMCU_MISC_REGS_IRQ_CTRL) if lp_out_of_reset is enabled, setting irq clr to 1 will clear the irq request Mask */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_CLR LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_CLR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_CLR_Msk instead */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_EN_Pos 6                                              /**< (LPMCU_MISC_REGS_IRQ_CTRL) Enable the core_out_of_reset signal for Level Shift and Clear Mode Position */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_EN_Msk (0x1u << LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_EN_Pos)  /**< (LPMCU_MISC_REGS_IRQ_CTRL) Enable the core_out_of_reset signal for Level Shift and Clear Mode Mask */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_EN LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_EN_Msk instead */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_CLR_Pos 7                                              /**< (LPMCU_MISC_REGS_IRQ_CTRL) if core_out_of_reset is enabled, setting irq clr to 1 will clear the irq request Position */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_CLR_Msk (0x1u << LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_CLR_Pos)  /**< (LPMCU_MISC_REGS_IRQ_CTRL) if core_out_of_reset is enabled, setting irq clr to 1 will clear the irq request Mask */
#define LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_CLR LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_CLR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_CTRL_BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_CLR_Msk instead */
#define LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_EN_Pos 8                                              /**< (LPMCU_MISC_REGS_IRQ_CTRL) Enable the rxtx_seq_in_sleep signal for Level Shift and Clear Mode Position */
#define LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_EN_Msk (0x1u << LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_EN_Pos)  /**< (LPMCU_MISC_REGS_IRQ_CTRL) Enable the rxtx_seq_in_sleep signal for Level Shift and Clear Mode Mask */
#define LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_EN LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_EN_Msk instead */
#define LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_CLR_Pos 9                                              /**< (LPMCU_MISC_REGS_IRQ_CTRL) if rxtx_seq_in_sleep is enabled, setting irq clr to 1 will clear the irq request Position */
#define LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_CLR_Msk (0x1u << LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_CLR_Pos)  /**< (LPMCU_MISC_REGS_IRQ_CTRL) if rxtx_seq_in_sleep is enabled, setting irq clr to 1 will clear the irq request Mask */
#define LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_CLR LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_CLR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_CTRL_RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_CLR_Msk instead */
#define LPMCU_MISC_REGS_IRQ_CTRL_MASK       0x3FFu                                         /**< \deprecated (LPMCU_MISC_REGS_IRQ_CTRL) Register MASK  (Use LPMCU_MISC_REGS_IRQ_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_IRQ_CTRL_Msk        0x3FFu                                         /**< (LPMCU_MISC_REGS_IRQ_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_IRQ_STS : (LPMCU_MISC_REGS Offset: 0x1ec) (R/ 8) Read the raw (no level or rise detect) IRQ inputs to the system from the designated cores -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  BLE_OSC_EN_IRQ:1;          /**< bit:      0  Read the OSC_en signal from the lp core  */
    uint8_t  BLE_WAKEUP_LP_IRQ:1;       /**< bit:      1  Read the wakeup_lp_irq signal from the lp core */
    uint8_t  BLE_LP_OUT_OF_RESET_IRQ:1;  /**< bit:      2  Read the ble_lp_out_of_reset signal from the ble lp core */
    uint8_t  BLE_CORE_OUT_OF_RESET_IRQ_EN:1;  /**< bit:      3  Read the ble_core_out_of_reset_irq signal from the ble core */
    uint8_t  EFUSE_OUT_OF_RESET:1;      /**< bit:      4  Read the efuse_out_of_reset signal from the efuse wrapper */
    uint8_t  :3;                        /**< bit:   5..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_IRQ_STS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

