remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_IRQ_STS_OFFSET      0x1EC                                         /**<  (LPMCU_MISC_REGS_IRQ_STS) Read the raw (no level or rise detect) IRQ inputs to the system from the designated cores  Offset */
#define LPMCU_MISC_REGS_IRQ_STS_RESETVALUE  0x00u                                         /**<  (LPMCU_MISC_REGS_IRQ_STS) Read the raw (no level or rise detect) IRQ inputs to the system from the designated cores  Reset Value */

#define LPMCU_MISC_REGS_IRQ_STS_BLE_OSC_EN_IRQ_Pos 0                                              /**< (LPMCU_MISC_REGS_IRQ_STS) Read the OSC_en signal from the lp core Position */
#define LPMCU_MISC_REGS_IRQ_STS_BLE_OSC_EN_IRQ_Msk (0x1u << LPMCU_MISC_REGS_IRQ_STS_BLE_OSC_EN_IRQ_Pos)  /**< (LPMCU_MISC_REGS_IRQ_STS) Read the OSC_en signal from the lp core Mask */
#define LPMCU_MISC_REGS_IRQ_STS_BLE_OSC_EN_IRQ LPMCU_MISC_REGS_IRQ_STS_BLE_OSC_EN_IRQ_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_STS_BLE_OSC_EN_IRQ_Msk instead */
#define LPMCU_MISC_REGS_IRQ_STS_BLE_WAKEUP_LP_IRQ_Pos 1                                              /**< (LPMCU_MISC_REGS_IRQ_STS) Read the wakeup_lp_irq signal from the lp core Position */
#define LPMCU_MISC_REGS_IRQ_STS_BLE_WAKEUP_LP_IRQ_Msk (0x1u << LPMCU_MISC_REGS_IRQ_STS_BLE_WAKEUP_LP_IRQ_Pos)  /**< (LPMCU_MISC_REGS_IRQ_STS) Read the wakeup_lp_irq signal from the lp core Mask */
#define LPMCU_MISC_REGS_IRQ_STS_BLE_WAKEUP_LP_IRQ LPMCU_MISC_REGS_IRQ_STS_BLE_WAKEUP_LP_IRQ_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_STS_BLE_WAKEUP_LP_IRQ_Msk instead */
#define LPMCU_MISC_REGS_IRQ_STS_BLE_LP_OUT_OF_RESET_IRQ_Pos 2                                              /**< (LPMCU_MISC_REGS_IRQ_STS) Read the ble_lp_out_of_reset signal from the ble lp core Position */
#define LPMCU_MISC_REGS_IRQ_STS_BLE_LP_OUT_OF_RESET_IRQ_Msk (0x1u << LPMCU_MISC_REGS_IRQ_STS_BLE_LP_OUT_OF_RESET_IRQ_Pos)  /**< (LPMCU_MISC_REGS_IRQ_STS) Read the ble_lp_out_of_reset signal from the ble lp core Mask */
#define LPMCU_MISC_REGS_IRQ_STS_BLE_LP_OUT_OF_RESET_IRQ LPMCU_MISC_REGS_IRQ_STS_BLE_LP_OUT_OF_RESET_IRQ_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_STS_BLE_LP_OUT_OF_RESET_IRQ_Msk instead */
#define LPMCU_MISC_REGS_IRQ_STS_BLE_CORE_OUT_OF_RESET_IRQ_EN_Pos 3                                              /**< (LPMCU_MISC_REGS_IRQ_STS) Read the ble_core_out_of_reset_irq signal from the ble core Position */
#define LPMCU_MISC_REGS_IRQ_STS_BLE_CORE_OUT_OF_RESET_IRQ_EN_Msk (0x1u << LPMCU_MISC_REGS_IRQ_STS_BLE_CORE_OUT_OF_RESET_IRQ_EN_Pos)  /**< (LPMCU_MISC_REGS_IRQ_STS) Read the ble_core_out_of_reset_irq signal from the ble core Mask */
#define LPMCU_MISC_REGS_IRQ_STS_BLE_CORE_OUT_OF_RESET_IRQ_EN LPMCU_MISC_REGS_IRQ_STS_BLE_CORE_OUT_OF_RESET_IRQ_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_STS_BLE_CORE_OUT_OF_RESET_IRQ_EN_Msk instead */
#define LPMCU_MISC_REGS_IRQ_STS_EFUSE_OUT_OF_RESET_Pos 4                                              /**< (LPMCU_MISC_REGS_IRQ_STS) Read the efuse_out_of_reset signal from the efuse wrapper Position */
#define LPMCU_MISC_REGS_IRQ_STS_EFUSE_OUT_OF_RESET_Msk (0x1u << LPMCU_MISC_REGS_IRQ_STS_EFUSE_OUT_OF_RESET_Pos)  /**< (LPMCU_MISC_REGS_IRQ_STS) Read the efuse_out_of_reset signal from the efuse wrapper Mask */
#define LPMCU_MISC_REGS_IRQ_STS_EFUSE_OUT_OF_RESET LPMCU_MISC_REGS_IRQ_STS_EFUSE_OUT_OF_RESET_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_IRQ_STS_EFUSE_OUT_OF_RESET_Msk instead */
#define LPMCU_MISC_REGS_IRQ_STS_MASK        0x1Fu                                          /**< \deprecated (LPMCU_MISC_REGS_IRQ_STS) Register MASK  (Use LPMCU_MISC_REGS_IRQ_STS_Msk instead)  */
#define LPMCU_MISC_REGS_IRQ_STS_Msk         0x1Fu                                          /**< (LPMCU_MISC_REGS_IRQ_STS) Register Mask  */

/* -------- LPMCU_MISC_REGS_MSEMI_MEM_CTRL : (LPMCU_MISC_REGS Offset: 0x200) (R/W 32) Control the rwm, rm and wm on the Mobile Semi Memories -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t PD2A_MEM_RWM_EN:1;         /**< bit:      0  RWM control for pd2a memory              */
    uint32_t PD2A_MEM_WM_EN:1;          /**< bit:      1  WM control for pd2a memory               */
    uint32_t PD2A_MEM_RM_EN:1;          /**< bit:      2  RM control for pd2a memory               */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t PD2B_MEM_RWM_EN:1;         /**< bit:      4  RWM control for pd2b memory              */
    uint32_t PD2B_MEM_WM_EN:1;          /**< bit:      5  WM control for pd2b memory               */
    uint32_t PD2B_MEM_RM_EN:1;          /**< bit:      6  RM control for pd2b memory               */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t PD3A_MEM_RWM_EN:1;         /**< bit:      8  RWM control for pd3a memory              */
    uint32_t PD3A_MEM_WM_EN:1;          /**< bit:      9  WM control for pd3a memory               */
    uint32_t PD3A_MEM_RM_EN:1;          /**< bit:     10  RM control for pd3a memory               */
    uint32_t :1;                        /**< bit:     11  Reserved */
    uint32_t PD3B_MEM_RWM_EN:1;         /**< bit:     12  RWM control for pd3b memory              */
    uint32_t PD3B_MEM_WM_EN:1;          /**< bit:     13  WM control for pd3b memory               */
    uint32_t PD3B_MEM_RM_EN:1;          /**< bit:     14  RM control for pd3b memory               */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t PD3C_MEM_RWM_EN:1;         /**< bit:     16  RWM control for pd3c memory              */
    uint32_t PD3C_MEM_WM_EN:1;          /**< bit:     17  WM control for pd3c memory               */
    uint32_t PD3C_MEM_RM_EN:1;          /**< bit:     18  RM control for pd3c memory               */
    uint32_t :1;                        /**< bit:     19  Reserved */
    uint32_t PD5_MEM_RWM_EN:1;          /**< bit:     20  RWM control for pd5 memory               */
    uint32_t PD5_MEM_WM_EN:1;           /**< bit:     21  WM control for pd5 memory                */
    uint32_t PD5_MEM_RM_EN:1;           /**< bit:     22  RM control for pd5 memory                */
    uint32_t :1;                        /**< bit:     23  Reserved */
    uint32_t PD8_MEM_RWM_EN:1;          /**< bit:     24  RWM control for pd8 memory               */
    uint32_t PD8_MEM_WM_EN:1;           /**< bit:     25  WM control for pd8 memory                */
    uint32_t PD8_MEM_RM_EN:1;           /**< bit:     26  RM control for pd8 memory                */
    uint32_t :5;                        /**< bit: 27..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_MSEMI_MEM_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_OFFSET 0x200                                         /**<  (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) Control the rwm, rm and wm on the Mobile Semi Memories  Offset */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) Control the rwm, rm and wm on the Mobile Semi Memories  Reset Value */

#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RWM_EN_Pos 0                                              /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd2a memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RWM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RWM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd2a memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RWM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RWM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RWM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_WM_EN_Pos 1                                              /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd2a memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_WM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_WM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd2a memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_WM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_WM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_WM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RM_EN_Pos 2                                              /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd2a memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd2a memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2A_MEM_RM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RWM_EN_Pos 4                                              /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd2b memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RWM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RWM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd2b memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RWM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RWM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RWM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_WM_EN_Pos 5                                              /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd2b memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_WM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_WM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd2b memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_WM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_WM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_WM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RM_EN_Pos 6                                              /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd2b memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd2b memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD2B_MEM_RM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RWM_EN_Pos 8                                              /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd3a memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RWM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RWM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd3a memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RWM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RWM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RWM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_WM_EN_Pos 9                                              /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd3a memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_WM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_WM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd3a memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_WM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_WM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_WM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RM_EN_Pos 10                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd3a memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd3a memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3A_MEM_RM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RWM_EN_Pos 12                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd3b memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RWM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RWM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd3b memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RWM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RWM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RWM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_WM_EN_Pos 13                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd3b memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_WM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_WM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd3b memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_WM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_WM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_WM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RM_EN_Pos 14                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd3b memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd3b memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3B_MEM_RM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RWM_EN_Pos 16                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd3c memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RWM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RWM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd3c memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RWM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RWM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RWM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_WM_EN_Pos 17                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd3c memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_WM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_WM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd3c memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_WM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_WM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_WM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RM_EN_Pos 18                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd3c memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd3c memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD3C_MEM_RM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RWM_EN_Pos 20                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd5 memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RWM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RWM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd5 memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RWM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RWM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RWM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_WM_EN_Pos 21                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd5 memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_WM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_WM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd5 memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_WM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_WM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_WM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RM_EN_Pos 22                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd5 memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd5 memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD5_MEM_RM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RWM_EN_Pos 24                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd8 memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RWM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RWM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RWM control for pd8 memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RWM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RWM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RWM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_WM_EN_Pos 25                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd8 memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_WM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_WM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) WM control for pd8 memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_WM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_WM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_WM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RM_EN_Pos 26                                             /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd8 memory Position */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RM_EN_Msk (0x1u << LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RM_EN_Pos)  /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) RM control for pd8 memory Mask */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RM_EN LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RM_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_PD8_MEM_RM_EN_Msk instead */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_MASK 0x7777777u                                     /**< \deprecated (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) Register MASK  (Use LPMCU_MISC_REGS_MSEMI_MEM_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_MSEMI_MEM_CTRL_Msk  0x7777777u                                     /**< (LPMCU_MISC_REGS_MSEMI_MEM_CTRL) Register Mask  */

