remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_EFUSE_1_STATUS_3 : (LPMCU_MISC_REGS Offset: 0x204) (R/W 32) EFUSE_1_3 Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EFUSE_1_STATUS_3:32;       /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_EFUSE_1_STATUS_3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_EFUSE_1_STATUS_3_OFFSET 0x204                                         /**<  (LPMCU_MISC_REGS_EFUSE_1_STATUS_3) EFUSE_1_3 Status  Offset */
#define LPMCU_MISC_REGS_EFUSE_1_STATUS_3_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_EFUSE_1_STATUS_3) EFUSE_1_3 Status  Reset Value */

#define LPMCU_MISC_REGS_EFUSE_1_STATUS_3_EFUSE_1_STATUS_3_Pos 0                                              /**< (LPMCU_MISC_REGS_EFUSE_1_STATUS_3)  Position */
#define LPMCU_MISC_REGS_EFUSE_1_STATUS_3_EFUSE_1_STATUS_3_Msk (0xFFFFFFFFu << LPMCU_MISC_REGS_EFUSE_1_STATUS_3_EFUSE_1_STATUS_3_Pos)  /**< (LPMCU_MISC_REGS_EFUSE_1_STATUS_3)  Mask */
#define LPMCU_MISC_REGS_EFUSE_1_STATUS_3_EFUSE_1_STATUS_3(value) (LPMCU_MISC_REGS_EFUSE_1_STATUS_3_EFUSE_1_STATUS_3_Msk & ((value) << LPMCU_MISC_REGS_EFUSE_1_STATUS_3_EFUSE_1_STATUS_3_Pos))
#define LPMCU_MISC_REGS_EFUSE_1_STATUS_3_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_EFUSE_1_STATUS_3) Register MASK  (Use LPMCU_MISC_REGS_EFUSE_1_STATUS_3_Msk instead)  */
#define LPMCU_MISC_REGS_EFUSE_1_STATUS_3_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_EFUSE_1_STATUS_3) Register Mask  */

/* -------- LPMCU_MISC_REGS_LPMCU_FORCE_CTRL : (LPMCU_MISC_REGS Offset: 0x210) (R/W 16) Miscellaneous Force control values for LPMCU -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t SCLK_EN:1;                 /**< bit:      0  Enable Force Control of SCLK             */
    uint16_t SCLK_VAL:1;                /**< bit:      1  Enable Force Control of SCLK Value       */
    uint16_t DCLK_EN:1;                 /**< bit:      2  Enable Force Control of DCLK             */
    uint16_t DCLK_VAL:1;                /**< bit:      3  Enable Force Control of DCLK Value       */
    uint16_t PCLKG_EN:1;                /**< bit:      4  Enable Force Control of PCLKG            */
    uint16_t PCLKG_VAL:1;               /**< bit:      5  Enable Force Control of PCLKG Value      */
    uint16_t WICENREQ_EN:1;             /**< bit:      6  Enable Force Control of WIC Enable Request to use WIC during Sleep Conditions */
    uint16_t WICENREQ_VAL:1;            /**< bit:      7  Enable Force Control of WIC Enable Value */
    uint16_t GPIO_GCLK_EN:1;            /**< bit:      8  Enable Force Control of GPIO Modules Clk (override clock gating and enable) */
    uint16_t COUNTER_PGCLK_EN:1;        /**< bit:      9  Enable Force Control of Counter Modules Clk (override clock gating and enable) */
    uint16_t DUALTIMER_PGCLK_EN:1;      /**< bit:     10  Enable Force Control of DualTimer Modules PGClk (override clock gating and enable) */
    uint16_t WICENACK_EN:1;             /**< bit:     11  Enable Force Control of WIC ACK to use WIC during Sleep Conditions - Requires Handshake from WIC when its ok to sleep */
    uint16_t WICENACK_VAL:1;            /**< bit:     12  Enable Force Control of WIC Enable Value - Requires Handshake from WIC when its ok to sleep */
    uint16_t :3;                        /**< bit: 13..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_OFFSET 0x210                                         /**<  (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Miscellaneous Force control values for LPMCU  Offset */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_RESETVALUE 0xF7Fu                                        /**<  (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Miscellaneous Force control values for LPMCU  Reset Value */

#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_EN_Pos 0                                              /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of SCLK Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of SCLK Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_EN LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_EN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_VAL_Pos 1                                              /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of SCLK Value Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_VAL_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_VAL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of SCLK Value Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_VAL LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_VAL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_SCLK_VAL_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_EN_Pos 2                                              /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of DCLK Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of DCLK Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_EN LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_EN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_VAL_Pos 3                                              /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of DCLK Value Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_VAL_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_VAL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of DCLK Value Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_VAL LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_VAL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DCLK_VAL_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_EN_Pos 4                                              /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of PCLKG Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of PCLKG Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_EN LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_VAL_Pos 5                                              /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of PCLKG Value Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_VAL_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_VAL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of PCLKG Value Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_VAL LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_VAL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_PCLKG_VAL_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_EN_Pos 6                                              /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of WIC Enable Request to use WIC during Sleep Conditions Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of WIC Enable Request to use WIC during Sleep Conditions Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_EN LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_VAL_Pos 7                                              /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of WIC Enable Value Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_VAL_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_VAL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of WIC Enable Value Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_VAL LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_VAL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENREQ_VAL_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_GPIO_GCLK_EN_Pos 8                                              /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of GPIO Modules Clk (override clock gating and enable) Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_GPIO_GCLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_GPIO_GCLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of GPIO Modules Clk (override clock gating and enable) Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_GPIO_GCLK_EN LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_GPIO_GCLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_GPIO_GCLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_COUNTER_PGCLK_EN_Pos 9                                              /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of Counter Modules Clk (override clock gating and enable) Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_COUNTER_PGCLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_COUNTER_PGCLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of Counter Modules Clk (override clock gating and enable) Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_COUNTER_PGCLK_EN LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_COUNTER_PGCLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_COUNTER_PGCLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DUALTIMER_PGCLK_EN_Pos 10                                             /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of DualTimer Modules PGClk (override clock gating and enable) Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DUALTIMER_PGCLK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DUALTIMER_PGCLK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of DualTimer Modules PGClk (override clock gating and enable) Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DUALTIMER_PGCLK_EN LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DUALTIMER_PGCLK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_DUALTIMER_PGCLK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_EN_Pos 11                                             /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of WIC ACK to use WIC during Sleep Conditions - Requires Handshake from WIC when its ok to sleep Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_EN_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_EN_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of WIC ACK to use WIC during Sleep Conditions - Requires Handshake from WIC when its ok to sleep Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_EN LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_EN_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_VAL_Pos 12                                             /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of WIC Enable Value - Requires Handshake from WIC when its ok to sleep Position */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_VAL_Msk (0x1u << LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_VAL_Pos)  /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Enable Force Control of WIC Enable Value - Requires Handshake from WIC when its ok to sleep Mask */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_VAL LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_VAL_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_WICENACK_VAL_Msk instead */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_MASK 0x1FFFu                                        /**< \deprecated (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Register MASK  (Use LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_Msk 0x1FFFu                                        /**< (LPMCU_MISC_REGS_LPMCU_FORCE_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_ARM_IRQ_STATUS_0 : (LPMCU_MISC_REGS Offset: 0x214) (R/ 32) ARM Cortex M0 IRQ Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ARM_IRQ_STATUS_0:32;       /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

