remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_OFFSET 0x214                                         /**<  (LPMCU_MISC_REGS_ARM_IRQ_STATUS_0) ARM Cortex M0 IRQ Status  Offset */
#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_ARM_IRQ_STATUS_0) ARM Cortex M0 IRQ Status  Reset Value */

#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_ARM_IRQ_STATUS_0_Pos 0                                              /**< (LPMCU_MISC_REGS_ARM_IRQ_STATUS_0)  Position */
#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_ARM_IRQ_STATUS_0_Msk (0xFFFFFFFFu << LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_ARM_IRQ_STATUS_0_Pos)  /**< (LPMCU_MISC_REGS_ARM_IRQ_STATUS_0)  Mask */
#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_ARM_IRQ_STATUS_0(value) (LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_ARM_IRQ_STATUS_0_Msk & ((value) << LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_ARM_IRQ_STATUS_0_Pos))
#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_ARM_IRQ_STATUS_0) Register MASK  (Use LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_Msk instead)  */
#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_ARM_IRQ_STATUS_0) Register Mask  */

/* -------- LPMCU_MISC_REGS_ARM_IRQ_STATUS_1 : (LPMCU_MISC_REGS Offset: 0x218) (R/ 32) ARM Cortex M0 IRQ Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ARM_IRQ_STATUS_1:32;       /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_OFFSET 0x218                                         /**<  (LPMCU_MISC_REGS_ARM_IRQ_STATUS_1) ARM Cortex M0 IRQ Status  Offset */
#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_ARM_IRQ_STATUS_1) ARM Cortex M0 IRQ Status  Reset Value */

#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_ARM_IRQ_STATUS_1_Pos 0                                              /**< (LPMCU_MISC_REGS_ARM_IRQ_STATUS_1)  Position */
#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_ARM_IRQ_STATUS_1_Msk (0xFFFFFFFFu << LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_ARM_IRQ_STATUS_1_Pos)  /**< (LPMCU_MISC_REGS_ARM_IRQ_STATUS_1)  Mask */
#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_ARM_IRQ_STATUS_1(value) (LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_ARM_IRQ_STATUS_1_Msk & ((value) << LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_ARM_IRQ_STATUS_1_Pos))
#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_ARM_IRQ_STATUS_1) Register MASK  (Use LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_Msk instead)  */
#define LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_ARM_IRQ_STATUS_1) Register Mask  */

/* -------- LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES : (LPMCU_MISC_REGS Offset: 0x240) (R/W 8) BLE Deep Sleep Enables -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  FW_TIMER_CORR_EN:1;        /**< bit:      0  Enables FW Timer Correction Operation    */
    uint8_t  HW_TIMER_CORR_EN:1;        /**< bit:      1  Enables HW Timer Correction Operation    */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_OFFSET 0x240                                         /**<  (LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES) BLE Deep Sleep Enables  Offset */
#define LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_RESETVALUE 0x01u                                         /**<  (LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES) BLE Deep Sleep Enables  Reset Value */

#define LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_FW_TIMER_CORR_EN_Pos 0                                              /**< (LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES) Enables FW Timer Correction Operation Position */
#define LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_FW_TIMER_CORR_EN_Msk (0x1u << LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_FW_TIMER_CORR_EN_Pos)  /**< (LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES) Enables FW Timer Correction Operation Mask */
#define LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_FW_TIMER_CORR_EN LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_FW_TIMER_CORR_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_FW_TIMER_CORR_EN_Msk instead */
#define LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_HW_TIMER_CORR_EN_Pos 1                                              /**< (LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES) Enables HW Timer Correction Operation Position */
#define LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_HW_TIMER_CORR_EN_Msk (0x1u << LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_HW_TIMER_CORR_EN_Pos)  /**< (LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES) Enables HW Timer Correction Operation Mask */
#define LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_HW_TIMER_CORR_EN LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_HW_TIMER_CORR_EN_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_HW_TIMER_CORR_EN_Msk instead */
#define LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_MASK 0x03u                                          /**< \deprecated (LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES) Register MASK  (Use LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_Msk instead)  */
#define LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_Msk 0x03u                                          /**< (LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES) Register Mask  */

/* -------- LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR : (LPMCU_MISC_REGS Offset: 0x244) (R/W 32) Configures the HW auto correction algorithm of the fine/base timers after wakeup from deep sleep -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WAIT:10;                   /**< bit:   0..9  Wait time in us after wakeup before correction begins */
    uint32_t :2;                        /**< bit: 10..11  Reserved */
    uint32_t RTC_TOSC:18;               /**< bit: 12..29  Period of RTC clock in us [7.11]         */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_OFFSET 0x244                                         /**<  (LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR) Configures the HW auto correction algorithm of the fine/base timers after wakeup from deep sleep  Offset */
#define LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_RESETVALUE 0xF424000u                                    /**<  (LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR) Configures the HW auto correction algorithm of the fine/base timers after wakeup from deep sleep  Reset Value */

