remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_WAIT_Pos 0                                              /**< (LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR) Wait time in us after wakeup before correction begins Position */
#define LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_WAIT_Msk (0x3FFu << LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_WAIT_Pos)  /**< (LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR) Wait time in us after wakeup before correction begins Mask */
#define LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_WAIT(value) (LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_WAIT_Msk & ((value) << LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_WAIT_Pos))
#define LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_RTC_TOSC_Pos 12                                             /**< (LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR) Period of RTC clock in us [7.11] Position */
#define LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_RTC_TOSC_Msk (0x3FFFFu << LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_RTC_TOSC_Pos)  /**< (LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR) Period of RTC clock in us [7.11] Mask */
#define LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_RTC_TOSC(value) (LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_RTC_TOSC_Msk & ((value) << LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_RTC_TOSC_Pos))
#define LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_MASK 0x3FFFF3FFu                                    /**< \deprecated (LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR) Register MASK  (Use LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_Msk instead)  */
#define LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_Msk 0x3FFFF3FFu                                    /**< (LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR) Register Mask  */

/* -------- LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR : (LPMCU_MISC_REGS Offset: 0x254) (R/W 32) ARM Cortex M0 idram 1 remap base addr -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t REMAP_IDRAM1_BASE_ADDR:32;  /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_OFFSET 0x254                                         /**<  (LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR) ARM Cortex M0 idram 1 remap base addr  Offset */
#define LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_RESETVALUE 0x8000u                                       /**<  (LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR) ARM Cortex M0 idram 1 remap base addr  Reset Value */

#define LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_REMAP_IDRAM1_BASE_ADDR_Pos 0                                              /**< (LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR)  Position */
#define LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_REMAP_IDRAM1_BASE_ADDR_Msk (0xFFFFFFFFu << LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_REMAP_IDRAM1_BASE_ADDR_Pos)  /**< (LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR)  Mask */
#define LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_REMAP_IDRAM1_BASE_ADDR(value) (LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_REMAP_IDRAM1_BASE_ADDR_Msk & ((value) << LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_REMAP_IDRAM1_BASE_ADDR_Pos))
#define LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR) Register MASK  (Use LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_Msk instead)  */
#define LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR) Register Mask  */

/* -------- LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR : (LPMCU_MISC_REGS Offset: 0x258) (R/W 32) ARM Cortex M0 idram 1 remap end addr -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t REMAP_IDRAM1_END_ADDR:32;  /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_OFFSET 0x258                                         /**<  (LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR) ARM Cortex M0 idram 1 remap end addr  Offset */
#define LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_RESETVALUE 0x1FFFFu                                      /**<  (LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR) ARM Cortex M0 idram 1 remap end addr  Reset Value */

#define LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_REMAP_IDRAM1_END_ADDR_Pos 0                                              /**< (LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR)  Position */
#define LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_REMAP_IDRAM1_END_ADDR_Msk (0xFFFFFFFFu << LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_REMAP_IDRAM1_END_ADDR_Pos)  /**< (LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR)  Mask */
#define LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_REMAP_IDRAM1_END_ADDR(value) (LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_REMAP_IDRAM1_END_ADDR_Msk & ((value) << LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_REMAP_IDRAM1_END_ADDR_Pos))
#define LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR) Register MASK  (Use LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_Msk instead)  */
#define LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR) Register Mask  */

/* -------- LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR : (LPMCU_MISC_REGS Offset: 0x25c) (R/W 32) ARM Cortex M0 idram 2 remap base addr -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t REMAP_IDRAM2_BASE_ADDR:32;  /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_OFFSET 0x25C                                         /**<  (LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR) ARM Cortex M0 idram 2 remap base addr  Offset */
#define LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR) ARM Cortex M0 idram 2 remap base addr  Reset Value */

