remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_REMAP_IDRAM2_BASE_ADDR_Pos 0                                              /**< (LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR)  Position */
#define LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_REMAP_IDRAM2_BASE_ADDR_Msk (0xFFFFFFFFu << LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_REMAP_IDRAM2_BASE_ADDR_Pos)  /**< (LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR)  Mask */
#define LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_REMAP_IDRAM2_BASE_ADDR(value) (LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_REMAP_IDRAM2_BASE_ADDR_Msk & ((value) << LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_REMAP_IDRAM2_BASE_ADDR_Pos))
#define LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR) Register MASK  (Use LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_Msk instead)  */
#define LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR) Register Mask  */

/* -------- LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR : (LPMCU_MISC_REGS Offset: 0x260) (R/W 32) ARM Cortex M0 idram 2 remap end addr -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t REMAP_IDRAM2_END_ADDR:32;  /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_OFFSET 0x260                                         /**<  (LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR) ARM Cortex M0 idram 2 remap end addr  Offset */
#define LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_RESETVALUE 0x7FFFu                                       /**<  (LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR) ARM Cortex M0 idram 2 remap end addr  Reset Value */

#define LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_REMAP_IDRAM2_END_ADDR_Pos 0                                              /**< (LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR)  Position */
#define LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_REMAP_IDRAM2_END_ADDR_Msk (0xFFFFFFFFu << LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_REMAP_IDRAM2_END_ADDR_Pos)  /**< (LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR)  Mask */
#define LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_REMAP_IDRAM2_END_ADDR(value) (LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_REMAP_IDRAM2_END_ADDR_Msk & ((value) << LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_REMAP_IDRAM2_END_ADDR_Pos))
#define LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR) Register MASK  (Use LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_Msk instead)  */
#define LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR) Register Mask  */

/* -------- LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR : (LPMCU_MISC_REGS Offset: 0x264) (R/W 32) ARM Cortex M0 bootrom remap base addr -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t REMAP_BOOT_BASE_ADDR:32;   /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_OFFSET 0x264                                         /**<  (LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR) ARM Cortex M0 bootrom remap base addr  Offset */
#define LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_RESETVALUE 0x10000000u                                   /**<  (LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR) ARM Cortex M0 bootrom remap base addr  Reset Value */

#define LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_REMAP_BOOT_BASE_ADDR_Pos 0                                              /**< (LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR)  Position */
#define LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_REMAP_BOOT_BASE_ADDR_Msk (0xFFFFFFFFu << LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_REMAP_BOOT_BASE_ADDR_Pos)  /**< (LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR)  Mask */
#define LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_REMAP_BOOT_BASE_ADDR(value) (LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_REMAP_BOOT_BASE_ADDR_Msk & ((value) << LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_REMAP_BOOT_BASE_ADDR_Pos))
#define LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR) Register MASK  (Use LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_Msk instead)  */
#define LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR) Register Mask  */

/* -------- LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR : (LPMCU_MISC_REGS Offset: 0x268) (R/W 32) ARM Cortex M0 bootrom remap end addr -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t REMAP_BOOT_END_ADDR:32;    /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_OFFSET 0x268                                         /**<  (LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR) ARM Cortex M0 bootrom remap end addr  Offset */
#define LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_RESETVALUE 0x1001FFFFu                                   /**<  (LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR) ARM Cortex M0 bootrom remap end addr  Reset Value */

#define LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_REMAP_BOOT_END_ADDR_Pos 0                                              /**< (LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR)  Position */
#define LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_REMAP_BOOT_END_ADDR_Msk (0xFFFFFFFFu << LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_REMAP_BOOT_END_ADDR_Pos)  /**< (LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR)  Mask */
#define LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_REMAP_BOOT_END_ADDR(value) (LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_REMAP_BOOT_END_ADDR_Msk & ((value) << LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_REMAP_BOOT_END_ADDR_Pos))
#define LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR) Register MASK  (Use LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_Msk instead)  */
#define LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR) Register Mask  */

/* -------- LPMCU_MISC_REGS_QUAD_DEC_IRQS : (LPMCU_MISC_REGS Offset: 0x280) (R/ 8) Reflects the IRQ status of the Quad Decoders -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  QUAD_DEC0_IRQ:1;           /**< bit:      0  QUAD_DEC0 Interrupt                      */
    uint8_t  QUAD_DEC1_IRQ:1;           /**< bit:      1  QUAD_DEC1 Interrupt                      */
    uint8_t  QUAD_DEC2_IRQ:1;           /**< bit:      2  QUAD_DEC2 Interrupt                      */
    uint8_t  :5;                        /**< bit:   3..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_QUAD_DEC_IRQS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

