remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_OFFSET 0x280                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC_IRQS) Reflects the IRQ status of the Quad Decoders  Offset */
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC_IRQS) Reflects the IRQ status of the Quad Decoders  Reset Value */

#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC0_IRQ_Pos 0                                              /**< (LPMCU_MISC_REGS_QUAD_DEC_IRQS) QUAD_DEC0 Interrupt Position */
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC0_IRQ_Msk (0x1u << LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC0_IRQ_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC_IRQS) QUAD_DEC0 Interrupt Mask */
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC0_IRQ LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC0_IRQ_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC0_IRQ_Msk instead */
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC1_IRQ_Pos 1                                              /**< (LPMCU_MISC_REGS_QUAD_DEC_IRQS) QUAD_DEC1 Interrupt Position */
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC1_IRQ_Msk (0x1u << LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC1_IRQ_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC_IRQS) QUAD_DEC1 Interrupt Mask */
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC1_IRQ LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC1_IRQ_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC1_IRQ_Msk instead */
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC2_IRQ_Pos 2                                              /**< (LPMCU_MISC_REGS_QUAD_DEC_IRQS) QUAD_DEC2 Interrupt Position */
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC2_IRQ_Msk (0x1u << LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC2_IRQ_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC_IRQS) QUAD_DEC2 Interrupt Mask */
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC2_IRQ LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC2_IRQ_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_QUAD_DEC_IRQS_QUAD_DEC2_IRQ_Msk instead */
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_MASK  0x07u                                          /**< \deprecated (LPMCU_MISC_REGS_QUAD_DEC_IRQS) Register MASK  (Use LPMCU_MISC_REGS_QUAD_DEC_IRQS_Msk instead)  */
#define LPMCU_MISC_REGS_QUAD_DEC_IRQS_Msk   0x07u                                          /**< (LPMCU_MISC_REGS_QUAD_DEC_IRQS) Register Mask  */

/* -------- LPMCU_MISC_REGS_QUAD_DEC0_STATUS : (LPMCU_MISC_REGS Offset: 0x284) (R/ 16) Current status of QUAD_DEC0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t COUNT:16;                  /**< bit:  0..15  Current count of QUAD_DEC0               */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_QUAD_DEC0_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_QUAD_DEC0_STATUS_OFFSET 0x284                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC0_STATUS) Current status of QUAD_DEC0  Offset */
#define LPMCU_MISC_REGS_QUAD_DEC0_STATUS_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC0_STATUS) Current status of QUAD_DEC0  Reset Value */

#define LPMCU_MISC_REGS_QUAD_DEC0_STATUS_COUNT_Pos 0                                              /**< (LPMCU_MISC_REGS_QUAD_DEC0_STATUS) Current count of QUAD_DEC0 Position */
#define LPMCU_MISC_REGS_QUAD_DEC0_STATUS_COUNT_Msk (0xFFFFu << LPMCU_MISC_REGS_QUAD_DEC0_STATUS_COUNT_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC0_STATUS) Current count of QUAD_DEC0 Mask */
#define LPMCU_MISC_REGS_QUAD_DEC0_STATUS_COUNT(value) (LPMCU_MISC_REGS_QUAD_DEC0_STATUS_COUNT_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC0_STATUS_COUNT_Pos))
#define LPMCU_MISC_REGS_QUAD_DEC0_STATUS_MASK 0xFFFFu                                        /**< \deprecated (LPMCU_MISC_REGS_QUAD_DEC0_STATUS) Register MASK  (Use LPMCU_MISC_REGS_QUAD_DEC0_STATUS_Msk instead)  */
#define LPMCU_MISC_REGS_QUAD_DEC0_STATUS_Msk 0xFFFFu                                        /**< (LPMCU_MISC_REGS_QUAD_DEC0_STATUS) Register Mask  */

/* -------- LPMCU_MISC_REGS_QUAD_DEC1_STATUS : (LPMCU_MISC_REGS Offset: 0x288) (R/ 16) Current status of QUAD_DEC1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t COUNT:16;                  /**< bit:  0..15  Current count of QUAD_DEC1               */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_QUAD_DEC1_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_QUAD_DEC1_STATUS_OFFSET 0x288                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC1_STATUS) Current status of QUAD_DEC1  Offset */
#define LPMCU_MISC_REGS_QUAD_DEC1_STATUS_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC1_STATUS) Current status of QUAD_DEC1  Reset Value */

#define LPMCU_MISC_REGS_QUAD_DEC1_STATUS_COUNT_Pos 0                                              /**< (LPMCU_MISC_REGS_QUAD_DEC1_STATUS) Current count of QUAD_DEC1 Position */
#define LPMCU_MISC_REGS_QUAD_DEC1_STATUS_COUNT_Msk (0xFFFFu << LPMCU_MISC_REGS_QUAD_DEC1_STATUS_COUNT_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC1_STATUS) Current count of QUAD_DEC1 Mask */
#define LPMCU_MISC_REGS_QUAD_DEC1_STATUS_COUNT(value) (LPMCU_MISC_REGS_QUAD_DEC1_STATUS_COUNT_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC1_STATUS_COUNT_Pos))
#define LPMCU_MISC_REGS_QUAD_DEC1_STATUS_MASK 0xFFFFu                                        /**< \deprecated (LPMCU_MISC_REGS_QUAD_DEC1_STATUS) Register MASK  (Use LPMCU_MISC_REGS_QUAD_DEC1_STATUS_Msk instead)  */
#define LPMCU_MISC_REGS_QUAD_DEC1_STATUS_Msk 0xFFFFu                                        /**< (LPMCU_MISC_REGS_QUAD_DEC1_STATUS) Register Mask  */

/* -------- LPMCU_MISC_REGS_QUAD_DEC2_STATUS : (LPMCU_MISC_REGS Offset: 0x28c) (R/ 16) Current status of QUAD_DEC2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t COUNT:16;                  /**< bit:  0..15  Current count of QUAD_DEC2               */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_QUAD_DEC2_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_QUAD_DEC2_STATUS_OFFSET 0x28C                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC2_STATUS) Current status of QUAD_DEC2  Offset */
#define LPMCU_MISC_REGS_QUAD_DEC2_STATUS_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC2_STATUS) Current status of QUAD_DEC2  Reset Value */

#define LPMCU_MISC_REGS_QUAD_DEC2_STATUS_COUNT_Pos 0                                              /**< (LPMCU_MISC_REGS_QUAD_DEC2_STATUS) Current count of QUAD_DEC2 Position */
#define LPMCU_MISC_REGS_QUAD_DEC2_STATUS_COUNT_Msk (0xFFFFu << LPMCU_MISC_REGS_QUAD_DEC2_STATUS_COUNT_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC2_STATUS) Current count of QUAD_DEC2 Mask */
#define LPMCU_MISC_REGS_QUAD_DEC2_STATUS_COUNT(value) (LPMCU_MISC_REGS_QUAD_DEC2_STATUS_COUNT_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC2_STATUS_COUNT_Pos))
#define LPMCU_MISC_REGS_QUAD_DEC2_STATUS_MASK 0xFFFFu                                        /**< \deprecated (LPMCU_MISC_REGS_QUAD_DEC2_STATUS) Register MASK  (Use LPMCU_MISC_REGS_QUAD_DEC2_STATUS_Msk instead)  */
#define LPMCU_MISC_REGS_QUAD_DEC2_STATUS_Msk 0xFFFFu                                        /**< (LPMCU_MISC_REGS_QUAD_DEC2_STATUS) Register Mask  */

