remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD : (LPMCU_MISC_REGS Offset: 0x290) (R/W 32) Thresholds for QUAD_DEC0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t UPPER:16;                  /**< bit:  0..15  Upper Threshold of counter for QUAD_DEC0 */
    uint32_t LOWER:16;                  /**< bit: 16..31  Lower Threshold of counter for QUAD_DEC0 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_OFFSET 0x290                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD) Thresholds for QUAD_DEC0  Offset */
#define LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_RESETVALUE 0xFFFF00u                                     /**<  (LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD) Thresholds for QUAD_DEC0  Reset Value */

#define LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_UPPER_Pos 0                                              /**< (LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD) Upper Threshold of counter for QUAD_DEC0 Position */
#define LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_UPPER_Msk (0xFFFFu << LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_UPPER_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD) Upper Threshold of counter for QUAD_DEC0 Mask */
#define LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_UPPER(value) (LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_UPPER_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_UPPER_Pos))
#define LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_LOWER_Pos 16                                             /**< (LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD) Lower Threshold of counter for QUAD_DEC0 Position */
#define LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_LOWER_Msk (0xFFFFu << LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_LOWER_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD) Lower Threshold of counter for QUAD_DEC0 Mask */
#define LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_LOWER(value) (LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_LOWER_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_LOWER_Pos))
#define LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD) Register MASK  (Use LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_Msk instead)  */
#define LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD) Register Mask  */

/* -------- LPMCU_MISC_REGS_QUAD_DEC0_CTRL : (LPMCU_MISC_REGS Offset: 0x294) (R/W 8) Control for QUAD_DEC0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ENABLE:1;                  /**< bit:      0  Enable Quad Decoder                      */
    uint8_t  CLR_IRQ:1;                 /**< bit:      1  Clear IRQ From Quad Decoder              */
    uint8_t  CLOCK_SEL:2;               /**< bit:   2..3  Quad Decoder Source Clock Frequency Select */
    uint8_t  :4;                        /**< bit:   4..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_QUAD_DEC0_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_OFFSET 0x294                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) Control for QUAD_DEC0  Offset */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) Control for QUAD_DEC0  Reset Value */

#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_ENABLE_Pos 0                                              /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) Enable Quad Decoder Position */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_QUAD_DEC0_CTRL_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) Enable Quad Decoder Mask */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_ENABLE LPMCU_MISC_REGS_QUAD_DEC0_CTRL_ENABLE_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_QUAD_DEC0_CTRL_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLR_IRQ_Pos 1                                              /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) Clear IRQ From Quad Decoder Position */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLR_IRQ_Msk (0x1u << LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLR_IRQ_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) Clear IRQ From Quad Decoder Mask */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLR_IRQ LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLR_IRQ_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLR_IRQ_Msk instead */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_Pos 2                                              /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) Quad Decoder Source Clock Frequency Select Position */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_Msk (0x3u << LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) Quad Decoder Source Clock Frequency Select Mask */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL(value) (LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_Pos))
#define   LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) 26MHz  */
#define   LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) 13MHz  */
#define   LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) 6.5MHz  */
#define   LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) 3.25MHz  */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_0 (LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_0_Val << LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) 26MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_1 (LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_1_Val << LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) 13MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_2 (LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_2_Val << LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) 6.5MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_3 (LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_3_Val << LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) 3.25MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_MASK 0x0Fu                                          /**< \deprecated (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) Register MASK  (Use LPMCU_MISC_REGS_QUAD_DEC0_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_QUAD_DEC0_CTRL_Msk  0x0Fu                                          /**< (LPMCU_MISC_REGS_QUAD_DEC0_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD : (LPMCU_MISC_REGS Offset: 0x2a0) (R/W 32) Thresholds for QUAD_DEC1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t UPPER:16;                  /**< bit:  0..15  Upper Threshold of counter for QUAD_DEC1 */
    uint32_t LOWER:16;                  /**< bit: 16..31  Lower Threshold of counter for QUAD_DEC1 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_OFFSET 0x2A0                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD) Thresholds for QUAD_DEC1  Offset */
#define LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_RESETVALUE 0xFFFF00u                                     /**<  (LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD) Thresholds for QUAD_DEC1  Reset Value */

#define LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_UPPER_Pos 0                                              /**< (LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD) Upper Threshold of counter for QUAD_DEC1 Position */
#define LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_UPPER_Msk (0xFFFFu << LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_UPPER_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD) Upper Threshold of counter for QUAD_DEC1 Mask */
#define LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_UPPER(value) (LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_UPPER_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_UPPER_Pos))
#define LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_LOWER_Pos 16                                             /**< (LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD) Lower Threshold of counter for QUAD_DEC1 Position */
#define LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_LOWER_Msk (0xFFFFu << LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_LOWER_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD) Lower Threshold of counter for QUAD_DEC1 Mask */
#define LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_LOWER(value) (LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_LOWER_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_LOWER_Pos))
#define LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD) Register MASK  (Use LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_Msk instead)  */
#define LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD) Register Mask  */

/* -------- LPMCU_MISC_REGS_QUAD_DEC1_CTRL : (LPMCU_MISC_REGS Offset: 0x2a4) (R/W 8) Control for QUAD_DEC1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ENABLE:1;                  /**< bit:      0  Enable Quad Decoder                      */
    uint8_t  CLR_IRQ:1;                 /**< bit:      1  Clear IRQ From Quad Decoder              */
    uint8_t  CLOCK_SEL:2;               /**< bit:   2..3  Quad Decoder Source Clock Frequency Select */
    uint8_t  :4;                        /**< bit:   4..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_QUAD_DEC1_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_OFFSET 0x2A4                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) Control for QUAD_DEC1  Offset */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) Control for QUAD_DEC1  Reset Value */

#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_ENABLE_Pos 0                                              /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) Enable Quad Decoder Position */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_QUAD_DEC1_CTRL_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) Enable Quad Decoder Mask */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_ENABLE LPMCU_MISC_REGS_QUAD_DEC1_CTRL_ENABLE_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_QUAD_DEC1_CTRL_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLR_IRQ_Pos 1                                              /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) Clear IRQ From Quad Decoder Position */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLR_IRQ_Msk (0x1u << LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLR_IRQ_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) Clear IRQ From Quad Decoder Mask */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLR_IRQ LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLR_IRQ_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLR_IRQ_Msk instead */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_Pos 2                                              /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) Quad Decoder Source Clock Frequency Select Position */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_Msk (0x3u << LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) Quad Decoder Source Clock Frequency Select Mask */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL(value) (LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_Pos))
#define   LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) 26MHz  */
#define   LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) 13MHz  */
#define   LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) 6.5MHz  */
#define   LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) 3.25MHz  */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_0 (LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_0_Val << LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) 26MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_1 (LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_1_Val << LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) 13MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_2 (LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_2_Val << LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) 6.5MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_3 (LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_3_Val << LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) 3.25MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_MASK 0x0Fu                                          /**< \deprecated (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) Register MASK  (Use LPMCU_MISC_REGS_QUAD_DEC1_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_QUAD_DEC1_CTRL_Msk  0x0Fu                                          /**< (LPMCU_MISC_REGS_QUAD_DEC1_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD : (LPMCU_MISC_REGS Offset: 0x2b0) (R/W 32) Thresholds for QUAD_DEC2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t UPPER:16;                  /**< bit:  0..15  Upper Threshold of counter for QUAD_DEC2 */
    uint32_t LOWER:16;                  /**< bit: 16..31  Lower Threshold of counter for QUAD_DEC2 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_OFFSET 0x2B0                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD) Thresholds for QUAD_DEC2  Offset */
#define LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_RESETVALUE 0xFFFF00u                                     /**<  (LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD) Thresholds for QUAD_DEC2  Reset Value */

#define LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_UPPER_Pos 0                                              /**< (LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD) Upper Threshold of counter for QUAD_DEC2 Position */
#define LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_UPPER_Msk (0xFFFFu << LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_UPPER_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD) Upper Threshold of counter for QUAD_DEC2 Mask */
#define LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_UPPER(value) (LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_UPPER_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_UPPER_Pos))
#define LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_LOWER_Pos 16                                             /**< (LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD) Lower Threshold of counter for QUAD_DEC2 Position */
#define LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_LOWER_Msk (0xFFFFu << LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_LOWER_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD) Lower Threshold of counter for QUAD_DEC2 Mask */
#define LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_LOWER(value) (LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_LOWER_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_LOWER_Pos))
#define LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD) Register MASK  (Use LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_Msk instead)  */
#define LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD) Register Mask  */

/* -------- LPMCU_MISC_REGS_QUAD_DEC2_CTRL : (LPMCU_MISC_REGS Offset: 0x2b4) (R/W 8) Control for QUAD_DEC2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ENABLE:1;                  /**< bit:      0  Enable Quad Decoder                      */
    uint8_t  CLR_IRQ:1;                 /**< bit:      1  Clear IRQ From Quad Decoder              */
    uint8_t  CLOCK_SEL:2;               /**< bit:   2..3  Quad Decoder Source Clock Frequency Select */
    uint8_t  :4;                        /**< bit:   4..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_QUAD_DEC2_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_OFFSET 0x2B4                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) Control for QUAD_DEC2  Offset */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) Control for QUAD_DEC2  Reset Value */

#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_ENABLE_Pos 0                                              /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) Enable Quad Decoder Position */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_ENABLE_Msk (0x1u << LPMCU_MISC_REGS_QUAD_DEC2_CTRL_ENABLE_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) Enable Quad Decoder Mask */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_ENABLE LPMCU_MISC_REGS_QUAD_DEC2_CTRL_ENABLE_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_QUAD_DEC2_CTRL_ENABLE_Msk instead */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLR_IRQ_Pos 1                                              /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) Clear IRQ From Quad Decoder Position */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLR_IRQ_Msk (0x1u << LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLR_IRQ_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) Clear IRQ From Quad Decoder Mask */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLR_IRQ LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLR_IRQ_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLR_IRQ_Msk instead */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_Pos 2                                              /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) Quad Decoder Source Clock Frequency Select Position */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_Msk (0x3u << LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) Quad Decoder Source Clock Frequency Select Mask */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL(value) (LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_Msk & ((value) << LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_Pos))
#define   LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_0_Val 0x0u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) 26MHz  */
#define   LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_1_Val 0x1u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) 13MHz  */
#define   LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_2_Val 0x2u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) 6.5MHz  */
#define   LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_3_Val 0x3u                                           /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) 3.25MHz  */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_0 (LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_0_Val << LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) 26MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_1 (LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_1_Val << LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) 13MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_2 (LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_2_Val << LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) 6.5MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_3 (LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_3_Val << LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL_Pos)  /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) 3.25MHz Position  */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_MASK 0x0Fu                                          /**< \deprecated (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) Register MASK  (Use LPMCU_MISC_REGS_QUAD_DEC2_CTRL_Msk instead)  */
#define LPMCU_MISC_REGS_QUAD_DEC2_CTRL_Msk  0x0Fu                                          /**< (LPMCU_MISC_REGS_QUAD_DEC2_CTRL) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP0_COMP : (LPMCU_MISC_REGS Offset: 0x2c0) (R/W 32) Flash Breakpoint Compare Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP0_COMP:17;          /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP0_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP0_COMP_OFFSET 0x2C0                                         /**<  (LPMCU_MISC_REGS_FP_COMP0_COMP) Flash Breakpoint Compare Register 0  Offset */
#define LPMCU_MISC_REGS_FP_COMP0_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP0_COMP) Flash Breakpoint Compare Register 0  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP0_COMP_FP_COMP0_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP0_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP0_COMP_FP_COMP0_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP0_COMP_FP_COMP0_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP0_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP0_COMP_FP_COMP0_COMP(value) (LPMCU_MISC_REGS_FP_COMP0_COMP_FP_COMP0_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP0_COMP_FP_COMP0_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP0_COMP_MASK  0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP0_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP0_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP0_COMP_Msk   0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP0_COMP) Register Mask  */

