remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_FP_COMP1_COMP : (LPMCU_MISC_REGS Offset: 0x2c4) (R/W 32) Flash Breakpoint Compare Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP1_COMP:17;          /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP1_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP1_COMP_OFFSET 0x2C4                                         /**<  (LPMCU_MISC_REGS_FP_COMP1_COMP) Flash Breakpoint Compare Register 1  Offset */
#define LPMCU_MISC_REGS_FP_COMP1_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP1_COMP) Flash Breakpoint Compare Register 1  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP1_COMP_FP_COMP1_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP1_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP1_COMP_FP_COMP1_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP1_COMP_FP_COMP1_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP1_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP1_COMP_FP_COMP1_COMP(value) (LPMCU_MISC_REGS_FP_COMP1_COMP_FP_COMP1_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP1_COMP_FP_COMP1_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP1_COMP_MASK  0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP1_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP1_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP1_COMP_Msk   0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP1_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP2_COMP : (LPMCU_MISC_REGS Offset: 0x2c8) (R/W 32) Flash Breakpoint Compare Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP2_COMP:17;          /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP2_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP2_COMP_OFFSET 0x2C8                                         /**<  (LPMCU_MISC_REGS_FP_COMP2_COMP) Flash Breakpoint Compare Register 2  Offset */
#define LPMCU_MISC_REGS_FP_COMP2_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP2_COMP) Flash Breakpoint Compare Register 2  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP2_COMP_FP_COMP2_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP2_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP2_COMP_FP_COMP2_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP2_COMP_FP_COMP2_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP2_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP2_COMP_FP_COMP2_COMP(value) (LPMCU_MISC_REGS_FP_COMP2_COMP_FP_COMP2_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP2_COMP_FP_COMP2_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP2_COMP_MASK  0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP2_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP2_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP2_COMP_Msk   0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP2_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP3_COMP : (LPMCU_MISC_REGS Offset: 0x2cc) (R/W 32) Flash Breakpoint Compare Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP3_COMP:17;          /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP3_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP3_COMP_OFFSET 0x2CC                                         /**<  (LPMCU_MISC_REGS_FP_COMP3_COMP) Flash Breakpoint Compare Register 3  Offset */
#define LPMCU_MISC_REGS_FP_COMP3_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP3_COMP) Flash Breakpoint Compare Register 3  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP3_COMP_FP_COMP3_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP3_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP3_COMP_FP_COMP3_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP3_COMP_FP_COMP3_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP3_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP3_COMP_FP_COMP3_COMP(value) (LPMCU_MISC_REGS_FP_COMP3_COMP_FP_COMP3_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP3_COMP_FP_COMP3_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP3_COMP_MASK  0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP3_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP3_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP3_COMP_Msk   0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP3_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP4_COMP : (LPMCU_MISC_REGS Offset: 0x2d0) (R/W 32) Flash Breakpoint Compare Register 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP4_COMP:17;          /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP4_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP4_COMP_OFFSET 0x2D0                                         /**<  (LPMCU_MISC_REGS_FP_COMP4_COMP) Flash Breakpoint Compare Register 4  Offset */
#define LPMCU_MISC_REGS_FP_COMP4_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP4_COMP) Flash Breakpoint Compare Register 4  Reset Value */

