remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_FP_COMP4_COMP_FP_COMP4_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP4_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP4_COMP_FP_COMP4_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP4_COMP_FP_COMP4_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP4_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP4_COMP_FP_COMP4_COMP(value) (LPMCU_MISC_REGS_FP_COMP4_COMP_FP_COMP4_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP4_COMP_FP_COMP4_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP4_COMP_MASK  0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP4_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP4_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP4_COMP_Msk   0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP4_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP5_COMP : (LPMCU_MISC_REGS Offset: 0x2d4) (R/W 32) Flash Breakpoint Compare Register 5 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP5_COMP:17;          /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP5_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP5_COMP_OFFSET 0x2D4                                         /**<  (LPMCU_MISC_REGS_FP_COMP5_COMP) Flash Breakpoint Compare Register 5  Offset */
#define LPMCU_MISC_REGS_FP_COMP5_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP5_COMP) Flash Breakpoint Compare Register 5  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP5_COMP_FP_COMP5_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP5_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP5_COMP_FP_COMP5_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP5_COMP_FP_COMP5_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP5_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP5_COMP_FP_COMP5_COMP(value) (LPMCU_MISC_REGS_FP_COMP5_COMP_FP_COMP5_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP5_COMP_FP_COMP5_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP5_COMP_MASK  0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP5_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP5_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP5_COMP_Msk   0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP5_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP6_COMP : (LPMCU_MISC_REGS Offset: 0x2d8) (R/W 32) Flash Breakpoint Compare Register 6 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP6_COMP:17;          /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP6_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP6_COMP_OFFSET 0x2D8                                         /**<  (LPMCU_MISC_REGS_FP_COMP6_COMP) Flash Breakpoint Compare Register 6  Offset */
#define LPMCU_MISC_REGS_FP_COMP6_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP6_COMP) Flash Breakpoint Compare Register 6  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP6_COMP_FP_COMP6_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP6_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP6_COMP_FP_COMP6_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP6_COMP_FP_COMP6_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP6_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP6_COMP_FP_COMP6_COMP(value) (LPMCU_MISC_REGS_FP_COMP6_COMP_FP_COMP6_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP6_COMP_FP_COMP6_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP6_COMP_MASK  0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP6_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP6_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP6_COMP_Msk   0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP6_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP7_COMP : (LPMCU_MISC_REGS Offset: 0x2dc) (R/W 32) Flash Breakpoint Compare Register 7 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP7_COMP:17;          /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP7_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP7_COMP_OFFSET 0x2DC                                         /**<  (LPMCU_MISC_REGS_FP_COMP7_COMP) Flash Breakpoint Compare Register 7  Offset */
#define LPMCU_MISC_REGS_FP_COMP7_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP7_COMP) Flash Breakpoint Compare Register 7  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP7_COMP_FP_COMP7_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP7_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP7_COMP_FP_COMP7_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP7_COMP_FP_COMP7_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP7_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP7_COMP_FP_COMP7_COMP(value) (LPMCU_MISC_REGS_FP_COMP7_COMP_FP_COMP7_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP7_COMP_FP_COMP7_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP7_COMP_MASK  0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP7_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP7_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP7_COMP_Msk   0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP7_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP8_COMP : (LPMCU_MISC_REGS Offset: 0x2e0) (R/W 32) Flash Breakpoint Compare Register 8 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP8_COMP:17;          /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP8_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

