remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_FP_COMP8_COMP_OFFSET 0x2E0                                         /**<  (LPMCU_MISC_REGS_FP_COMP8_COMP) Flash Breakpoint Compare Register 8  Offset */
#define LPMCU_MISC_REGS_FP_COMP8_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP8_COMP) Flash Breakpoint Compare Register 8  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP8_COMP_FP_COMP8_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP8_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP8_COMP_FP_COMP8_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP8_COMP_FP_COMP8_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP8_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP8_COMP_FP_COMP8_COMP(value) (LPMCU_MISC_REGS_FP_COMP8_COMP_FP_COMP8_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP8_COMP_FP_COMP8_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP8_COMP_MASK  0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP8_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP8_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP8_COMP_Msk   0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP8_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP9_COMP : (LPMCU_MISC_REGS Offset: 0x2e4) (R/W 32) Flash Breakpoint Compare Register 9 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP9_COMP:17;          /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP9_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP9_COMP_OFFSET 0x2E4                                         /**<  (LPMCU_MISC_REGS_FP_COMP9_COMP) Flash Breakpoint Compare Register 9  Offset */
#define LPMCU_MISC_REGS_FP_COMP9_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP9_COMP) Flash Breakpoint Compare Register 9  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP9_COMP_FP_COMP9_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP9_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP9_COMP_FP_COMP9_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP9_COMP_FP_COMP9_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP9_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP9_COMP_FP_COMP9_COMP(value) (LPMCU_MISC_REGS_FP_COMP9_COMP_FP_COMP9_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP9_COMP_FP_COMP9_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP9_COMP_MASK  0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP9_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP9_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP9_COMP_Msk   0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP9_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP10_COMP : (LPMCU_MISC_REGS Offset: 0x2e8) (R/W 32) Flash Breakpoint Compare Register 10 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP10_COMP:17;         /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP10_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP10_COMP_OFFSET 0x2E8                                         /**<  (LPMCU_MISC_REGS_FP_COMP10_COMP) Flash Breakpoint Compare Register 10  Offset */
#define LPMCU_MISC_REGS_FP_COMP10_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP10_COMP) Flash Breakpoint Compare Register 10  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP10_COMP_FP_COMP10_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP10_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP10_COMP_FP_COMP10_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP10_COMP_FP_COMP10_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP10_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP10_COMP_FP_COMP10_COMP(value) (LPMCU_MISC_REGS_FP_COMP10_COMP_FP_COMP10_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP10_COMP_FP_COMP10_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP10_COMP_MASK 0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP10_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP10_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP10_COMP_Msk  0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP10_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP11_COMP : (LPMCU_MISC_REGS Offset: 0x2ec) (R/W 32) Flash Breakpoint Compare Register 11 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP11_COMP:17;         /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP11_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP11_COMP_OFFSET 0x2EC                                         /**<  (LPMCU_MISC_REGS_FP_COMP11_COMP) Flash Breakpoint Compare Register 11  Offset */
#define LPMCU_MISC_REGS_FP_COMP11_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP11_COMP) Flash Breakpoint Compare Register 11  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP11_COMP_FP_COMP11_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP11_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP11_COMP_FP_COMP11_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP11_COMP_FP_COMP11_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP11_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP11_COMP_FP_COMP11_COMP(value) (LPMCU_MISC_REGS_FP_COMP11_COMP_FP_COMP11_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP11_COMP_FP_COMP11_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP11_COMP_MASK 0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP11_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP11_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP11_COMP_Msk  0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP11_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP12_COMP : (LPMCU_MISC_REGS Offset: 0x2f0) (R/W 32) Flash Breakpoint Compare Register 12 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP12_COMP:17;         /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP12_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP12_COMP_OFFSET 0x2F0                                         /**<  (LPMCU_MISC_REGS_FP_COMP12_COMP) Flash Breakpoint Compare Register 12  Offset */
#define LPMCU_MISC_REGS_FP_COMP12_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP12_COMP) Flash Breakpoint Compare Register 12  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP12_COMP_FP_COMP12_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP12_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP12_COMP_FP_COMP12_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP12_COMP_FP_COMP12_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP12_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP12_COMP_FP_COMP12_COMP(value) (LPMCU_MISC_REGS_FP_COMP12_COMP_FP_COMP12_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP12_COMP_FP_COMP12_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP12_COMP_MASK 0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP12_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP12_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP12_COMP_Msk  0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP12_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP13_COMP : (LPMCU_MISC_REGS Offset: 0x2f4) (R/W 32) Flash Breakpoint Compare Register 13 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP13_COMP:17;         /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP13_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP13_COMP_OFFSET 0x2F4                                         /**<  (LPMCU_MISC_REGS_FP_COMP13_COMP) Flash Breakpoint Compare Register 13  Offset */
#define LPMCU_MISC_REGS_FP_COMP13_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP13_COMP) Flash Breakpoint Compare Register 13  Reset Value */

