remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_FP_COMP13_COMP_FP_COMP13_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP13_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP13_COMP_FP_COMP13_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP13_COMP_FP_COMP13_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP13_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP13_COMP_FP_COMP13_COMP(value) (LPMCU_MISC_REGS_FP_COMP13_COMP_FP_COMP13_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP13_COMP_FP_COMP13_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP13_COMP_MASK 0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP13_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP13_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP13_COMP_Msk  0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP13_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP14_COMP : (LPMCU_MISC_REGS Offset: 0x2f8) (R/W 32) Flash Breakpoint Compare Register 14 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP14_COMP:17;         /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP14_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP14_COMP_OFFSET 0x2F8                                         /**<  (LPMCU_MISC_REGS_FP_COMP14_COMP) Flash Breakpoint Compare Register 14  Offset */
#define LPMCU_MISC_REGS_FP_COMP14_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP14_COMP) Flash Breakpoint Compare Register 14  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP14_COMP_FP_COMP14_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP14_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP14_COMP_FP_COMP14_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP14_COMP_FP_COMP14_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP14_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP14_COMP_FP_COMP14_COMP(value) (LPMCU_MISC_REGS_FP_COMP14_COMP_FP_COMP14_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP14_COMP_FP_COMP14_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP14_COMP_MASK 0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP14_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP14_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP14_COMP_Msk  0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP14_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP15_COMP : (LPMCU_MISC_REGS Offset: 0x2fc) (R/W 32) Flash Breakpoint Compare Register 15 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP15_COMP:17;         /**< bit:  0..16                                           */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP15_COMP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP15_COMP_OFFSET 0x2FC                                         /**<  (LPMCU_MISC_REGS_FP_COMP15_COMP) Flash Breakpoint Compare Register 15  Offset */
#define LPMCU_MISC_REGS_FP_COMP15_COMP_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP15_COMP) Flash Breakpoint Compare Register 15  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP15_COMP_FP_COMP15_COMP_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP15_COMP)  Position */
#define LPMCU_MISC_REGS_FP_COMP15_COMP_FP_COMP15_COMP_Msk (0x1FFFFu << LPMCU_MISC_REGS_FP_COMP15_COMP_FP_COMP15_COMP_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP15_COMP)  Mask */
#define LPMCU_MISC_REGS_FP_COMP15_COMP_FP_COMP15_COMP(value) (LPMCU_MISC_REGS_FP_COMP15_COMP_FP_COMP15_COMP_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP15_COMP_FP_COMP15_COMP_Pos))
#define LPMCU_MISC_REGS_FP_COMP15_COMP_MASK 0x1FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP15_COMP) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP15_COMP_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP15_COMP_Msk  0x1FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP15_COMP) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP0_REPLACE : (LPMCU_MISC_REGS Offset: 0x300) (R/W 32) Flash Breakpoint Replace Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP0_REPLACE:19;       /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP0_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP0_REPLACE_OFFSET 0x300                                         /**<  (LPMCU_MISC_REGS_FP_COMP0_REPLACE) Flash Breakpoint Replace Register 0  Offset */
#define LPMCU_MISC_REGS_FP_COMP0_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP0_REPLACE) Flash Breakpoint Replace Register 0  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP0_REPLACE_FP_COMP0_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP0_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP0_REPLACE_FP_COMP0_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP0_REPLACE_FP_COMP0_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP0_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP0_REPLACE_FP_COMP0_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP0_REPLACE_FP_COMP0_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP0_REPLACE_FP_COMP0_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP0_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP0_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP0_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP0_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP0_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP1_REPLACE : (LPMCU_MISC_REGS Offset: 0x304) (R/W 32) Flash Breakpoint Replace Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP1_REPLACE:19;       /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP1_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

