remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#define LPMCU_MISC_REGS_FP_COMP1_REPLACE_OFFSET 0x304                                         /**<  (LPMCU_MISC_REGS_FP_COMP1_REPLACE) Flash Breakpoint Replace Register 1  Offset */
#define LPMCU_MISC_REGS_FP_COMP1_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP1_REPLACE) Flash Breakpoint Replace Register 1  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP1_REPLACE_FP_COMP1_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP1_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP1_REPLACE_FP_COMP1_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP1_REPLACE_FP_COMP1_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP1_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP1_REPLACE_FP_COMP1_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP1_REPLACE_FP_COMP1_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP1_REPLACE_FP_COMP1_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP1_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP1_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP1_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP1_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP1_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP2_REPLACE : (LPMCU_MISC_REGS Offset: 0x308) (R/W 32) Flash Breakpoint Replace Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP2_REPLACE:19;       /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP2_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP2_REPLACE_OFFSET 0x308                                         /**<  (LPMCU_MISC_REGS_FP_COMP2_REPLACE) Flash Breakpoint Replace Register 2  Offset */
#define LPMCU_MISC_REGS_FP_COMP2_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP2_REPLACE) Flash Breakpoint Replace Register 2  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP2_REPLACE_FP_COMP2_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP2_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP2_REPLACE_FP_COMP2_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP2_REPLACE_FP_COMP2_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP2_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP2_REPLACE_FP_COMP2_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP2_REPLACE_FP_COMP2_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP2_REPLACE_FP_COMP2_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP2_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP2_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP2_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP2_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP2_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP3_REPLACE : (LPMCU_MISC_REGS Offset: 0x30c) (R/W 32) Flash Breakpoint Replace Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP3_REPLACE:19;       /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP3_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP3_REPLACE_OFFSET 0x30C                                         /**<  (LPMCU_MISC_REGS_FP_COMP3_REPLACE) Flash Breakpoint Replace Register 3  Offset */
#define LPMCU_MISC_REGS_FP_COMP3_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP3_REPLACE) Flash Breakpoint Replace Register 3  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP3_REPLACE_FP_COMP3_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP3_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP3_REPLACE_FP_COMP3_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP3_REPLACE_FP_COMP3_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP3_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP3_REPLACE_FP_COMP3_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP3_REPLACE_FP_COMP3_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP3_REPLACE_FP_COMP3_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP3_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP3_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP3_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP3_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP3_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP4_REPLACE : (LPMCU_MISC_REGS Offset: 0x310) (R/W 32) Flash Breakpoint Replace Register 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP4_REPLACE:19;       /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP4_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP4_REPLACE_OFFSET 0x310                                         /**<  (LPMCU_MISC_REGS_FP_COMP4_REPLACE) Flash Breakpoint Replace Register 4  Offset */
#define LPMCU_MISC_REGS_FP_COMP4_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP4_REPLACE) Flash Breakpoint Replace Register 4  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP4_REPLACE_FP_COMP4_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP4_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP4_REPLACE_FP_COMP4_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP4_REPLACE_FP_COMP4_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP4_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP4_REPLACE_FP_COMP4_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP4_REPLACE_FP_COMP4_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP4_REPLACE_FP_COMP4_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP4_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP4_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP4_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP4_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP4_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP5_REPLACE : (LPMCU_MISC_REGS Offset: 0x314) (R/W 32) Flash Breakpoint Replace Register 5 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP5_REPLACE:19;       /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP5_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP5_REPLACE_OFFSET 0x314                                         /**<  (LPMCU_MISC_REGS_FP_COMP5_REPLACE) Flash Breakpoint Replace Register 5  Offset */
#define LPMCU_MISC_REGS_FP_COMP5_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP5_REPLACE) Flash Breakpoint Replace Register 5  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP5_REPLACE_FP_COMP5_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP5_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP5_REPLACE_FP_COMP5_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP5_REPLACE_FP_COMP5_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP5_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP5_REPLACE_FP_COMP5_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP5_REPLACE_FP_COMP5_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP5_REPLACE_FP_COMP5_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP5_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP5_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP5_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP5_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP5_REPLACE) Register Mask  */

