remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_FP_COMP6_REPLACE : (LPMCU_MISC_REGS Offset: 0x318) (R/W 32) Flash Breakpoint Replace Register 6 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP6_REPLACE:19;       /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP6_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP6_REPLACE_OFFSET 0x318                                         /**<  (LPMCU_MISC_REGS_FP_COMP6_REPLACE) Flash Breakpoint Replace Register 6  Offset */
#define LPMCU_MISC_REGS_FP_COMP6_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP6_REPLACE) Flash Breakpoint Replace Register 6  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP6_REPLACE_FP_COMP6_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP6_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP6_REPLACE_FP_COMP6_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP6_REPLACE_FP_COMP6_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP6_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP6_REPLACE_FP_COMP6_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP6_REPLACE_FP_COMP6_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP6_REPLACE_FP_COMP6_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP6_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP6_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP6_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP6_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP6_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP7_REPLACE : (LPMCU_MISC_REGS Offset: 0x31c) (R/W 32) Flash Breakpoint Replace Register 7 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP7_REPLACE:19;       /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP7_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP7_REPLACE_OFFSET 0x31C                                         /**<  (LPMCU_MISC_REGS_FP_COMP7_REPLACE) Flash Breakpoint Replace Register 7  Offset */
#define LPMCU_MISC_REGS_FP_COMP7_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP7_REPLACE) Flash Breakpoint Replace Register 7  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP7_REPLACE_FP_COMP7_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP7_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP7_REPLACE_FP_COMP7_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP7_REPLACE_FP_COMP7_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP7_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP7_REPLACE_FP_COMP7_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP7_REPLACE_FP_COMP7_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP7_REPLACE_FP_COMP7_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP7_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP7_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP7_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP7_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP7_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP8_REPLACE : (LPMCU_MISC_REGS Offset: 0x320) (R/W 32) Flash Breakpoint Replace Register 8 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP8_REPLACE:19;       /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP8_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP8_REPLACE_OFFSET 0x320                                         /**<  (LPMCU_MISC_REGS_FP_COMP8_REPLACE) Flash Breakpoint Replace Register 8  Offset */
#define LPMCU_MISC_REGS_FP_COMP8_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP8_REPLACE) Flash Breakpoint Replace Register 8  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP8_REPLACE_FP_COMP8_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP8_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP8_REPLACE_FP_COMP8_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP8_REPLACE_FP_COMP8_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP8_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP8_REPLACE_FP_COMP8_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP8_REPLACE_FP_COMP8_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP8_REPLACE_FP_COMP8_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP8_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP8_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP8_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP8_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP8_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP9_REPLACE : (LPMCU_MISC_REGS Offset: 0x324) (R/W 32) Flash Breakpoint Replace Register 9 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP9_REPLACE:19;       /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP9_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP9_REPLACE_OFFSET 0x324                                         /**<  (LPMCU_MISC_REGS_FP_COMP9_REPLACE) Flash Breakpoint Replace Register 9  Offset */
#define LPMCU_MISC_REGS_FP_COMP9_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP9_REPLACE) Flash Breakpoint Replace Register 9  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP9_REPLACE_FP_COMP9_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP9_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP9_REPLACE_FP_COMP9_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP9_REPLACE_FP_COMP9_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP9_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP9_REPLACE_FP_COMP9_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP9_REPLACE_FP_COMP9_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP9_REPLACE_FP_COMP9_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP9_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP9_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP9_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP9_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP9_REPLACE) Register Mask  */

