remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_FP_COMP10_REPLACE : (LPMCU_MISC_REGS Offset: 0x328) (R/W 32) Flash Breakpoint Replace Register 10 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP10_REPLACE:19;      /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP10_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP10_REPLACE_OFFSET 0x328                                         /**<  (LPMCU_MISC_REGS_FP_COMP10_REPLACE) Flash Breakpoint Replace Register 10  Offset */
#define LPMCU_MISC_REGS_FP_COMP10_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP10_REPLACE) Flash Breakpoint Replace Register 10  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP10_REPLACE_FP_COMP10_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP10_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP10_REPLACE_FP_COMP10_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP10_REPLACE_FP_COMP10_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP10_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP10_REPLACE_FP_COMP10_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP10_REPLACE_FP_COMP10_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP10_REPLACE_FP_COMP10_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP10_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP10_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP10_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP10_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP10_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP11_REPLACE : (LPMCU_MISC_REGS Offset: 0x32c) (R/W 32) Flash Breakpoint Replace Register 11 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP11_REPLACE:19;      /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP11_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP11_REPLACE_OFFSET 0x32C                                         /**<  (LPMCU_MISC_REGS_FP_COMP11_REPLACE) Flash Breakpoint Replace Register 11  Offset */
#define LPMCU_MISC_REGS_FP_COMP11_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP11_REPLACE) Flash Breakpoint Replace Register 11  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP11_REPLACE_FP_COMP11_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP11_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP11_REPLACE_FP_COMP11_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP11_REPLACE_FP_COMP11_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP11_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP11_REPLACE_FP_COMP11_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP11_REPLACE_FP_COMP11_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP11_REPLACE_FP_COMP11_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP11_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP11_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP11_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP11_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP11_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP12_REPLACE : (LPMCU_MISC_REGS Offset: 0x330) (R/W 32) Flash Breakpoint Replace Register 12 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP12_REPLACE:19;      /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP12_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP12_REPLACE_OFFSET 0x330                                         /**<  (LPMCU_MISC_REGS_FP_COMP12_REPLACE) Flash Breakpoint Replace Register 12  Offset */
#define LPMCU_MISC_REGS_FP_COMP12_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP12_REPLACE) Flash Breakpoint Replace Register 12  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP12_REPLACE_FP_COMP12_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP12_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP12_REPLACE_FP_COMP12_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP12_REPLACE_FP_COMP12_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP12_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP12_REPLACE_FP_COMP12_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP12_REPLACE_FP_COMP12_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP12_REPLACE_FP_COMP12_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP12_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP12_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP12_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP12_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP12_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP13_REPLACE : (LPMCU_MISC_REGS Offset: 0x334) (R/W 32) Flash Breakpoint Replace Register 13 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP13_REPLACE:19;      /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP13_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP13_REPLACE_OFFSET 0x334                                         /**<  (LPMCU_MISC_REGS_FP_COMP13_REPLACE) Flash Breakpoint Replace Register 13  Offset */
#define LPMCU_MISC_REGS_FP_COMP13_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP13_REPLACE) Flash Breakpoint Replace Register 13  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP13_REPLACE_FP_COMP13_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP13_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP13_REPLACE_FP_COMP13_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP13_REPLACE_FP_COMP13_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP13_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP13_REPLACE_FP_COMP13_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP13_REPLACE_FP_COMP13_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP13_REPLACE_FP_COMP13_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP13_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP13_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP13_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP13_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP13_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP14_REPLACE : (LPMCU_MISC_REGS Offset: 0x338) (R/W 32) Flash Breakpoint Replace Register 14 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP14_REPLACE:19;      /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP14_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP14_REPLACE_OFFSET 0x338                                         /**<  (LPMCU_MISC_REGS_FP_COMP14_REPLACE) Flash Breakpoint Replace Register 14  Offset */
#define LPMCU_MISC_REGS_FP_COMP14_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP14_REPLACE) Flash Breakpoint Replace Register 14  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP14_REPLACE_FP_COMP14_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP14_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP14_REPLACE_FP_COMP14_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP14_REPLACE_FP_COMP14_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP14_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP14_REPLACE_FP_COMP14_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP14_REPLACE_FP_COMP14_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP14_REPLACE_FP_COMP14_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP14_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP14_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP14_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP14_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP14_REPLACE) Register Mask  */

/* -------- LPMCU_MISC_REGS_FP_COMP15_REPLACE : (LPMCU_MISC_REGS Offset: 0x33c) (R/W 32) Flash Breakpoint Replace Register 14 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FP_COMP15_REPLACE:19;      /**< bit:  0..18                                           */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP15_REPLACE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP15_REPLACE_OFFSET 0x33C                                         /**<  (LPMCU_MISC_REGS_FP_COMP15_REPLACE) Flash Breakpoint Replace Register 14  Offset */
#define LPMCU_MISC_REGS_FP_COMP15_REPLACE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP15_REPLACE) Flash Breakpoint Replace Register 14  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP15_REPLACE_FP_COMP15_REPLACE_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP15_REPLACE)  Position */
#define LPMCU_MISC_REGS_FP_COMP15_REPLACE_FP_COMP15_REPLACE_Msk (0x7FFFFu << LPMCU_MISC_REGS_FP_COMP15_REPLACE_FP_COMP15_REPLACE_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP15_REPLACE)  Mask */
#define LPMCU_MISC_REGS_FP_COMP15_REPLACE_FP_COMP15_REPLACE(value) (LPMCU_MISC_REGS_FP_COMP15_REPLACE_FP_COMP15_REPLACE_Msk & ((value) << LPMCU_MISC_REGS_FP_COMP15_REPLACE_FP_COMP15_REPLACE_Pos))
#define LPMCU_MISC_REGS_FP_COMP15_REPLACE_MASK 0x7FFFFu                                       /**< \deprecated (LPMCU_MISC_REGS_FP_COMP15_REPLACE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP15_REPLACE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP15_REPLACE_Msk 0x7FFFFu                                       /**< (LPMCU_MISC_REGS_FP_COMP15_REPLACE) Register Mask  */

