remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_FP_COMP_ENABLE : (LPMCU_MISC_REGS Offset: 0x340) (R/W 16) Flash Breakpoint Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t CMP_0_EN:1;                /**< bit:      0  Enable Compare 0                         */
    uint16_t CMP_1_EN:1;                /**< bit:      1  Enable Compare 1                         */
    uint16_t CMP_2_EN:1;                /**< bit:      2  Enable Compare 2                         */
    uint16_t CMP_3_EN:1;                /**< bit:      3  Enable Compare 3                         */
    uint16_t CMP_4_EN:1;                /**< bit:      4  Enable Compare 4                         */
    uint16_t CMP_5_EN:1;                /**< bit:      5  Enable Compare 5                         */
    uint16_t CMP_6_EN:1;                /**< bit:      6  Enable Compare 6                         */
    uint16_t CMP_7_EN:1;                /**< bit:      7  Enable Compare 7                         */
    uint16_t CMP_8_EN:1;                /**< bit:      8  Enable Compare 8                         */
    uint16_t CMP_9_EN:1;                /**< bit:      9  Enable Compare 9                         */
    uint16_t CMP_10_EN:1;               /**< bit:     10  Enable Compare 10                        */
    uint16_t CMP_11_EN:1;               /**< bit:     11  Enable Compare 11                        */
    uint16_t CMP_12_EN:1;               /**< bit:     12  Enable Compare 12                        */
    uint16_t CMP_13_EN:1;               /**< bit:     13  Enable Compare 13                        */
    uint16_t CMP_14_EN:1;               /**< bit:     14  Enable Compare 14                        */
    uint16_t CMP_15_EN:1;               /**< bit:     15  Enable Compare 15                        */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_FP_COMP_ENABLE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_FP_COMP_ENABLE_OFFSET 0x340                                         /**<  (LPMCU_MISC_REGS_FP_COMP_ENABLE) Flash Breakpoint Enable Register  Offset */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_FP_COMP_ENABLE) Flash Breakpoint Enable Register  Reset Value */

#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_0_EN_Pos 0                                              /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 0 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_0_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_0_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 0 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_0_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_0_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_0_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_1_EN_Pos 1                                              /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 1 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_1_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_1_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 1 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_1_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_1_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_1_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_2_EN_Pos 2                                              /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 2 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_2_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_2_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 2 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_2_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_2_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_2_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_3_EN_Pos 3                                              /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 3 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_3_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_3_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 3 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_3_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_3_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_3_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_4_EN_Pos 4                                              /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 4 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_4_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_4_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 4 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_4_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_4_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_4_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_5_EN_Pos 5                                              /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 5 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_5_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_5_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 5 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_5_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_5_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_5_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_6_EN_Pos 6                                              /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 6 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_6_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_6_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 6 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_6_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_6_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_6_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_7_EN_Pos 7                                              /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 7 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_7_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_7_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 7 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_7_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_7_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_7_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_8_EN_Pos 8                                              /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 8 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_8_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_8_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 8 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_8_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_8_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_8_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_9_EN_Pos 9                                              /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 9 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_9_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_9_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 9 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_9_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_9_EN_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_9_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_10_EN_Pos 10                                             /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 10 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_10_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_10_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 10 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_10_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_10_EN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_10_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_11_EN_Pos 11                                             /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 11 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_11_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_11_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 11 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_11_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_11_EN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_11_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_12_EN_Pos 12                                             /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 12 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_12_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_12_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 12 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_12_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_12_EN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_12_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_13_EN_Pos 13                                             /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 13 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_13_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_13_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 13 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_13_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_13_EN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_13_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_14_EN_Pos 14                                             /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 14 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_14_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_14_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 14 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_14_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_14_EN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_14_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_15_EN_Pos 15                                             /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 15 Position */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_15_EN_Msk (0x1u << LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_15_EN_Pos)  /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Enable Compare 15 Mask */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_15_EN LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_15_EN_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_FP_COMP_ENABLE_CMP_15_EN_Msk instead */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_MASK 0xFFFFu                                        /**< \deprecated (LPMCU_MISC_REGS_FP_COMP_ENABLE) Register MASK  (Use LPMCU_MISC_REGS_FP_COMP_ENABLE_Msk instead)  */
#define LPMCU_MISC_REGS_FP_COMP_ENABLE_Msk  0xFFFFu                                        /**< (LPMCU_MISC_REGS_FP_COMP_ENABLE) Register Mask  */

/* -------- LPMCU_MISC_REGS_PMU_READ_REGS : (LPMCU_MISC_REGS Offset: 0x410) (R/ 32) PMU Status Registers -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t READREG1:8;                /**< bit:   0..7  PMU Read Register 1                      */
    uint32_t READREG2:8;                /**< bit:  8..15  PMU Read Register 2                      */
    uint32_t READREG3:8;                /**< bit: 16..23  PMU Read Register 3                      */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_PMU_READ_REGS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_PMU_READ_REGS_OFFSET 0x410                                         /**<  (LPMCU_MISC_REGS_PMU_READ_REGS) PMU Status Registers  Offset */
#define LPMCU_MISC_REGS_PMU_READ_REGS_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_PMU_READ_REGS) PMU Status Registers  Reset Value */

#define LPMCU_MISC_REGS_PMU_READ_REGS_READREG1_Pos 0                                              /**< (LPMCU_MISC_REGS_PMU_READ_REGS) PMU Read Register 1 Position */
#define LPMCU_MISC_REGS_PMU_READ_REGS_READREG1_Msk (0xFFu << LPMCU_MISC_REGS_PMU_READ_REGS_READREG1_Pos)  /**< (LPMCU_MISC_REGS_PMU_READ_REGS) PMU Read Register 1 Mask */
#define LPMCU_MISC_REGS_PMU_READ_REGS_READREG1(value) (LPMCU_MISC_REGS_PMU_READ_REGS_READREG1_Msk & ((value) << LPMCU_MISC_REGS_PMU_READ_REGS_READREG1_Pos))
#define LPMCU_MISC_REGS_PMU_READ_REGS_READREG2_Pos 8                                              /**< (LPMCU_MISC_REGS_PMU_READ_REGS) PMU Read Register 2 Position */
#define LPMCU_MISC_REGS_PMU_READ_REGS_READREG2_Msk (0xFFu << LPMCU_MISC_REGS_PMU_READ_REGS_READREG2_Pos)  /**< (LPMCU_MISC_REGS_PMU_READ_REGS) PMU Read Register 2 Mask */
#define LPMCU_MISC_REGS_PMU_READ_REGS_READREG2(value) (LPMCU_MISC_REGS_PMU_READ_REGS_READREG2_Msk & ((value) << LPMCU_MISC_REGS_PMU_READ_REGS_READREG2_Pos))
#define LPMCU_MISC_REGS_PMU_READ_REGS_READREG3_Pos 16                                             /**< (LPMCU_MISC_REGS_PMU_READ_REGS) PMU Read Register 3 Position */
#define LPMCU_MISC_REGS_PMU_READ_REGS_READREG3_Msk (0xFFu << LPMCU_MISC_REGS_PMU_READ_REGS_READREG3_Pos)  /**< (LPMCU_MISC_REGS_PMU_READ_REGS) PMU Read Register 3 Mask */
#define LPMCU_MISC_REGS_PMU_READ_REGS_READREG3(value) (LPMCU_MISC_REGS_PMU_READ_REGS_READREG3_Msk & ((value) << LPMCU_MISC_REGS_PMU_READ_REGS_READREG3_Pos))
#define LPMCU_MISC_REGS_PMU_READ_REGS_MASK  0xFFFFFFu                                      /**< \deprecated (LPMCU_MISC_REGS_PMU_READ_REGS) Register MASK  (Use LPMCU_MISC_REGS_PMU_READ_REGS_Msk instead)  */
#define LPMCU_MISC_REGS_PMU_READ_REGS_Msk   0xFFFFFFu                                      /**< (LPMCU_MISC_REGS_PMU_READ_REGS) Register Mask  */

