remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
/* -------- LPMCU_MISC_REGS_MS_GPIO : (LPMCU_MISC_REGS Offset: 0x414) (R/W 8) Control for Mixed Signal GPIOs -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PULL_TYPE_44:1;            /**< bit:      0  Mixed Signal LP_GPIO_44 Pull Type Select. 1: PD, 0: PU. */
    uint8_t  PULL_TYPE_45:1;            /**< bit:      1  Mixed Signal LP_GPIO_45 Pull Type Select. 1: PD, 0: PU. */
    uint8_t  PULL_TYPE_46:1;            /**< bit:      2  Mixed Signal LP_GPIO_46 Pull Type Select. 1: PD, 0: PU. */
    uint8_t  PULL_TYPE_47:1;            /**< bit:      3  Mixed Signal LP_GPIO_47 Pull Type Select. 1: PD, 0: PU. */
    uint8_t  PULL_ENABLE_44:1;          /**< bit:      4  Active Low Pull Enable for Mixed Signal LP_GPIO_44 */
    uint8_t  PULL_ENABLE_45:1;          /**< bit:      5  Active Low Pull Enable for Mixed Signal LP_GPIO_45 */
    uint8_t  PULL_ENABLE_46:1;          /**< bit:      6  Active Low Pull Enable for Mixed Signal LP_GPIO_46 */
    uint8_t  PULL_ENABLE_47:1;          /**< bit:      7  Active Low Pull Enable for Mixed Signal LP_GPIO_47 */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint8_t  PULL_TYPE_:4;              /**< bit:   0..3  Mixed Signal LP_GPIO_44 Pull Type Select. x: PD, x: PU. */
    uint8_t  PULL_ENABLE_:4;            /**< bit:   4..7  Active Low Pull Enable for Mixed Signal LP_GPIO_47 */
  } vec;                                /**< Structure used for vec  access  */
  uint8_t  reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_MS_GPIO_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_MS_GPIO_OFFSET      0x414                                         /**<  (LPMCU_MISC_REGS_MS_GPIO) Control for Mixed Signal GPIOs  Offset */
#define LPMCU_MISC_REGS_MS_GPIO_RESETVALUE  0xF0u                                         /**<  (LPMCU_MISC_REGS_MS_GPIO) Control for Mixed Signal GPIOs  Reset Value */

#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_44_Pos 0                                              /**< (LPMCU_MISC_REGS_MS_GPIO) Mixed Signal LP_GPIO_44 Pull Type Select. 1: PD, 0: PU. Position */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_44_Msk (0x1u << LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_44_Pos)  /**< (LPMCU_MISC_REGS_MS_GPIO) Mixed Signal LP_GPIO_44 Pull Type Select. 1: PD, 0: PU. Mask */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_44 LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_44_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_44_Msk instead */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_45_Pos 1                                              /**< (LPMCU_MISC_REGS_MS_GPIO) Mixed Signal LP_GPIO_45 Pull Type Select. 1: PD, 0: PU. Position */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_45_Msk (0x1u << LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_45_Pos)  /**< (LPMCU_MISC_REGS_MS_GPIO) Mixed Signal LP_GPIO_45 Pull Type Select. 1: PD, 0: PU. Mask */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_45 LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_45_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_45_Msk instead */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_46_Pos 2                                              /**< (LPMCU_MISC_REGS_MS_GPIO) Mixed Signal LP_GPIO_46 Pull Type Select. 1: PD, 0: PU. Position */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_46_Msk (0x1u << LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_46_Pos)  /**< (LPMCU_MISC_REGS_MS_GPIO) Mixed Signal LP_GPIO_46 Pull Type Select. 1: PD, 0: PU. Mask */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_46 LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_46_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_46_Msk instead */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_47_Pos 3                                              /**< (LPMCU_MISC_REGS_MS_GPIO) Mixed Signal LP_GPIO_47 Pull Type Select. 1: PD, 0: PU. Position */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_47_Msk (0x1u << LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_47_Pos)  /**< (LPMCU_MISC_REGS_MS_GPIO) Mixed Signal LP_GPIO_47 Pull Type Select. 1: PD, 0: PU. Mask */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_47 LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_47_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_47_Msk instead */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_44_Pos 4                                              /**< (LPMCU_MISC_REGS_MS_GPIO) Active Low Pull Enable for Mixed Signal LP_GPIO_44 Position */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_44_Msk (0x1u << LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_44_Pos)  /**< (LPMCU_MISC_REGS_MS_GPIO) Active Low Pull Enable for Mixed Signal LP_GPIO_44 Mask */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_44 LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_44_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_44_Msk instead */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_45_Pos 5                                              /**< (LPMCU_MISC_REGS_MS_GPIO) Active Low Pull Enable for Mixed Signal LP_GPIO_45 Position */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_45_Msk (0x1u << LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_45_Pos)  /**< (LPMCU_MISC_REGS_MS_GPIO) Active Low Pull Enable for Mixed Signal LP_GPIO_45 Mask */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_45 LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_45_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_45_Msk instead */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_46_Pos 6                                              /**< (LPMCU_MISC_REGS_MS_GPIO) Active Low Pull Enable for Mixed Signal LP_GPIO_46 Position */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_46_Msk (0x1u << LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_46_Pos)  /**< (LPMCU_MISC_REGS_MS_GPIO) Active Low Pull Enable for Mixed Signal LP_GPIO_46 Mask */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_46 LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_46_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_46_Msk instead */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_47_Pos 7                                              /**< (LPMCU_MISC_REGS_MS_GPIO) Active Low Pull Enable for Mixed Signal LP_GPIO_47 Position */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_47_Msk (0x1u << LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_47_Pos)  /**< (LPMCU_MISC_REGS_MS_GPIO) Active Low Pull Enable for Mixed Signal LP_GPIO_47 Mask */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_47 LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_47_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_47_Msk instead */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE__Pos 0                                              /**< (LPMCU_MISC_REGS_MS_GPIO Position) Mixed Signal LP_GPIO_44 Pull Type Select. x: PD, x: PU. */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE__Msk (0xFu << LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE__Pos)  /**< (LPMCU_MISC_REGS_MS_GPIO Mask) PULL_TYPE_ */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE_(value) (LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE__Msk & ((value) << LPMCU_MISC_REGS_MS_GPIO_PULL_TYPE__Pos))  
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE__Pos 4                                              /**< (LPMCU_MISC_REGS_MS_GPIO Position) Active Low Pull Enable for Mixed Signal LP_GPIO_47 */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE__Msk (0xFu << LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE__Pos)  /**< (LPMCU_MISC_REGS_MS_GPIO Mask) PULL_ENABLE_ */
#define LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE_(value) (LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE__Msk & ((value) << LPMCU_MISC_REGS_MS_GPIO_PULL_ENABLE__Pos))  
#define LPMCU_MISC_REGS_MS_GPIO_MASK        0xFFu                                          /**< \deprecated (LPMCU_MISC_REGS_MS_GPIO) Register MASK  (Use LPMCU_MISC_REGS_MS_GPIO_Msk instead)  */
#define LPMCU_MISC_REGS_MS_GPIO_Msk         0xFFu                                          /**< (LPMCU_MISC_REGS_MS_GPIO) Register Mask  */

/* -------- LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER : (LPMCU_MISC_REGS Offset: 0x420) (R/ 32) Current value of the AON Sleep Timer (syncd to ARM clock) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t AON_SLEEP_TIMER_COUNTER:32;  /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_OFFSET 0x420                                         /**<  (LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER) Current value of the AON Sleep Timer (syncd to ARM clock)  Offset */
#define LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_RESETVALUE 0x00u                                         /**<  (LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER) Current value of the AON Sleep Timer (syncd to ARM clock)  Reset Value */

#define LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_AON_SLEEP_TIMER_COUNTER_Pos 0                                              /**< (LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER)  Position */
#define LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_AON_SLEEP_TIMER_COUNTER_Msk (0xFFFFFFFFu << LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_AON_SLEEP_TIMER_COUNTER_Pos)  /**< (LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER)  Mask */
#define LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_AON_SLEEP_TIMER_COUNTER(value) (LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_AON_SLEEP_TIMER_COUNTER_Msk & ((value) << LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_AON_SLEEP_TIMER_COUNTER_Pos))
#define LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_MASK 0xFFFFFFFFu                                    /**< \deprecated (LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER) Register MASK  (Use LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_Msk instead)  */
#define LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_Msk 0xFFFFFFFFu                                    /**< (LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief LPMCU_MISC_REGS hardware registers */
typedef struct {  /* LPMCU Misc Registers */
  RoReg   LPMCU_CHIP_ID;  /**< (LPMCU_MISC_REGS Offset: 0x00) The hard-coded ID for the chip. */
  RwReg   LPMCU_GLOBAL_RESET_0; /**< (LPMCU_MISC_REGS Offset: 0x04) Active Low Global Reset */
  RwReg16 LPMCU_GLOBAL_RESET_1; /**< (LPMCU_MISC_REGS Offset: 0x08) Active Low Global Reset */
  __I  uint8_t  Reserved1[2];
  RwReg   LPMCU_CLOCK_ENABLES_0; /**< (LPMCU_MISC_REGS Offset: 0x0C) LPMCU Clock Enables */
  RwReg   LPMCU_CLOCK_ENABLES_1; /**< (LPMCU_MISC_REGS Offset: 0x10) LPMCU Clock Enables */
  RwReg8  BTMCU_CTRL;     /**< (LPMCU_MISC_REGS Offset: 0x14) Miscellaneous BLE control */
  __I  uint8_t  Reserved2[3];
  RwReg   LPMCU_CTRL;     /**< (LPMCU_MISC_REGS Offset: 0x18) Miscellaneous LPMCU control */
  RwReg8  LPMCU_MBIST;    /**< (LPMCU_MISC_REGS Offset: 0x1C) MBIST designation */
  __I  uint8_t  Reserved3[3];
  RwReg8  BLE_CTRL;       /**< (LPMCU_MISC_REGS Offset: 0x20) BLE Control */
  __I  uint8_t  Reserved4[3];
  RwReg   MBIST_CTRL;     /**< (LPMCU_MISC_REGS Offset: 0x24) MBIST Control Register */
  RoReg   MBIST_STATUS;   /**< (LPMCU_MISC_REGS Offset: 0x28) MBIST Status Register */
  RwReg16 MBIST_SRAM_ALG_SEL; /**< (LPMCU_MISC_REGS Offset: 0x2C) Enables MBIST algorithms */
  __I  uint8_t  Reserved5[2];
  RwReg   MBIST_BG;       /**< (LPMCU_MISC_REGS Offset: 0x30) MBIST Background for MARCH2 algorithm (bits 31:0) */
  __I  uint32_t Reserved6[1];
  RwReg8  TEST_BUS_CTRL;  /**< (LPMCU_MISC_REGS Offset: 0x38) Controls all of the test bus functionality */
  __I  uint8_t  Reserved7[3];
  RoReg   WP3_MISR_DATAOUT; /**< (LPMCU_MISC_REGS Offset: 0x3C) ROM MBIST Signature */
  RwReg   INVERT_OUTPUT_CTRL; /**< (LPMCU_MISC_REGS Offset: 0x40) Invert Output Control */
  RwReg   PINMUX_SEL_0;   /**< (LPMCU_MISC_REGS Offset: 0x44) Pinmux select for LP_GPIO_0, LP_GPIO_1, LP_GPIO_2, LP_GPIO_3, LP_GPIO_4, LP_GPIO_5, LP_GPIO_6, LP_GPIO_7 */
  RwReg   PINMUX_SEL_1;   /**< (LPMCU_MISC_REGS Offset: 0x48) Pinmux select for LP_GPIO_8, LP_GPIO_9, LP_GPIO_10, LP_GPIO_11, LP_GPIO_12, LP_GPIO_13, LP_GPIO_14, LP_GPIO_15 */
  RwReg   PINMUX_SEL_2;   /**< (LPMCU_MISC_REGS Offset: 0x4C) Pinmux select for LP_GPIO_16, LP_GPIO_17, LP_GPIO_18, LP_GPIO_19, LP_GPIO_20, LP_GPIO_21, LP_GPIO_22, LP_GPIO_23 */
  RwReg   PULL_ENABLE;    /**< (LPMCU_MISC_REGS Offset: 0x50) Active Low Pull Enables for LPMCU Pads */
  RwReg   RTYPE_PAD_0;    /**< (LPMCU_MISC_REGS Offset: 0x54) Controls the RTYPE (Pull Level) pad value for LPMCU Pads (0 = Pull Up) */
  __I  uint32_t Reserved8[4];
  RwReg   PINMUX_SEL_3;   /**< (LPMCU_MISC_REGS Offset: 0x68) Pinmux select for LP_SIP_0, LP_SIP_1, LP_SIP_2, LP_SIP_3, LP_SIP_4 */
  RwReg   ISHAPE_PAD_3;   /**< (LPMCU_MISC_REGS Offset: 0x6C) Controls the ISHAPE pad value for LPMCU SIP Pads */
  __I  uint32_t Reserved9[8];
  RwReg8  LPMCU_CTRL_2;   /**< (LPMCU_MISC_REGS Offset: 0x90) Misc control for the LPMCU */
  __I  uint8_t  Reserved10[15];
  RwReg8  SPIFLASH_VDDIO_CTRL; /**< (LPMCU_MISC_REGS Offset: 0xA0) Control for VDDIO of SPI FLASH */
  __I  uint8_t  Reserved11[3];
  RwReg8  SPIFLASH_BYPASS; /**< (LPMCU_MISC_REGS Offset: 0xA4) SPI FLASH Bypass */
  __I  uint8_t  Reserved12[27];
  RwReg   IRQ_MUX_IO_SEL_0; /**< (LPMCU_MISC_REGS Offset: 0xC0) ARM Cortex IRQ Mux Selection */
  RwReg   IRQ_MUX_IO_SEL_1; /**< (LPMCU_MISC_REGS Offset: 0xC4) ARM Cortex IRQ Mux Selection */
  RwReg   IRQ_MUX_IO_SEL_2; /**< (LPMCU_MISC_REGS Offset: 0xC8) ARM Cortex IRQ Mux Selection */
  RwReg   IRQ_MUX_IO_SEL_3; /**< (LPMCU_MISC_REGS Offset: 0xCC) ARM Cortex IRQ Mux Selection */
  RwReg   IRQ_MUX_IO_SEL_4; /**< (LPMCU_MISC_REGS Offset: 0xD0) ARM Cortex IRQ Mux Selection */
  RwReg8  IRQ_MUX_IO_SEL_5; /**< (LPMCU_MISC_REGS Offset: 0xD4) ARM Cortex IRQ Mux Selection */
  __I  uint8_t  Reserved13[139];
  RwReg   PWM0_CTRL;      /**< (LPMCU_MISC_REGS Offset: 0x160) PWM0 Control Register */
  RwReg   PWM1_CTRL;      /**< (LPMCU_MISC_REGS Offset: 0x164) PWM1 Control Register */
  RwReg   PWM2_CTRL;      /**< (LPMCU_MISC_REGS Offset: 0x168) PWM2 Control Register */
  RwReg   PWM3_CTRL;      /**< (LPMCU_MISC_REGS Offset: 0x16C) PWM3 Control Register */
  RoReg   MBIST_DUAL_STATUS; /**< (LPMCU_MISC_REGS Offset: 0x170) Reflects the status of MBIST from lpmcu and btmcu */
  __I  uint32_t Reserved14[5];
  RwReg8  DUALTIMER0_CTRL; /**< (LPMCU_MISC_REGS Offset: 0x188) DUALTIMER0 Control */
  __I  uint8_t  Reserved15[7];
  RwReg   ARM_SLEEP_WAKEUP_CTRL; /**< (LPMCU_MISC_REGS Offset: 0x190) Sleep and Wakeup Control for the AON Power Sequencer */
  __I  uint32_t Reserved16[3];
  RwReg   MEGA_MUX_IO_SEL_0; /**< (LPMCU_MISC_REGS Offset: 0x1A0) Mega Mux Selection */
  RwReg   MEGA_MUX_IO_SEL_1; /**< (LPMCU_MISC_REGS Offset: 0x1A4) Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet) */
  RwReg   MEGA_MUX_IO_SEL_2; /**< (LPMCU_MISC_REGS Offset: 0x1A8) Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet) */
  RwReg   MEGA_MUX_IO_SEL_3; /**< (LPMCU_MISC_REGS Offset: 0x1AC) Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet) */
  RwReg   MEGA_MUX_IO_SEL_4; /**< (LPMCU_MISC_REGS Offset: 0x1B0) Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet) */
  RwReg   MEGA_MUX_IO_SEL_5; /**< (LPMCU_MISC_REGS Offset: 0x1B4) Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet) */
  __I  uint32_t Reserved17[2];
  RwReg   SENS_ADC_CLK_CTRL; /**< (LPMCU_MISC_REGS Offset: 0x1C0) Clock control for the Sensor ADC */
  RoReg   SENS_ADC_RAW_STATUS; /**< (LPMCU_MISC_REGS Offset: 0x1C4) Raw Status from the Sensor ADC */
  RoReg16 SENS_ADC_CH0_DATA; /**< (LPMCU_MISC_REGS Offset: 0x1C8) Current data of the Sensor ADC for Channel 0 */
  __I  uint8_t  Reserved18[2];
  RoReg16 SENS_ADC_CH1_DATA; /**< (LPMCU_MISC_REGS Offset: 0x1CC) Current data of the Sensor ADC for Channel 1 */
  __I  uint8_t  Reserved19[2];
  RoReg16 SENS_ADC_CH2_DATA; /**< (LPMCU_MISC_REGS Offset: 0x1D0) Current data of the Sensor ADC for Channel 2 */
  __I  uint8_t  Reserved20[2];
  RoReg16 SENS_ADC_CH3_DATA; /**< (LPMCU_MISC_REGS Offset: 0x1D4) Current data of the Sensor ADC for Channel 3 */
  __I  uint8_t  Reserved21[18];
  RwReg16 IRQ_CTRL;       /**< (LPMCU_MISC_REGS Offset: 0x1E8) Configure the IRQ inputs to the system as either Rising Edge or Level Shift */
  __I  uint8_t  Reserved22[2];
  RoReg8  IRQ_STS;        /**< (LPMCU_MISC_REGS Offset: 0x1EC) Read the raw (no level or rise detect) IRQ inputs to the system from the designated cores */
  __I  uint8_t  Reserved23[19];
  RwReg   MSEMI_MEM_CTRL; /**< (LPMCU_MISC_REGS Offset: 0x200) Control the rwm, rm and wm on the Mobile Semi Memories */
  RwReg   EFUSE_1_STATUS_3; /**< (LPMCU_MISC_REGS Offset: 0x204) EFUSE_1_3 Status */
  __I  uint32_t Reserved24[2];
  RwReg16 LPMCU_FORCE_CTRL; /**< (LPMCU_MISC_REGS Offset: 0x210) Miscellaneous Force control values for LPMCU */
  __I  uint8_t  Reserved25[2];
  RoReg   ARM_IRQ_STATUS_0; /**< (LPMCU_MISC_REGS Offset: 0x214) ARM Cortex M0 IRQ Status */
  RoReg   ARM_IRQ_STATUS_1; /**< (LPMCU_MISC_REGS Offset: 0x218) ARM Cortex M0 IRQ Status */
  __I  uint32_t Reserved26[9];
  RwReg8  BLE_DEEP_SLEEP_ENABLES; /**< (LPMCU_MISC_REGS Offset: 0x240) BLE Deep Sleep Enables */
  __I  uint8_t  Reserved27[3];
  RwReg   DEEP_SLEEP_HW_TIMER_CORR; /**< (LPMCU_MISC_REGS Offset: 0x244) Configures the HW auto correction algorithm of the fine/base timers after wakeup from deep sleep */
  __I  uint32_t Reserved28[3];
  RwReg   REMAP_IDRAM1_BASE_ADDR; /**< (LPMCU_MISC_REGS Offset: 0x254) ARM Cortex M0 idram 1 remap base addr */
  RwReg   REMAP_IDRAM1_END_ADDR; /**< (LPMCU_MISC_REGS Offset: 0x258) ARM Cortex M0 idram 1 remap end addr */
  RwReg   REMAP_IDRAM2_BASE_ADDR; /**< (LPMCU_MISC_REGS Offset: 0x25C) ARM Cortex M0 idram 2 remap base addr */
  RwReg   REMAP_IDRAM2_END_ADDR; /**< (LPMCU_MISC_REGS Offset: 0x260) ARM Cortex M0 idram 2 remap end addr */
  RwReg   REMAP_BOOT_BASE_ADDR; /**< (LPMCU_MISC_REGS Offset: 0x264) ARM Cortex M0 bootrom remap base addr */
  RwReg   REMAP_BOOT_END_ADDR; /**< (LPMCU_MISC_REGS Offset: 0x268) ARM Cortex M0 bootrom remap end addr */
  __I  uint32_t Reserved29[5];
  RoReg8  QUAD_DEC_IRQS;  /**< (LPMCU_MISC_REGS Offset: 0x280) Reflects the IRQ status of the Quad Decoders */
  __I  uint8_t  Reserved30[3];
  RoReg16 QUAD_DEC0_STATUS; /**< (LPMCU_MISC_REGS Offset: 0x284) Current status of QUAD_DEC0 */
  __I  uint8_t  Reserved31[2];
  RoReg16 QUAD_DEC1_STATUS; /**< (LPMCU_MISC_REGS Offset: 0x288) Current status of QUAD_DEC1 */
  __I  uint8_t  Reserved32[2];
  RoReg16 QUAD_DEC2_STATUS; /**< (LPMCU_MISC_REGS Offset: 0x28C) Current status of QUAD_DEC2 */
  __I  uint8_t  Reserved33[2];
  RwReg   QUAD_DEC0_THRESHOLD; /**< (LPMCU_MISC_REGS Offset: 0x290) Thresholds for QUAD_DEC0 */
  RwReg8  QUAD_DEC0_CTRL; /**< (LPMCU_MISC_REGS Offset: 0x294) Control for QUAD_DEC0 */
  __I  uint8_t  Reserved34[11];
  RwReg   QUAD_DEC1_THRESHOLD; /**< (LPMCU_MISC_REGS Offset: 0x2A0) Thresholds for QUAD_DEC1 */
  RwReg8  QUAD_DEC1_CTRL; /**< (LPMCU_MISC_REGS Offset: 0x2A4) Control for QUAD_DEC1 */
  __I  uint8_t  Reserved35[11];
  RwReg   QUAD_DEC2_THRESHOLD; /**< (LPMCU_MISC_REGS Offset: 0x2B0) Thresholds for QUAD_DEC2 */
  RwReg8  QUAD_DEC2_CTRL; /**< (LPMCU_MISC_REGS Offset: 0x2B4) Control for QUAD_DEC2 */
  __I  uint8_t  Reserved36[11];
  RwReg   FP_COMP0_COMP;  /**< (LPMCU_MISC_REGS Offset: 0x2C0) Flash Breakpoint Compare Register 0 */
  RwReg   FP_COMP1_COMP;  /**< (LPMCU_MISC_REGS Offset: 0x2C4) Flash Breakpoint Compare Register 1 */
  RwReg   FP_COMP2_COMP;  /**< (LPMCU_MISC_REGS Offset: 0x2C8) Flash Breakpoint Compare Register 2 */
  RwReg   FP_COMP3_COMP;  /**< (LPMCU_MISC_REGS Offset: 0x2CC) Flash Breakpoint Compare Register 3 */
  RwReg   FP_COMP4_COMP;  /**< (LPMCU_MISC_REGS Offset: 0x2D0) Flash Breakpoint Compare Register 4 */
  RwReg   FP_COMP5_COMP;  /**< (LPMCU_MISC_REGS Offset: 0x2D4) Flash Breakpoint Compare Register 5 */
  RwReg   FP_COMP6_COMP;  /**< (LPMCU_MISC_REGS Offset: 0x2D8) Flash Breakpoint Compare Register 6 */
  RwReg   FP_COMP7_COMP;  /**< (LPMCU_MISC_REGS Offset: 0x2DC) Flash Breakpoint Compare Register 7 */
  RwReg   FP_COMP8_COMP;  /**< (LPMCU_MISC_REGS Offset: 0x2E0) Flash Breakpoint Compare Register 8 */
  RwReg   FP_COMP9_COMP;  /**< (LPMCU_MISC_REGS Offset: 0x2E4) Flash Breakpoint Compare Register 9 */
  RwReg   FP_COMP10_COMP; /**< (LPMCU_MISC_REGS Offset: 0x2E8) Flash Breakpoint Compare Register 10 */
  RwReg   FP_COMP11_COMP; /**< (LPMCU_MISC_REGS Offset: 0x2EC) Flash Breakpoint Compare Register 11 */
  RwReg   FP_COMP12_COMP; /**< (LPMCU_MISC_REGS Offset: 0x2F0) Flash Breakpoint Compare Register 12 */
  RwReg   FP_COMP13_COMP; /**< (LPMCU_MISC_REGS Offset: 0x2F4) Flash Breakpoint Compare Register 13 */
  RwReg   FP_COMP14_COMP; /**< (LPMCU_MISC_REGS Offset: 0x2F8) Flash Breakpoint Compare Register 14 */
  RwReg   FP_COMP15_COMP; /**< (LPMCU_MISC_REGS Offset: 0x2FC) Flash Breakpoint Compare Register 15 */
  RwReg   FP_COMP0_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x300) Flash Breakpoint Replace Register 0 */
  RwReg   FP_COMP1_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x304) Flash Breakpoint Replace Register 1 */
  RwReg   FP_COMP2_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x308) Flash Breakpoint Replace Register 2 */
  RwReg   FP_COMP3_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x30C) Flash Breakpoint Replace Register 3 */
  RwReg   FP_COMP4_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x310) Flash Breakpoint Replace Register 4 */
  RwReg   FP_COMP5_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x314) Flash Breakpoint Replace Register 5 */
  RwReg   FP_COMP6_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x318) Flash Breakpoint Replace Register 6 */
  RwReg   FP_COMP7_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x31C) Flash Breakpoint Replace Register 7 */
  RwReg   FP_COMP8_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x320) Flash Breakpoint Replace Register 8 */
  RwReg   FP_COMP9_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x324) Flash Breakpoint Replace Register 9 */
  RwReg   FP_COMP10_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x328) Flash Breakpoint Replace Register 10 */
  RwReg   FP_COMP11_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x32C) Flash Breakpoint Replace Register 11 */
  RwReg   FP_COMP12_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x330) Flash Breakpoint Replace Register 12 */
  RwReg   FP_COMP13_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x334) Flash Breakpoint Replace Register 13 */
  RwReg   FP_COMP14_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x338) Flash Breakpoint Replace Register 14 */
  RwReg   FP_COMP15_REPLACE; /**< (LPMCU_MISC_REGS Offset: 0x33C) Flash Breakpoint Replace Register 14 */
  RwReg16 FP_COMP_ENABLE; /**< (LPMCU_MISC_REGS Offset: 0x340) Flash Breakpoint Enable Register */
  __I  uint8_t  Reserved37[206];
  RoReg   PMU_READ_REGS;  /**< (LPMCU_MISC_REGS Offset: 0x410) PMU Status Registers */
  RwReg8  MS_GPIO;        /**< (LPMCU_MISC_REGS Offset: 0x414) Control for Mixed Signal GPIOs */
  __I  uint8_t  Reserved38[11];
  RoReg   AON_SLEEP_TIMER_COUNTER; /**< (LPMCU_MISC_REGS Offset: 0x420) Current value of the AON Sleep Timer (syncd to ARM clock) */
} LpmcuMiscRegs;

