remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lpmcu_misc_regs.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief LPMCU_MISC_REGS hardware registers */
typedef struct {  /* LPMCU Misc Registers */
  __I  LPMCU_MISC_REGS_LPMCU_CHIP_ID_Type LPMCU_CHIP_ID;  /**< Offset: 0x00 (R/   32) The hard-coded ID for the chip. */
  __IO LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_0_Type LPMCU_GLOBAL_RESET_0; /**< Offset: 0x04 (R/W  32) Active Low Global Reset */
  __IO LPMCU_MISC_REGS_LPMCU_GLOBAL_RESET_1_Type LPMCU_GLOBAL_RESET_1; /**< Offset: 0x08 (R/W  16) Active Low Global Reset */
       RoReg8                         Reserved1[0x2];
  __IO LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_0_Type LPMCU_CLOCK_ENABLES_0; /**< Offset: 0x0C (R/W  32) LPMCU Clock Enables */
  __IO LPMCU_MISC_REGS_LPMCU_CLOCK_ENABLES_1_Type LPMCU_CLOCK_ENABLES_1; /**< Offset: 0x10 (R/W  32) LPMCU Clock Enables */
  __IO LPMCU_MISC_REGS_BTMCU_CTRL_Type BTMCU_CTRL;     /**< Offset: 0x14 (R/W   8) Miscellaneous BLE control */
       RoReg8                         Reserved2[0x3];
  __IO LPMCU_MISC_REGS_LPMCU_CTRL_Type LPMCU_CTRL;     /**< Offset: 0x18 (R/W  32) Miscellaneous LPMCU control */
  __IO LPMCU_MISC_REGS_LPMCU_MBIST_Type LPMCU_MBIST;    /**< Offset: 0x1C (R/W   8) MBIST designation */
       RoReg8                         Reserved3[0x3];
  __IO LPMCU_MISC_REGS_BLE_CTRL_Type  BLE_CTRL;       /**< Offset: 0x20 (R/W   8) BLE Control */
       RoReg8                         Reserved4[0x3];
  __IO LPMCU_MISC_REGS_MBIST_CTRL_Type MBIST_CTRL;     /**< Offset: 0x24 (R/W  32) MBIST Control Register */
  __I  LPMCU_MISC_REGS_MBIST_STATUS_Type MBIST_STATUS;   /**< Offset: 0x28 (R/   32) MBIST Status Register */
  __IO LPMCU_MISC_REGS_MBIST_SRAM_ALG_SEL_Type MBIST_SRAM_ALG_SEL; /**< Offset: 0x2C (R/W  16) Enables MBIST algorithms */
       RoReg8                         Reserved5[0x2];
  __IO LPMCU_MISC_REGS_MBIST_BG_Type  MBIST_BG;       /**< Offset: 0x30 (R/W  32) MBIST Background for MARCH2 algorithm (bits 31:0) */
       RoReg8                         Reserved6[0x4];
  __IO LPMCU_MISC_REGS_TEST_BUS_CTRL_Type TEST_BUS_CTRL;  /**< Offset: 0x38 (R/W   8) Controls all of the test bus functionality */
       RoReg8                         Reserved7[0x3];
  __I  LPMCU_MISC_REGS_WP3_MISR_DATAOUT_Type WP3_MISR_DATAOUT; /**< Offset: 0x3C (R/   32) ROM MBIST Signature */
  __IO LPMCU_MISC_REGS_INVERT_OUTPUT_CTRL_Type INVERT_OUTPUT_CTRL; /**< Offset: 0x40 (R/W  32) Invert Output Control */
  __IO LPMCU_MISC_REGS_PINMUX_SEL_0_Type PINMUX_SEL_0;   /**< Offset: 0x44 (R/W  32) Pinmux select for LP_GPIO_0, LP_GPIO_1, LP_GPIO_2, LP_GPIO_3, LP_GPIO_4, LP_GPIO_5, LP_GPIO_6, LP_GPIO_7 */
  __IO LPMCU_MISC_REGS_PINMUX_SEL_1_Type PINMUX_SEL_1;   /**< Offset: 0x48 (R/W  32) Pinmux select for LP_GPIO_8, LP_GPIO_9, LP_GPIO_10, LP_GPIO_11, LP_GPIO_12, LP_GPIO_13, LP_GPIO_14, LP_GPIO_15 */
  __IO LPMCU_MISC_REGS_PINMUX_SEL_2_Type PINMUX_SEL_2;   /**< Offset: 0x4C (R/W  32) Pinmux select for LP_GPIO_16, LP_GPIO_17, LP_GPIO_18, LP_GPIO_19, LP_GPIO_20, LP_GPIO_21, LP_GPIO_22, LP_GPIO_23 */
  __IO LPMCU_MISC_REGS_PULL_ENABLE_Type PULL_ENABLE;    /**< Offset: 0x50 (R/W  32) Active Low Pull Enables for LPMCU Pads */
  __IO LPMCU_MISC_REGS_RTYPE_PAD_0_Type RTYPE_PAD_0;    /**< Offset: 0x54 (R/W  32) Controls the RTYPE (Pull Level) pad value for LPMCU Pads (0 = Pull Up) */
       RoReg8                         Reserved8[0x10];
  __IO LPMCU_MISC_REGS_PINMUX_SEL_3_Type PINMUX_SEL_3;   /**< Offset: 0x68 (R/W  32) Pinmux select for LP_SIP_0, LP_SIP_1, LP_SIP_2, LP_SIP_3, LP_SIP_4 */
  __IO LPMCU_MISC_REGS_ISHAPE_PAD_3_Type ISHAPE_PAD_3;   /**< Offset: 0x6C (R/W  32) Controls the ISHAPE pad value for LPMCU SIP Pads */
       RoReg8                         Reserved9[0x20];
  __IO LPMCU_MISC_REGS_LPMCU_CTRL_2_Type LPMCU_CTRL_2;   /**< Offset: 0x90 (R/W   8) Misc control for the LPMCU */
       RoReg8                         Reserved10[0xF];
  __IO LPMCU_MISC_REGS_SPIFLASH_VDDIO_CTRL_Type SPIFLASH_VDDIO_CTRL; /**< Offset: 0xA0 (R/W   8) Control for VDDIO of SPI FLASH */
       RoReg8                         Reserved11[0x3];
  __IO LPMCU_MISC_REGS_SPIFLASH_BYPASS_Type SPIFLASH_BYPASS; /**< Offset: 0xA4 (R/W   8) SPI FLASH Bypass */
       RoReg8                         Reserved12[0x1B];
  __IO LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_Type IRQ_MUX_IO_SEL_0; /**< Offset: 0xC0 (R/W  32) ARM Cortex IRQ Mux Selection */
  __IO LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_Type IRQ_MUX_IO_SEL_1; /**< Offset: 0xC4 (R/W  32) ARM Cortex IRQ Mux Selection */
  __IO LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_Type IRQ_MUX_IO_SEL_2; /**< Offset: 0xC8 (R/W  32) ARM Cortex IRQ Mux Selection */
  __IO LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_Type IRQ_MUX_IO_SEL_3; /**< Offset: 0xCC (R/W  32) ARM Cortex IRQ Mux Selection */
  __IO LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_Type IRQ_MUX_IO_SEL_4; /**< Offset: 0xD0 (R/W  32) ARM Cortex IRQ Mux Selection */
  __IO LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_Type IRQ_MUX_IO_SEL_5; /**< Offset: 0xD4 (R/W   8) ARM Cortex IRQ Mux Selection */
       RoReg8                         Reserved13[0x8B];
  __IO LPMCU_MISC_REGS_PWM0_CTRL_Type PWM0_CTRL;      /**< Offset: 0x160 (R/W  32) PWM0 Control Register */
  __IO LPMCU_MISC_REGS_PWM1_CTRL_Type PWM1_CTRL;      /**< Offset: 0x164 (R/W  32) PWM1 Control Register */
  __IO LPMCU_MISC_REGS_PWM2_CTRL_Type PWM2_CTRL;      /**< Offset: 0x168 (R/W  32) PWM2 Control Register */
  __IO LPMCU_MISC_REGS_PWM3_CTRL_Type PWM3_CTRL;      /**< Offset: 0x16C (R/W  32) PWM3 Control Register */
  __I  LPMCU_MISC_REGS_MBIST_DUAL_STATUS_Type MBIST_DUAL_STATUS; /**< Offset: 0x170 (R/   32) Reflects the status of MBIST from lpmcu and btmcu */
       RoReg8                         Reserved14[0x14];
  __IO LPMCU_MISC_REGS_DUALTIMER0_CTRL_Type DUALTIMER0_CTRL; /**< Offset: 0x188 (R/W   8) DUALTIMER0 Control */
       RoReg8                         Reserved15[0x7];
  __IO LPMCU_MISC_REGS_ARM_SLEEP_WAKEUP_CTRL_Type ARM_SLEEP_WAKEUP_CTRL; /**< Offset: 0x190 (R/W  32) Sleep and Wakeup Control for the AON Power Sequencer */
       RoReg8                         Reserved16[0xC];
  __IO LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_Type MEGA_MUX_IO_SEL_0; /**< Offset: 0x1A0 (R/W  32) Mega Mux Selection */
  __IO LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_Type MEGA_MUX_IO_SEL_1; /**< Offset: 0x1A4 (R/W  32) Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet) */
  __IO LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_2_Type MEGA_MUX_IO_SEL_2; /**< Offset: 0x1A8 (R/W  32) Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet) */
  __IO LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_3_Type MEGA_MUX_IO_SEL_3; /**< Offset: 0x1AC (R/W  32) Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet) */
  __IO LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_4_Type MEGA_MUX_IO_SEL_4; /**< Offset: 0x1B0 (R/W  32) Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet) */
  __IO LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_5_Type MEGA_MUX_IO_SEL_5; /**< Offset: 0x1B4 (R/W  32) Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet) */
       RoReg8                         Reserved17[0x8];
  __IO LPMCU_MISC_REGS_SENS_ADC_CLK_CTRL_Type SENS_ADC_CLK_CTRL; /**< Offset: 0x1C0 (R/W  32) Clock control for the Sensor ADC */
  __I  LPMCU_MISC_REGS_SENS_ADC_RAW_STATUS_Type SENS_ADC_RAW_STATUS; /**< Offset: 0x1C4 (R/   32) Raw Status from the Sensor ADC */
  __I  LPMCU_MISC_REGS_SENS_ADC_CH0_DATA_Type SENS_ADC_CH0_DATA; /**< Offset: 0x1C8 (R/   16) Current data of the Sensor ADC for Channel 0 */
       RoReg8                         Reserved18[0x2];
  __I  LPMCU_MISC_REGS_SENS_ADC_CH1_DATA_Type SENS_ADC_CH1_DATA; /**< Offset: 0x1CC (R/   16) Current data of the Sensor ADC for Channel 1 */
       RoReg8                         Reserved19[0x2];
  __I  LPMCU_MISC_REGS_SENS_ADC_CH2_DATA_Type SENS_ADC_CH2_DATA; /**< Offset: 0x1D0 (R/   16) Current data of the Sensor ADC for Channel 2 */
       RoReg8                         Reserved20[0x2];
  __I  LPMCU_MISC_REGS_SENS_ADC_CH3_DATA_Type SENS_ADC_CH3_DATA; /**< Offset: 0x1D4 (R/   16) Current data of the Sensor ADC for Channel 3 */
       RoReg8                         Reserved21[0x12];
  __IO LPMCU_MISC_REGS_IRQ_CTRL_Type  IRQ_CTRL;       /**< Offset: 0x1E8 (R/W  16) Configure the IRQ inputs to the system as either Rising Edge or Level Shift */
       RoReg8                         Reserved22[0x2];
  __I  LPMCU_MISC_REGS_IRQ_STS_Type   IRQ_STS;        /**< Offset: 0x1EC (R/    8) Read the raw (no level or rise detect) IRQ inputs to the system from the designated cores */
       RoReg8                         Reserved23[0x13];
  __IO LPMCU_MISC_REGS_MSEMI_MEM_CTRL_Type MSEMI_MEM_CTRL; /**< Offset: 0x200 (R/W  32) Control the rwm, rm and wm on the Mobile Semi Memories */
  __IO LPMCU_MISC_REGS_EFUSE_1_STATUS_3_Type EFUSE_1_STATUS_3; /**< Offset: 0x204 (R/W  32) EFUSE_1_3 Status */
       RoReg8                         Reserved24[0x8];
  __IO LPMCU_MISC_REGS_LPMCU_FORCE_CTRL_Type LPMCU_FORCE_CTRL; /**< Offset: 0x210 (R/W  16) Miscellaneous Force control values for LPMCU */
       RoReg8                         Reserved25[0x2];
  __I  LPMCU_MISC_REGS_ARM_IRQ_STATUS_0_Type ARM_IRQ_STATUS_0; /**< Offset: 0x214 (R/   32) ARM Cortex M0 IRQ Status */
  __I  LPMCU_MISC_REGS_ARM_IRQ_STATUS_1_Type ARM_IRQ_STATUS_1; /**< Offset: 0x218 (R/   32) ARM Cortex M0 IRQ Status */
       RoReg8                         Reserved26[0x24];
  __IO LPMCU_MISC_REGS_BLE_DEEP_SLEEP_ENABLES_Type BLE_DEEP_SLEEP_ENABLES; /**< Offset: 0x240 (R/W   8) BLE Deep Sleep Enables */
       RoReg8                         Reserved27[0x3];
  __IO LPMCU_MISC_REGS_DEEP_SLEEP_HW_TIMER_CORR_Type DEEP_SLEEP_HW_TIMER_CORR; /**< Offset: 0x244 (R/W  32) Configures the HW auto correction algorithm of the fine/base timers after wakeup from deep sleep */
       RoReg8                         Reserved28[0xC];
  __IO LPMCU_MISC_REGS_REMAP_IDRAM1_BASE_ADDR_Type REMAP_IDRAM1_BASE_ADDR; /**< Offset: 0x254 (R/W  32) ARM Cortex M0 idram 1 remap base addr */
  __IO LPMCU_MISC_REGS_REMAP_IDRAM1_END_ADDR_Type REMAP_IDRAM1_END_ADDR; /**< Offset: 0x258 (R/W  32) ARM Cortex M0 idram 1 remap end addr */
  __IO LPMCU_MISC_REGS_REMAP_IDRAM2_BASE_ADDR_Type REMAP_IDRAM2_BASE_ADDR; /**< Offset: 0x25C (R/W  32) ARM Cortex M0 idram 2 remap base addr */
  __IO LPMCU_MISC_REGS_REMAP_IDRAM2_END_ADDR_Type REMAP_IDRAM2_END_ADDR; /**< Offset: 0x260 (R/W  32) ARM Cortex M0 idram 2 remap end addr */
  __IO LPMCU_MISC_REGS_REMAP_BOOT_BASE_ADDR_Type REMAP_BOOT_BASE_ADDR; /**< Offset: 0x264 (R/W  32) ARM Cortex M0 bootrom remap base addr */
  __IO LPMCU_MISC_REGS_REMAP_BOOT_END_ADDR_Type REMAP_BOOT_END_ADDR; /**< Offset: 0x268 (R/W  32) ARM Cortex M0 bootrom remap end addr */
       RoReg8                         Reserved29[0x14];
  __I  LPMCU_MISC_REGS_QUAD_DEC_IRQS_Type QUAD_DEC_IRQS;  /**< Offset: 0x280 (R/    8) Reflects the IRQ status of the Quad Decoders */
       RoReg8                         Reserved30[0x3];
  __I  LPMCU_MISC_REGS_QUAD_DEC0_STATUS_Type QUAD_DEC0_STATUS; /**< Offset: 0x284 (R/   16) Current status of QUAD_DEC0 */
       RoReg8                         Reserved31[0x2];
  __I  LPMCU_MISC_REGS_QUAD_DEC1_STATUS_Type QUAD_DEC1_STATUS; /**< Offset: 0x288 (R/   16) Current status of QUAD_DEC1 */
       RoReg8                         Reserved32[0x2];
  __I  LPMCU_MISC_REGS_QUAD_DEC2_STATUS_Type QUAD_DEC2_STATUS; /**< Offset: 0x28C (R/   16) Current status of QUAD_DEC2 */
       RoReg8                         Reserved33[0x2];
  __IO LPMCU_MISC_REGS_QUAD_DEC0_THRESHOLD_Type QUAD_DEC0_THRESHOLD; /**< Offset: 0x290 (R/W  32) Thresholds for QUAD_DEC0 */
  __IO LPMCU_MISC_REGS_QUAD_DEC0_CTRL_Type QUAD_DEC0_CTRL; /**< Offset: 0x294 (R/W   8) Control for QUAD_DEC0 */
       RoReg8                         Reserved34[0xB];
  __IO LPMCU_MISC_REGS_QUAD_DEC1_THRESHOLD_Type QUAD_DEC1_THRESHOLD; /**< Offset: 0x2A0 (R/W  32) Thresholds for QUAD_DEC1 */
  __IO LPMCU_MISC_REGS_QUAD_DEC1_CTRL_Type QUAD_DEC1_CTRL; /**< Offset: 0x2A4 (R/W   8) Control for QUAD_DEC1 */
       RoReg8                         Reserved35[0xB];
  __IO LPMCU_MISC_REGS_QUAD_DEC2_THRESHOLD_Type QUAD_DEC2_THRESHOLD; /**< Offset: 0x2B0 (R/W  32) Thresholds for QUAD_DEC2 */
  __IO LPMCU_MISC_REGS_QUAD_DEC2_CTRL_Type QUAD_DEC2_CTRL; /**< Offset: 0x2B4 (R/W   8) Control for QUAD_DEC2 */
       RoReg8                         Reserved36[0xB];
  __IO LPMCU_MISC_REGS_FP_COMP0_COMP_Type FP_COMP0_COMP;  /**< Offset: 0x2C0 (R/W  32) Flash Breakpoint Compare Register 0 */
  __IO LPMCU_MISC_REGS_FP_COMP1_COMP_Type FP_COMP1_COMP;  /**< Offset: 0x2C4 (R/W  32) Flash Breakpoint Compare Register 1 */
  __IO LPMCU_MISC_REGS_FP_COMP2_COMP_Type FP_COMP2_COMP;  /**< Offset: 0x2C8 (R/W  32) Flash Breakpoint Compare Register 2 */
  __IO LPMCU_MISC_REGS_FP_COMP3_COMP_Type FP_COMP3_COMP;  /**< Offset: 0x2CC (R/W  32) Flash Breakpoint Compare Register 3 */
  __IO LPMCU_MISC_REGS_FP_COMP4_COMP_Type FP_COMP4_COMP;  /**< Offset: 0x2D0 (R/W  32) Flash Breakpoint Compare Register 4 */
  __IO LPMCU_MISC_REGS_FP_COMP5_COMP_Type FP_COMP5_COMP;  /**< Offset: 0x2D4 (R/W  32) Flash Breakpoint Compare Register 5 */
  __IO LPMCU_MISC_REGS_FP_COMP6_COMP_Type FP_COMP6_COMP;  /**< Offset: 0x2D8 (R/W  32) Flash Breakpoint Compare Register 6 */
  __IO LPMCU_MISC_REGS_FP_COMP7_COMP_Type FP_COMP7_COMP;  /**< Offset: 0x2DC (R/W  32) Flash Breakpoint Compare Register 7 */
  __IO LPMCU_MISC_REGS_FP_COMP8_COMP_Type FP_COMP8_COMP;  /**< Offset: 0x2E0 (R/W  32) Flash Breakpoint Compare Register 8 */
  __IO LPMCU_MISC_REGS_FP_COMP9_COMP_Type FP_COMP9_COMP;  /**< Offset: 0x2E4 (R/W  32) Flash Breakpoint Compare Register 9 */
  __IO LPMCU_MISC_REGS_FP_COMP10_COMP_Type FP_COMP10_COMP; /**< Offset: 0x2E8 (R/W  32) Flash Breakpoint Compare Register 10 */
  __IO LPMCU_MISC_REGS_FP_COMP11_COMP_Type FP_COMP11_COMP; /**< Offset: 0x2EC (R/W  32) Flash Breakpoint Compare Register 11 */
  __IO LPMCU_MISC_REGS_FP_COMP12_COMP_Type FP_COMP12_COMP; /**< Offset: 0x2F0 (R/W  32) Flash Breakpoint Compare Register 12 */
  __IO LPMCU_MISC_REGS_FP_COMP13_COMP_Type FP_COMP13_COMP; /**< Offset: 0x2F4 (R/W  32) Flash Breakpoint Compare Register 13 */
  __IO LPMCU_MISC_REGS_FP_COMP14_COMP_Type FP_COMP14_COMP; /**< Offset: 0x2F8 (R/W  32) Flash Breakpoint Compare Register 14 */
  __IO LPMCU_MISC_REGS_FP_COMP15_COMP_Type FP_COMP15_COMP; /**< Offset: 0x2FC (R/W  32) Flash Breakpoint Compare Register 15 */
  __IO LPMCU_MISC_REGS_FP_COMP0_REPLACE_Type FP_COMP0_REPLACE; /**< Offset: 0x300 (R/W  32) Flash Breakpoint Replace Register 0 */
  __IO LPMCU_MISC_REGS_FP_COMP1_REPLACE_Type FP_COMP1_REPLACE; /**< Offset: 0x304 (R/W  32) Flash Breakpoint Replace Register 1 */
  __IO LPMCU_MISC_REGS_FP_COMP2_REPLACE_Type FP_COMP2_REPLACE; /**< Offset: 0x308 (R/W  32) Flash Breakpoint Replace Register 2 */
  __IO LPMCU_MISC_REGS_FP_COMP3_REPLACE_Type FP_COMP3_REPLACE; /**< Offset: 0x30C (R/W  32) Flash Breakpoint Replace Register 3 */
  __IO LPMCU_MISC_REGS_FP_COMP4_REPLACE_Type FP_COMP4_REPLACE; /**< Offset: 0x310 (R/W  32) Flash Breakpoint Replace Register 4 */
  __IO LPMCU_MISC_REGS_FP_COMP5_REPLACE_Type FP_COMP5_REPLACE; /**< Offset: 0x314 (R/W  32) Flash Breakpoint Replace Register 5 */
  __IO LPMCU_MISC_REGS_FP_COMP6_REPLACE_Type FP_COMP6_REPLACE; /**< Offset: 0x318 (R/W  32) Flash Breakpoint Replace Register 6 */
  __IO LPMCU_MISC_REGS_FP_COMP7_REPLACE_Type FP_COMP7_REPLACE; /**< Offset: 0x31C (R/W  32) Flash Breakpoint Replace Register 7 */
  __IO LPMCU_MISC_REGS_FP_COMP8_REPLACE_Type FP_COMP8_REPLACE; /**< Offset: 0x320 (R/W  32) Flash Breakpoint Replace Register 8 */
  __IO LPMCU_MISC_REGS_FP_COMP9_REPLACE_Type FP_COMP9_REPLACE; /**< Offset: 0x324 (R/W  32) Flash Breakpoint Replace Register 9 */
  __IO LPMCU_MISC_REGS_FP_COMP10_REPLACE_Type FP_COMP10_REPLACE; /**< Offset: 0x328 (R/W  32) Flash Breakpoint Replace Register 10 */
  __IO LPMCU_MISC_REGS_FP_COMP11_REPLACE_Type FP_COMP11_REPLACE; /**< Offset: 0x32C (R/W  32) Flash Breakpoint Replace Register 11 */
  __IO LPMCU_MISC_REGS_FP_COMP12_REPLACE_Type FP_COMP12_REPLACE; /**< Offset: 0x330 (R/W  32) Flash Breakpoint Replace Register 12 */
  __IO LPMCU_MISC_REGS_FP_COMP13_REPLACE_Type FP_COMP13_REPLACE; /**< Offset: 0x334 (R/W  32) Flash Breakpoint Replace Register 13 */
  __IO LPMCU_MISC_REGS_FP_COMP14_REPLACE_Type FP_COMP14_REPLACE; /**< Offset: 0x338 (R/W  32) Flash Breakpoint Replace Register 14 */
  __IO LPMCU_MISC_REGS_FP_COMP15_REPLACE_Type FP_COMP15_REPLACE; /**< Offset: 0x33C (R/W  32) Flash Breakpoint Replace Register 14 */
  __IO LPMCU_MISC_REGS_FP_COMP_ENABLE_Type FP_COMP_ENABLE; /**< Offset: 0x340 (R/W  16) Flash Breakpoint Enable Register */
       RoReg8                         Reserved37[0xCE];
  __I  LPMCU_MISC_REGS_PMU_READ_REGS_Type PMU_READ_REGS;  /**< Offset: 0x410 (R/   32) PMU Status Registers */
  __IO LPMCU_MISC_REGS_MS_GPIO_Type   MS_GPIO;        /**< Offset: 0x414 (R/W   8) Control for Mixed Signal GPIOs */
       RoReg8                         Reserved38[0xB];
  __I  LPMCU_MISC_REGS_AON_SLEEP_TIMER_COUNTER_Type AON_SLEEP_TIMER_COUNTER; /**< Offset: 0x420 (R/   32) Current value of the AON Sleep Timer (syncd to ARM clock) */
} LpmcuMiscRegs;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_LPMCU_MISC_REGS_COMPONENT_ */
